{
  "metadata": {
    "url": "https://www.madewithnestle.ca/about-us",
    "category": "About",
    "title": "Nutritious and Delicious Choices and Recipes Made With Nestlé",
    "n_tokens": 526,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/static/nestle-ca-aboutus/henri.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/_static/nestle-ca-aboutus/kitkatbreak/frame_0_delay-0.01s.gif",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/static/nestle-ca-aboutus/grid_icecream.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/static/nestle-ca-aboutus/grid_mobile_icecream.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/static/nestle-ca-aboutus/gradient.png",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "BrandChocolate & TreatsAeroCOFFEE CRISPKit KatAfter EightBig TurkCrunchDrumstick bitesEaster chocolates and treatsMackintosh ToffeeMirageQuality StreetRoloSmartiesTurtlesCoffeeCoffee MateNESCAFÉIce Cream & Frozen TreatsConfectionery Frozen DessertsHäagen-DazsDrumstickDel MonteParlourReal DairyInfant NutritionNidoNestlé MaternaMeal Times Made EasyMAGGINutrition +BOOST KidsBoostNature's BountyPet FoodsPurinaSpring & Sparkling WaterMaison PerrierPerrierSan PellegrinoQuick-Mix DrinksCarnation Hot ChocolateNesquikGoodHostMiloNESTEANesfruta",
    "Chocolate & TreatsAfter EightBig TurkKit KatAeroCOFFEE CRISPMackintosh ToffeeEaster chocolates and treatsCrunchDrumstick bitesMirageSmartiesTurtlesQuality StreetRolo",
    "Spring & Sparkling WaterSan PellegrinoMaison PerrierPerrier",
    "Quick-Mix DrinksCarnation Hot ChocolateGoodHostNesquikNESTEAMiloNesfruta",
    "We are Nestlé",
    "We make meals and snacks that complement busy days, and warm sips to savour with slow moments. We also make\n\t\t\tnutrition solutions to help you through different life stages. We make it all with a drive to constantly improve\n\t\t\tour products and our company.",
    "This is our story",
    "150",
    "Years in themaking!",
    "It all started in 1867 with a man named Henri",
    "Nutrition has always been at the heart of what we do. Our story began when Henri Nestlé developed the first\n\t\t\t\t\tmilk-based baby formula for babies who were unable to feed from their mothers. His Farine Lactée formula\n\t\t\t\t\tactually saved the life of his neighbour’s premature baby. You might say he was an olden day hero!",
    "A lot has changed over the last 150 years. But our unwavering commitment to making good food\n\t\t\t\t\thasn’t.",
    "A world of nutritious and delicious choices, made with Nestlé",
    "Yes, we make yourFavourite Chocolate",
    "But that’s just a teeny tiny part of what we do",
    "The perfect scoop",
    "We make dinners that bring the",
    "Whole family together",
    "refreshing",
    "And",
    "heartwarming",
    "We makedownright irresistible",
    "We makedownright irresistibleSee Recipes",
    "We make strong,",
    "growing babies",
    "We make nourishment for",
    "healthy lives",
    "We even make",
    "tails wag!",
    "Nestlé makes good, too",
    "Of all the things we make, we are proudest of the ones that make a positive difference",
    "40% Less Sugar!",
    "4 flavours made with 5 simple (and simply delicious) ingredients",
    "No artificial flavours or colours here",
    "10%",
    "We’re reducing sugar, saturated fat, and salt across all our products by 10% by the end of this year.",
    "More good changes to come!",
    "Striving for better, from bean to bar",
    "Our favourite ingredient is care. Check out the sustainability story behind your favourite chocolate bars.",
    "There's no taste like home",
    "We're proud to make many of our products right here in Canada.",
    "We feed our community more than great food",
    "We're proud of our initiatives that help foster stronger, healthier communities.",
    "We’ve donated over 1 Million bottles of water to communities affected by Natural disasters, dehydration and\n\t\tmunicipal water failures.",
    "Youth @ workOver the next 3 years, we’re helping 5,000 young Canadians develop their professional skills, grow their\n\t\t\t\tnetwork, and increase their employability.Care to join us?",
    "Nestlé caresAll our employees are given day a year to volunteer. But many of us go way beyond!",
    "A proud partner",
    "We are proud to work with all of these amazing organizations.",
    "This may be the end of the page, but it’s nowhere near the end of our story. We’re committed to constantly\n\t\tchallenging and improving ourselves to make the best products we can, and to be the best company we can be.",
    "Check out our latest news to see how we’re bringing Good Food, Good Life to your kitchen table, and the world!"
  ]
}