{
  "metadata": {
    "url": "https://www.madewithnestle.ca/aero/aero-scoops-vanilla-bean",
    "category": "Product",
    "title": "AERO Scoops Vanilla Bean",
    "n_tokens": 486,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/AERO-Valentines-Milk-Chocolates-30-pack-Carton-219g.jpg?itok=clxSSiLq",
        "role": "package",
        "alt": "AERO Valentine's Minis 30-pack, 219 g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/aero-scoops-vanilla-bean.png",
        "role": "secondary",
        "alt": "AERO Scoops Vanilla Bean "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/aero-smores-bar.png?itok=ZMk_Qc8L",
        "role": "secondary",
        "alt": "AERO S'Mores bar limited edition"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/aero-scoops-double-chocolate_0.png?itok=aA5AbONt",
        "role": "secondary",
        "alt": " AERO Scoops Double Chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/aero-scoops-choco-strw-header.png?itok=ANSnzJRE",
        "role": "secondary",
        "alt": "Aero chocolate bar scoops"
      }
    ]
  },
  "text": [
    "AERO Scoops Vanilla Bean",
    "Indulge in NESTLÉ AERO SCOOPS Vanilla Bean, where smooth milk chocolate meets AERO's melt-in-your-mouth bubbles and a delicious vanilla bean ice cream-flavoured filling. Easy to break off pieces make sharing with family and friends effortless. Proudly prepared in Canada, NESTLÉ AERO SCOOPS Vanilla Bean are made with quality ingredients including, natural flavours. As part of a commitment to sustainability practices, NESTLÉ purchases sustainably sourced cocoa certified by the Rainforest Alliance. Besides creating delicious treats, NESTLÉ supports a worthy cause. For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service. Enjoy the rich combination of milk chocolate, bubbles, and vanilla bean ice cream-flavoured filling in NESTLÉ AERO SCOOPS Vanilla Bean, and feel the bubbles melt!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "AERO Scoops Vanilla BeanFeatures and Benefits",
    "Feel The Bubbles Melt: Indulge in NESTLÉ AERO SCOOPS Vanilla Bean featuring milk chocolate, AERO's melt-in-your-mouth bubbles, and vanilla bean ice cream-flavoured filling",
    "Perfect For Sharing: Easy to break off pieces make this decadent treat perfect to share with family and friends",
    "Proudly Prepared In Canada: NESTLÉ AERO SCOOPS Vanilla Bean are prepared in Canada",
    "Quality Ingredients: NESTLÉ AERO SCOOPS Vanilla Bean are made with natural flavours",
    "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance-certified cocoa",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "AERO Scoops Vanilla BeanNutrition Information",
    "Per 8 pieces (40g)Amount% DVCalories220Carbohydrate23gDietary Fibre1g4%Sugars22g22%Fat14g19%Cholesterol10mgSaturated8gTrans Fat0.1gProtein2gSodium30mg1%Amount% DVCalcium75mg6%Iron0.5mg3%Potassium125mg4%",
    "AERO Scoops Vanilla BeanIngredients",
    "Sugars (sugar, lactose), Modified milk ingredients, Cocoa butter‡, Unsweetened chocolate‡, Modified palm oil, Soy lecithin, Polyglycerol polyricinoleate, Natural flavour. ‡Rainforest Alliance Certified",
    "RECIPES",
    "German Lebkuchen",
    "Lebkuchen, sometimes called Pfefferkuchen, is a German treat somewhat similar to gingerbread. These soft, moist and nutty cookies have become a part of Germany’s Christmas traditions. Try these honey-sweetened cookies made with NESTLÉ CLASSIC Semisweet Chocolate, almonds, cloves and nutmeg.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "DECONSTRUCTED BANANA BOAT S’MORES",
    "AERO Dark Chocolate and Fruit Coins",
    "These discs, also known as French chocolate mendicants, make a great hostess gift. Instead of an elaborate dessert, why not serve these delicious treats with after-dinner coffee?",
    "AERO Bubbly Hot Chocolate",
    "Fall and bubbly hot chocolate are so mint to be, don’t you think?",
    "Berry Bubbly AERO Kebobs",
    "A fresh and fun idea for your Valentine's Day celebrations!",
    "You might be interested in",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}