{
  "metadata": {
    "url": "https://www.madewithnestle.ca/aero/aero-valentines-minis-30-pack-219-g",
    "category": "Product",
    "title": "AERO Valentine's Minis 30-pack, 219 g",
    "n_tokens": 440,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2023-12/AERO-Valentines-Milk-Chocolates-30-pack-Carton-219g.jpg",
        "role": "package",
        "alt": "AERO Valentine's Minis 30-pack, 219 g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/aero-smores-bar.png?itok=ZMk_Qc8L",
        "role": "secondary",
        "alt": "AERO S'Mores bar limited edition"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/aero-scoops-vanilla-bean.png?itok=c3v1jbpo",
        "role": "secondary",
        "alt": "AERO Scoops Vanilla Bean "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/aero-scoops-double-chocolate_0.png?itok=aA5AbONt",
        "role": "secondary",
        "alt": " AERO Scoops Double Chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/aero-scoops-choco-strw-header.png?itok=ANSnzJRE",
        "role": "secondary",
        "alt": "Aero chocolate bar scoops"
      }
    ]
  },
  "text": [
    "AERO Valentine's Minis 30-pack, 219 g",
    "Love is in the AERO! This Valentine's Day, give a sweet little treat. AERO Valentine's Milk Chocolates 30-pack Carton (219 g) makes for the perfect Valentine's gift for the people you care about – it's filled with bite-sized versions of our classic, bubbly milk chocolates in a box that doubles as a Valentine's card that you can personalize with a special message for that special someone. A delight for whoever receives it, filled with more than enough to share with a group. Plus, it's prepared in Canada with all-natural flavours and it's peanut free, for even more reasons to enjoy this light, airy, chocolatey treat. FEEL THE BUBBLES MELT this Valentine's Day!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "AERO Valentine's Minis 30-pack, 219 gFeatures and Benefits",
    "Our classic bubbly AERO milk chocolate, in a bite sized bar",
    "Peanut-free milk chocolate AERO Juniors with Valentine’s wrappers​",
    "Our cocoa is sustainably sourced and certified, as part of the NESTLÉ COCOA PLAN​",
    "Locally-made featuring our Prepared in Canada seal on front of pack​​",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Classic bubbly AERO milk chocolate, in a bite sized bar",
    "Each wrapper contains space for a personalized message",
    "AERO Valentine's Minis 30-pack, 219 gNutrition Information",
    "Per 6 Bars (44g)Amount% DVCalories230Carbohydrate28gDietary Fiber1g4%Sugars26g26%Fat12g16%Cholesterol10mgSaturated Fat7gTrans Fat0.1gProtein3gSodium40mg2%Amount% DVCalcium75mg6%Iron1mg6%Potassium200mg4%",
    "AERO Valentine's Minis 30-pack, 219 gIngredients",
    "Milk Chocolate (Sugar, Modified Milk Ingredients, Cocoa Butter*, Unsweetened Chocolate*, Soy Lecithin, Polyglycerol Polyricinoleate, Natural Flavour). *Rainforest Alliance certified. May Contain: Wheat.",
    "RECIPES",
    "German Lebkuchen",
    "Lebkuchen, sometimes called Pfefferkuchen, is a German treat somewhat similar to gingerbread. These soft, moist and nutty cookies have become a part of Germany’s Christmas traditions. Try these honey-sweetened cookies made with NESTLÉ CLASSIC Semisweet Chocolate, almonds, cloves and nutmeg.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "DECONSTRUCTED BANANA BOAT S’MORES",
    "AERO Dark Chocolate and Fruit Coins",
    "These discs, also known as French chocolate mendicants, make a great hostess gift. Instead of an elaborate dessert, why not serve these delicious treats with after-dinner coffee?",
    "AERO Bubbly Hot Chocolate",
    "Fall and bubbly hot chocolate are so mint to be, don’t you think?",
    "Berry Bubbly AERO Kebobs",
    "A fresh and fun idea for your Valentine's Day celebrations!",
    "You might be interested in"
  ]
}