{
  "metadata": {
    "url": "https://www.madewithnestle.ca/blog/world-flavours-secret-ingredient-your-next-meal",
    "category": "Blog",
    "title": "A World of Flavours: Something for Everyone",
    "n_tokens": 420,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-03/BOOST%20Article%20Image.png",
        "role": "secondary",
        "alt": "10 Foods that Give Energy"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/Omega3-Feb-Blog-header.jpg",
        "role": "secondary",
        "alt": "Omega3-Feb-Blog-header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-01/Nestle-Nesquik-Happy-Tummies-banner.jpg",
        "role": "secondary",
        "alt": "Nestle-Nesquik-Happy-Tummies-banner"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-11/Pay-Attention-to-Protein-at-Breakfast-header%20%281%29.jpg",
        "role": "secondary",
        "alt": "Pay-Attention-to-Protein-at-Breakfast-mainly-header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-11/5%20Elements%20of%20Eating%20for%20Energy.jpeg",
        "role": "secondary",
        "alt": "5-Elements-of-Eating-for-Energy-header"
      }
    ]
  },
  "text": [
    "A World of Flavours: The Secret Ingredient for Your Next Meal",
    "Thursday, November 02, 2023",
    "ShareTweetEmailPinPrint",
    "When you gather to prepare a meal together, you can learn so much about other cultures. The act of cooking together calls on all of your senses – chopping ingredients, kneading dough, smelling simmering sauces, tasting freshly baked goods and, of course, sharing stories about your family traditions and customs.",
    "Preparing meals with others helps us connect with others. And it offers us the opportunity to explore a range of tastes from around the world. With A World of Flavours, you can do that all from the comfort of your own kitchen. If you're looking for new or old favourite dishes to share with others, you’ve come to the right place!",
    "Something for Everyone",
    "Whether you’re looking for a different take on a family favourite or a new meal for the upcoming holidays, A World of Flavours has quick and easy recipes for all kinds of occasions. Explore delicious ways to celebrate Eid with recipes such as KitKat® Matka Kulfi.This recipe will bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka. Or try our unique take on ourNankhataifor Diwali, where we combine the classic cookie recipe, with its buttery and melt-in-your-mouth texture, with Quality Street® sweets for the best of both worlds. If you’d like to explore French-Canadian culture, ourBite-Size Chocolate Cinnamon Pets de Soeurare simple to prepare and use ingredients you probably already have in your pantry.",
    "The Global Kitchen",
    "Canadian cuisine is a beautiful blend of various cultures, resulting in dinner tables with a diverse and delicious range of tastes and flavours. By embracing food from around the world, you not only get to enjoy new recipes but also learn about the traditions and stories that come with them. A World of Flavours recipes can help you create a memorable cooking experience while experimenting with different flavours and techniques from around the globe.",
    "Get ready to impress guests with a variety of delicious recipes from around the world. We're confident your friends and family will be asking for your recipes after their first few bites. Check outA World of Flavourswebsite andsign up for our newsletterto stay up-to-date on new products, recipes and promotions.",
    "Latest",
    "10 Foods that Give You Energy",
    "Exploring Heart Health & Omega-3 Supplements Beyond Fish Oil",
    "Pay Attention to Protein at Breakfast",
    "5 Elements of Eating for Energy",
    "Digestive Balance: It’s in your Nature to Thrive",
    "Kids  gummies",
    "Spotlight on the Sunshine Vitamin"
  ]
}