{
  "metadata": {
    "url": "https://www.madewithnestle.ca/blog/spotlight-sunshine-vitamin",
    "category": "Blog",
    "title": "Spotlight on the Sunshine Vitamin",
    "n_tokens": 1018,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Spotlight on the Sunshine Vitamin",
    "Wednesday, August 28, 2024",
    "ShareTweetEmailPinPrint",
    "Did you know that one of the largest surveys of Canadian Health (The Canadian Health Measures Survey) found that one quarter (26%) had inadequate levels, almost one in ten (8%) were considered deficient? (1). Statistics like this can help explain why vitamin D has overtaken vitamin C as the most popular supplement in Canada.",
    "What is vitamin D?",
    "Vitamin D is one of four fat-soluble vitamins needed by the body, often called the “sunshine vitamin” because it’s made in our skin upon exposure to the sun’s ultraviolet rays (2). Most of us know vitamin D is important for healthy bones and teeth. This is because it helps our bodies absorb calcium from our diets (2). However, vitamin D is required for numerous other functions in the body. These include immunity and muscle strength to name a few!",
    "Can’t I get enough vitamin D from my diet?",
    "While not impossible, it’s difficult to get sufficient levels from food alone and unrealistic for most people. It is important to include these foods along with any fortified options but do not rely on them for your total daily needs (3).",
    "How do I know if I am low in vitamin D?",
    "Some of the signs you may notice when low in vitamin D include muscle weakness and pain, low energy, recurrent infections, and bone pain among others (3,4). However, the best way to check whether you need extra vitamin D is through a blood test.",
    "How can I make sure I get enough vitamin D?",
    "As well as consuming fish, eggs, mushrooms enriched with vitamin D & fortified foods, a good way is to get some sunshine! You’ll want to consider the time of day because the sun’s not usually strong enough to make vitamin D in the early morning or late afternoon. During winter months in locations with a northern latitude (like Canada) the sun might also not be strong enough for your skin to make any vitamin D at all.",
    "The best time in the Canada to make vitamin D from unprotected sun exposure is in the spring and summer months between the hours of 11:00 and 15:00 (5). This is when the sun is at its strongest, safe sensible sun exposure is a must. A general guideline is to expose skin such as from arms and legs for a few minutes at least three times a week to achieve and maintain optimal vitamin D levels (6). If concerned about fine lines and wrinkles, you can make sure you protect your face by either covering up or applying sun cream.",
    "Consider a supplement:",
    "Vitamin D is normally provided in two diﬀerent forms: Vitamin D2 (ergocalciferol) and vitamin D3 (cholecalciferol) (2). Vitamin D2 is found primarily in mushrooms grown under extra UV light. Vitamin D3 is found in egg yolks, liver, or oily fish (3). Vitamin D3 tends to be the preferred form as it is more potent and bioavailable, so it gets to work faster in your body (7).",
    "Health Canada guidelines recommend including foods or a supplement every day (2). If you are between 2 and 50 years of age, eat foods that contain vitamin D every day or take a supplement containing 400 IU (10 ug) of vitamin D. If you are over 51 years of age or older, dietary guidelines require a daily vitamin D supplement containing 400 IU (10 ug) of vitamin D (2).",
    "What should I look for when choosing a vitamin D Supplement?",
    "Nature’s Bounty Offers a variety of strengths and formats to suit your vitamin D needs. Choose between our gummies and soft gel options.",
    "Vitamin D3 Softgels (1000 IU)",
    "Vitamin D3 Gummies",
    "Vegetarian D3 Tablets (2500 IU)",
    "Vitamin D3 1000 IU 100 Softgels | Made with nestle",
    "Vitamin D3 Gummies 90 | Made with nestle",
    "Vegetarian Vitamin D3 2500 IU 90 Tablets | Made with nestle",
    "Multivitamins can also be a source of Vitamin D, Nature’s Bounty Gummy Multivitamin can easily fit into your wellness routine. Talk to a dietitian, pharmacist, or your health care provider when starting new supplements and if you have questions about the type or amount of supplement that's best for you.",
    "Is taking a vitamin D supplement safe?",
    "A total daily intake (from all sources; supplements and food) of 4000 IU (100 µg) of Vitamin D is considered safe for adults (9). Higher amounts should only be taken under a doctor’s supervision.",
    "The Bottom Line",
    "Vitamin D plays many critical roles in the body, so it’s important to make sure you are getting enough. Correcting a suboptimal vitamin D status or vitamin D deficiency is easy with the right diet, supplementation, and safe sun exposure. It could also have a big impact on your health!",
    "Check out Nature’s Bounty range of vitamin D supplements, to find the best one to suit your needs.",
    "If you’re pregnant, breastfeeding, taking any medication or under medical supervision, please consult dietitian, pharmacist, or your health care provider before using supplements.",
    "References:",
    "Government of Canada SC. Shedding light on Canada’s vitamin D levels as we approach the shortest day of the year. 2023. Available from:https://www.statcan.gc.ca/o1/en/plus/5095-shedding-light-canadas-vitamin-d-levels-we-approach-shortest-day-year",
    "Canada H. Vitamin D. 2017. Available from:https://www.canada.ca/en/health-canada/services/nutrients/vitamin-d.html",
    "Canada H. Canada Food Guide. 2022. Advice on vitamin and mineral supplementation. Available from:https://food-guide.canada.ca/en/applying-guidelines/advice-vitamin-mineral-supplementation/",
    "Siddiqui M, Manansala JS, Abdulrahman HA, Nasrallah GK, Smatti MK, Younes N, et al. Immune Modulatory Eﬀects of Vitamin D on Viral Infections. Nutrients. 2020 Sep 21;12(9):2879.",
    "Moan J, Dahlback A, Porojnicu AC. At what time should one go out in the sun? Adv Exp Med Biol. 2008;624:86–8.",
    "Chalcraft JR, Cardinal LM, Wechsler PJ, Hollis BW, Gerow KG, Alexander BM, et al. Vitamin D Synthesis Following a Single Bout of Sun Exposure in Older and Younger Men and Women. Nutrients. 2020 Jul 27;12(8):2237.",
    "Heaney RP, Recker RR, Grote J, Horst RL, Armas LAG. Vitamin D3 is more potent than vitamin D2 in humans. J Clin Endocrinol Metab. Published online 2011. doi:10.1210/jc.2010-2230.",
    "Vitamin D and Your Health | HealthLink BC [Internet]. Available from:https://www.healthlinkbc.ca/healthlinkbc-files/vitamin-d-and-your-health",
    "Canada H. Notice: Prescription Drug List (PDL): Vitamin D [Internet]. 2021. Available from:https://www.canada.ca/en/health-canada/services/drugs-health-products/drug-products/prescription-drug-list/notices-changes/notice-amendment-vitamin-d.html"
  ]
}