{
  "metadata": {
    "url": "https://www.madewithnestle.ca/blog/frozen-hot-chocolate-drink-summer",
    "category": "Blog",
    "title": "Frozen Hot Chocolate: The Drink of the Summer",
    "n_tokens": 442,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-03/BOOST%20Article%20Image.png",
        "role": "secondary",
        "alt": "10 Foods that Give Energy"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/Omega3-Feb-Blog-header.jpg",
        "role": "secondary",
        "alt": "Omega3-Feb-Blog-header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-01/Nestle-Nesquik-Happy-Tummies-banner.jpg",
        "role": "secondary",
        "alt": "Nestle-Nesquik-Happy-Tummies-banner"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-11/Pay-Attention-to-Protein-at-Breakfast-header%20%281%29.jpg",
        "role": "secondary",
        "alt": "Pay-Attention-to-Protein-at-Breakfast-mainly-header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-11/5%20Elements%20of%20Eating%20for%20Energy.jpeg",
        "role": "secondary",
        "alt": "5-Elements-of-Eating-for-Energy-header"
      }
    ]
  },
  "text": [
    "Frozen Hot Chocolate: The Drink of the Summer",
    "Wednesday, May 08, 2024",
    "ShareTweetEmailPinPrint",
    "The sun-soaked days of summer are almost here, so we’re sharing a recipe that we’re sure will soon be trending everywhere! It’s perfect for cooling down during those warm afternoons. Plus it's quick, it's delicious and it's about to become your special treat for the season: Frozen Hot Chocolate!",
    "A Twist on a Classic Cozy Drink",
    "We’ve all savoured the comforting warmth of hot chocolate on chilly days, but who says it can only be enjoyed hot? We’re switching things up for a cool, creamy twist that’s perfect for summer.",
    "What You’ll Need",
    "Carnation Hot Chocolate of your choice",
    "Your choice of milk (for a creamy texture) or cold water (for a lighter version)",
    "Plenty of crushed ice",
    "Let’s Make It!",
    "The magic happens in no time and with almost no effort. Just toss all your ingredients into an electric blender, blend until smooth and voilà! You’ve got a velvety, frosty treat that looks as dreamy as it tastes.",
    "Why You’ll Love This",
    "Not only is Frozen Hot Chocolate a breeze to make, but it's also a fantastic way to delight your kids with a special treat that feels indulgent, minus any complicated steps. It’s a perfect way to spend some quality time with your little ones. Let them toss in the ingredients and hit “blend” (under your watchful eye, of course!).",
    "Endless Variations to Keep It Exciting",
    "Once you’ve mastered the basic recipe, get creative! Add a scoop of vanilla or chocolateHäagen-Dazsfor an extra rich texture, sprinkle in some cinnamon or nutmeg for a spicy twist or top it off with whipped cream and chocolate shavings for a barista-worthy drink.",
    "Perfect for Every Summer Occasion",
    "Whether it's a backyard BBQ or a family movie night, Frozen Hot Chocolate is going to be your favourite specialty drink. It’s also a fabulous addition to any birthday party menu! Imagine sipping on this chilled chocolatey delight as you watch the kids play and laugh. It’s the simple things!",
    "Share the Love",
    "When you try this recipe and your friends and family love it as much as we do, don’t forget to snap a photo and share it on social media! Tag us@worldofflavours_caso we can see your creations. Andcheck out our websitefor more summer recipes!",
    "Latest",
    "10 Foods that Give You Energy",
    "Brand",
    "Exploring Heart Health & Omega-3 Supplements Beyond Fish Oil",
    "Nutrition",
    "Nestlé Canada’s Nesquik proudly sponsors the First-Ever National Make Happy Tummies Campaign",
    "Pay Attention to Protein at Breakfast",
    "5 Elements of Eating for Energy",
    "Digestive Balance: It’s in your Nature to Thrive",
    "Kids  gummies",
    "Spotlight on the Sunshine Vitamin"
  ]
}