{
  "metadata": {
    "url": "https://www.madewithnestle.ca/blog/delight-your-loved-ones-quality-street-nankhatai-diwali",
    "category": "Blog",
    "title": "Quality Street Nankhatai for Diwali",
    "n_tokens": 519,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Delight your loved ones with Quality Street® Nankhatai for Diwali",
    "Thursday, November 02, 2023",
    "ShareTweetEmailPinPrint",
    "A Festival of Love and Lights",
    "Diwali is a vibrant and colourful celebration that’s all about light, delicious food, togetherness and exchanging heartfelt gifts. One treat that you’ve probably indulged in during Diwali is Nankhatai. This year, we’re putting a fun twist on Nankhatai cookies. We’re combining the classic Nankhatai recipe, with its buttery and melt-in-your-mouth texture, with Quality Street sweets for the best of both worlds.",
    "The Season for Giving",
    "Nankhatai is more than just a cookie, it’s a symbol of the love and warmth you share with your family and friends during Diwali. During the festive season, you’re probably used to preparing and giving delicious treats as a symbol of good wishes. This year, you can start a new tradition with the addition of Quality Street chocolates and caramels. You’ll get rave reviews from your loved ones as they savour these cookies, making your Diwali celebrations truly memorable.",
    "Blending Two Family Traditions",
    "Quality Street sweets have long been a traditional holiday treat for families around the world. That’s why we decided to combine two family traditions in one with this festive recipe. As you bake Quality Street Nankhatai cookies, your home will be filled with an irresistible aroma that captures the essence of Diwali. The burst of flavours from these iconic chocolates makes these cookies a true fusion of tradition and sweetness. Combining the traditional Nankhatai recipe and the delicious Quality Street sweets will surely create a symphony of flavours in every bite.",
    "The Personal Touch of Homemade Treats",
    "Quality Street sweets make these Nankhatai cookies one-of-a-kind, since no two will taste the same. With the wide range of flavours available in each Quality Street tin, you can make the perfect bite for anyone. If your family has a favourite chocolate or caramel, you can make custom Nankhatai cookies with certain flavours. How about a coconut Nankhatai? Or one that’s made exclusively with caramels? Orange Nankhatai cookies would be delightful too! The options are endless.",
    "Gifts Wrapped with Love",
    "There's something truly special about homemade gifts, especially when it comes to Diwali. It’s a tradition to exchange extravagantly decorated boxes of mithai during the festive season, and the limited-edition Quality Street tin is the perfect gift that can be reused after the chocolates and caramels are gone. The time and care spent baking these cookies and delivering them in a personalized tin will be a heartfelt gesture that your friends and family are sure to appreciate. And by giving Quality Street Nankhatai cookies, you're not just giving a delicious treat but also a little bit of homemade love.",
    "Diwali Celebration with A World of Flavours",
    "Quality Street Nankhataicookies aren’t the only treats we’re cooking up for Diwali and the holiday season. We’re sharing loads of simple recipes on our website that you can serve your friends and family to celebrate the beginning of the Hindu New Year. Ready to spread joy and sweetness this Diwali? Get your apron on, gather the ingredients, and bake up a delicious spread withA World Of Flavours."
  ]
}