{
  "metadata": {
    "url": "https://www.madewithnestle.ca/blog/kids-gummies",
    "category": "Blog",
    "title": "Kids gummies",
    "n_tokens": 742,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Kids  gummies",
    "Wednesday, August 28, 2024",
    "ShareTweetEmailPinPrint",
    "Vitamin Fun for Little Ones: Exploring the Benefits of Kids' Gummy Vitamins",
    "As children grow, it’s very important to receive the correct amount of vitamins and minerals for their optimal development and everyday wellbeing.",
    "Ideally children would get most of the nutrients they require from the diet. However, many kids do not always make the most nutritious food choices and up to 50% of children are fussy eaters. This can limit the intake of foods such as fruit and vegetables which are the richest sources of vitamin C.1",
    "Vitamin D, the “sunshine vitamin” is only found in the diet in small amounts and we rely on exposure to sunlight as our main source. It’s important to protect our children’s skin from the sun’s UV rays and be out of the sun during hot weather. Staying out of the sun and the use of sunscreen decrease the amount of vitamin D we produce.",
    "Bone & Muscle Health",
    "Vitamin Dis important for the growth, development and maintenance of healthy bones and teeth by helping our children’s bodies absorb the mineral calcium.2-5",
    "Immune Health",
    "A well-functioning immune system is vital for good health. As kids' immune systems develop it’s important to support it with the right nutrients",
    "It takes around 8 years for a child’s immune system to fully develop during which time they are more prone infections. Vitamin D helps support the normal function of the immune system in children.6",
    "Keeping Vitamin D Topped Up",
    "• Safe sun exposure between the hours of 11:00 and 15:00 • Consume oily fish, eggs and mushrooms enriched with vitamin D and fortified foods • Take a supplement",
    "Vitamin C",
    "Vitamin C is a water-soluble vitamin and cannot be made by the body so it is essential to obtain it daily from your diet.7",
    "Maintaining Immune Function8",
    "Vitamin C is required for the function of white blood cells involved in protecting the body against infections and foreign invaders.8,9",
    "When the immune system is under attack increased production of free radicals can damage the body’s cells.10 Vitamin C helps protect cells against oxidative stress.11",
    "Building Collagen12",
    "Collagen production is vital for growing bodies and vitamin C helps in the production of collagen which supports healthy cartilage, bones, gums and teeth.12",
    "Vitamin A",
    "• Vitamin A support healthy immune function and contributes to normal vision 13,14",
    "B Vitamins",
    "• Vitamin B6 and B12 support energy production, reduce tiredness and fatigue and support psychological and nervous system function 21,22 metabolism and helps to form red blood cells. 15,16",
    "• Vitamin B3 support energy metabolism. 15,16",
    "Supplementing with a daily multivitamin can help to ensure children have an adequate nutrient intake alongside a healthy, balanced diet. Explore Nature’s Bounty Kid Vitamin’s [insert link]",
    "References:",
    "Mascola AJ, Bryson SW, Agras WS. Picky eating during childhood: a longitudinal study to age 11 years. Eat Behav. 2010 Dec; 11(4):253-7.",
    "Vitamin D contributes to the maintenance of normal muscle function.",
    "Vitamin D is needed for normal growth and development of bone in children. EFSA-Q-2008-323.",
    "Vitamin D contributes to normal absorption/utilisation of calcium and phosphorus. EFSA Journal 2009; 7(9):1227, EFSA Journal 2011; 9(6):2203.",
    "Vitamin D contributes to the maintenance of normal bones and teeth. EFSA Journal 2009; 7(9):1227, EFSA Journal 2009; 7(9):1272",
    "Vitamin D contributes to the normal function of the immune system in children. EFSA Journal 2015; 13(5):4096",
    "Vitamin C contributes to normal immune system function. EFSA Journal 2009; 7(9):1226, EFSA Journal 2010; 8(10):1815.",
    "Carr, Anitra C, and Silvia Maggini. Vitamin C and Immune Function. Nutrients vol. 9,11 1211. 3 Nov. 2017",
    "Laher, Ismail. (2014). Systems Biology of Free Radicals and Antioxidants.",
    "Vitamin C contributes to the protection of cells from oxidative stress.",
    "Vitamin C contributes to normal collagen formation for the normal function of the skin, cartilage, bones, gums and teeth. EFSA Journal 2009; 7(9):1226.",
    "Vitamin A, C & D contributes to the normal function of the immune system. EFSA Journal 2009; 7(9):1221, EFSA Journal 2011; 9(4):2021, EFSA Journal 2009; 7(9):1226, EFSA Journal 2010; 8(10):1815, EFSA Journal 2010; 8(2):1468.",
    "Vitamin A contributes to the maintenance of normal vision. EFSA Journal 2009; 7(9):1221, EFSA Journal 2010; 8(10):1754.",
    "Vitamin B3, B6 and B12 contribute to normal energy-yielding metabolism. EFSA Journal 2009; 7(9):1224, EFSA Journal 2010; 8(10):1757,",
    "EFSA Journal 2010; 8(10):1759, EFSA Journal 2009; 7(9):1223. 7. Vitamin B3, B6 and B12 contributes to the reduction of tiredness and fatigue, EFSA Journal 2010; 8(10):1757, EFSA Journal 2010; 8(10):1759, EFSA Journal 2010; 8(10):1756."
  ]
}