{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost/boost-plus-calories-strawberry",
    "category": "Product",
    "title": "BOOST Plus Calories - Strawberry",
    "n_tokens": 486,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-03/plus-calories-straw.png",
        "role": "secondary",
        "alt": "plus calories strawberry tetra"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-03/plus-calories-straw-pack.png",
        "role": "secondary",
        "alt": "plus calories strawberry multipack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/boost-pudding-vanilla.png?itok=ka0vUG7O",
        "role": "secondary",
        "alt": "BOOST Pudding Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-strawberry-image.png?itok=Flt7C3xM",
        "role": "secondary",
        "alt": "Boost strawberry flavor"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-chocolate-image.png?itok=w-8ctZU6",
        "role": "secondary",
        "alt": "Boost 2.24 chocolate"
      }
    ]
  },
  "text": [
    "BOOST Plus Calories - Strawberry",
    "BOOST Plus Calories - ChocolateBOOST Plus Calories - VanillaBOOST Plus Calories - Strawberry",
    "BOOST Plus Calories Complete Nutrition Drink Strawberry (6 x 237 ml) is a formulated liquid diet that provides complete nutrition. With each serving containing 360 calories, 27 vitamins & minerals and 14 g of protein per 237 ml, it is designed for those looking to help maintain or gain a healthy weight. Plus, our recipe has a guaranteed great taste* you will love.",
    "For oral use. Use as directed by a healthcare professional.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "BOOST Plus Calories - StrawberryFeatures and Benefits",
    "What’s Inside Your BOOST®*:",
    "360 Calories: to help maintain or gain a healthy weight.",
    "14g Protein: to help build & maintain muscle and to help build antibodies.",
    "27 Vitamins & Minerals: essential vitamins and minerals, including calcium, to help maintain strong bones and teeth.",
    "Gluten Free",
    "*per 237ml",
    "BOOST Plus Calories - StrawberryNutrition Information",
    "Per 237 mlAmount% DVCalories360Carbohydrate45gFibre3gSugars22gEnergy1510kJFat14gCholesterol10mgMonounsaturated7gSaturated1.5gProtein14gSodium200mgAmount% DVBeta-Carotene500IUBiotin0.08mgCalcium350mgChloride273mlCholine55mgChromium0.03mgCopper0.5mgFolacin0.12mgIodide0.04mgIron4.5mgLinoleic Acid2.3gLinolenic Acid0.4gMagnesium100mgManganese0.7mgMolybdenum0.02mgNiacin5mgPantothenic Acid2.5mgPhosphorus300mgPolyunsaturated3.3gPotassium360mgRetinol500IURiboflavin0.43mgSelenium0.02mgThiamine0.38mgVitamin A1000IUVitamin B120mgVitamin B60.7mgVitamin C60mgVitamin D80IUVitamin E30IUVitamin K0.03mgZinc4.5mg**BOOST Meal Replacement provides 240 calories/237 ml",
    "BOOST Plus Calories - StrawberryIngredients",
    "Water, Corn Syrup, Sugar, Modified Milk Ingredients, Vegetable Oils (Canola, High Oleic Sunflower, Corn), Soy Protein Isolate, Acacia Gum, Oligofructose, Inulin, Salt, Vitamins (Vitamin A Palmitate, Beta-Carotene, Vitamin D3, Dl-Alpha-Tocopheryl Acetate, Vitamin K1, Ascorbic Acid, Sodium Ascorbate, Thiamine Hydrochloride, Riboflavin, Niacinamide, Calcium Pantothenate, Pyridoxine Hydrochloride, Biotin, Folic Acid, Cyanocobalamin, Choline Bitartrate), Minerals (Potassium Citrate, Potassium Hydrate, Potassium Chloride, Tricalcium Phosphate, Dimagnesium Phosphate Trihydrate, Magnesium Chloride, Ferrous Sulphate, Zinc Sulphate, Manganese Sulphate, Copper Sulphate, Potassium Iodide, Sodium Selenite, Sodium Molybdate, Chromium Trichloride), Soy Lecithin, Carrageenan, Artificial Flavour, Dimethylpolysiloxane.",
    "RECIPES",
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Cereal Clusters",
    "This easy to make recipe is an amazing afternoon treat or fun, on-the-go snack.",
    "Hidden Veggie Orange Smoothie",
    "Tired of dipping carrots in hummus? Get some carrots in by adding this amazing smoothie to your breakfast - made with carrot-orange juice, banana, yogurt and of course, BOOST.",
    "BOOST High Protein Banana Chocolate Buckwheat Pancakes",
    "Buckwheat is an ancient grain packed with, vitamins, minerals and antioxidants and fibre. When combined with chocolate and bananas this snack packs a wallop of flavour.",
    "BOOST Original Tropical Smoothie Pops",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "You might be interested in",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}