{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost/boost-kids-fruit-essentials",
    "category": "Product",
    "title": "BOOST Kids Fruit Essentials",
    "n_tokens": 653,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-05/boost-kids-straw.png",
        "role": "secondary",
        "alt": "boost kids strawberry pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/boost-pudding-vanilla.png?itok=ka0vUG7O",
        "role": "secondary",
        "alt": "BOOST Pudding Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-strawberry-image.png?itok=Flt7C3xM",
        "role": "secondary",
        "alt": "Boost strawberry flavor"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-chocolate-image.png?itok=w-8ctZU6",
        "role": "secondary",
        "alt": "Boost 2.24 chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-vanilla-image.png?itok=2w5mq0It",
        "role": "secondary",
        "alt": "Boost 2.24 vanilla flavor"
      }
    ]
  },
  "text": [
    "BOOST Kids Fruit Essentials",
    "BOOST Kids Fruit Essentials Strawberry Banana is a ready-to-drink nutritional supplement designed for kids aged 4 to 12 years. Made with real fruit, it combines strawberry, banana and apple purées for a delicious beverage your kids will love. Packed with 8g of protein and 26 essential vitamins and minerals, this drink complements your child’s diet, providing extra nutrition as a snack or a top-up after a meal. It helps build and repair tissues, supports muscle development, and contributes to strong bones and teeth with calcium and other key nutrients. BOOST Kids Fruit Essentials also promotes immune health with a powerful blend of vitamins A and C, zinc, and iron. Kosher, Gluten-free with no artificial flavours or colours, it’s thoughtfully crafted to meet your family’s dietary needs. Backed by a great taste guarantee (terms and conditions apply), BOOST Kids Fruit Essentials Strawberry Banana is a convenient and tasty treat for your child that supports their growth and development.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "BOOST Kids Fruit EssentialsFeatures and Benefits",
    "Nutritional Supplement For Kids 4 - 12 Years Old: BOOST Kids Fruit Essentials Strawberry Banana supports normal growth and development, is made with real fruit, and provides 8g protein, and 26 vitamins and minerals",
    "Extra Nutrition For Your Child: BOOST Kids Fruit Essentials are a great complement to your child's diet and a way to add extra nutrition to their day -- use as a snack or a mealtime top-up",
    "Maintains Muscles & Repairs Tissues: BOOST Kids Fruit Essentials provides 8g protein to help build and maintain muscle and help build and repair body tissues",
    "Supports Immune System, Bones & Teeth: This kids BOOST fruit-flavoured drink is a source of vitamin A, vitamin C, zinc, and iron which contribute to the normal function of the immune system, and calcium, to help maintain strong bones and teeth",
    "Free From: The ready-to-drink nutritional supplement is Kosher, gluten-free and contains no artificial flavours and no artificial colours",
    "Taste Guarantee: BOOST Fruit Essentials Strawberry Banana contains strawberry and banana purées and is guaranteed to taste great or your money back (terms and conditions apply)",
    "BOOST Kids Fruit EssentialsNutrition Information",
    "Amount% DVCarbohydrate360gFibre2gSugars10gEnergy840kjFat3gSaturates0.5gProtein8gSodium145mgAmount% DVBiotin30mcgCalcium300mgChloride260mgCholine50mgChromium9mcgCopper0.4mgFolate117DFEIodide35mcgIron3mgLinoleic Acid0.4gLinolenic Acid0.2gMagnesium75mgManganese1mgMolybdenum17mcgNiacin6.5mgPantothenate1.3mgPotassium550mgProsphore220mgRiboflavin0.4mgSelenium9mcgThiamine0.3mgVitamin A350mcgVitamin B120.22mcgVitamin B60.4mgVitamin C15mgVitamin D1.25mcgVitamin E2.5mgZinc3.1mg",
    "BOOST Kids Fruit EssentialsIngredients",
    "Water, Sugars (glucose syrup, apple purée, strawberry purée, banana purée), Milk protein, Canola oil, Soy protein isolate, Acacia gum, Salt, Vitamins (vitamin A palmitate, vitamin D3, DL-alpha-tocopheryl acetate, sodium ascorbate, ascorbic acid, thiamine hydrochloride, riboflavin, niacinamide, calcium pantothenate, pyridoxine hydrochloride, biotin, folic acid, choline bitartrate), Minerals (potassium citrate, potassium hydrate, potassium chloride, tricalcium phosphate, calcium carbonate, dimagnesium phosphate, ferric pyrophosphate, zinc sulphate, manganese sulphate, copper sulphate, potassium iodide, sodium selenite, sodium molybdate, chromium trichloride), Flavour, Cellulose gel and gum, Carotene, Carrageenan, Dimethylpolysiloxane, Citric acid.",
    "RECIPES",
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Cereal Clusters",
    "This easy to make recipe is an amazing afternoon treat or fun, on-the-go snack.",
    "Hidden Veggie Orange Smoothie",
    "Tired of dipping carrots in hummus? Get some carrots in by adding this amazing smoothie to your breakfast - made with carrot-orange juice, banana, yogurt and of course, BOOST.",
    "BOOST High Protein Banana Chocolate Buckwheat Pancakes",
    "Buckwheat is an ancient grain packed with, vitamins, minerals and antioxidants and fibre. When combined with chocolate and bananas this snack packs a wallop of flavour.",
    "BOOST Original Tropical Smoothie Pops",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "You might be interested in"
  ]
}