{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost-taste-guarantee-offer",
    "category": "Promo",
    "title": "BOOST Taste Guarantee",
    "n_tokens": 415,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "BOOST Taste Guarantee",
    "Boost® has the nutrition your body needs, and a taste you'll love. If for any reason you don't love the taste, we'll refund your purchase*. To receive a full refund of the purchase price of your Boost®, complete the following form and follow the instructions below.",
    "There are two ways to claim your refund, via email or regular mail:",
    "Via Regular Mail, please mail-in the following:Original purchase receipt dated on or after January 1, 2019Download, print and complete theRefund FormMail it to us at:",
    "Nestlé Canada Inc",
    "Consumer Services Department",
    "25 Sheppard Ave W.",
    "Toronto, ON",
    "M2N 6S6",
    "For email submissions, please email the following toconsumer.care@ca.nestle.comScan or take a photo of your original purchase receipt dated on or after January 1, 2019Download, complete and upload theRefund Form",
    "*One-time Great Taste Guarantee offer is applicable on one (1) purchase of BOOST®  products up to a maximum of $39.88, excluding sales tax. A refund cheque will be mailed to the name and address you provided on the Refund Form in the amount indicated on the sales receipt. Limit one refund per person, household or address. In addition, an individual, or individuals living at the same household or address may only exercise the Great Taste Guarantee one time.  Only original receipts will be accepted.  If multiple purchases are made on the same receipt or at different times, only one purchase will qualify. No PO boxes allowed. All purchases must be made on or after November 1, 2019 as visible on the original purchase receipt in order to qualify for a refund.  Refund requests must be postmarked no later than three (3) months after the purchase date.  Offer valid only in Canada.  To be eligible for a refund, consumer must upload the original receipt and a completed Refund Request Form.",
    "The Great Taste Guarantee cannot be honoured by retailers. The following requests will not be honoured: requests from employees, retailers, distributors, healthcare providers, resellers, groups, clubs, or organizations; duplicate, fraudulent, incomplete, or illegible requests; lost, late or undeliverable responses. Rights to the refund are not assignable or transferrable. Allow 6-10 weeks for processing. Void where prohibited, taxed, or restricted.",
    "For any questions, call at 1-800-387-4636 or email us atconsumer.care@ca.nestle.com.",
    "You may also like",
    "Five Ways to Help Beat Stress",
    "Article",
    "EXTRÄAZ Cookie Dough Dynamo Ice Cream Bars",
    "EXTRÄAZ Cookies & Cream Ice Cream Bar",
    "PARLOUR Vanilla Sandwich",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}