{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost/boost-pudding-chocolate",
    "category": "Product",
    "title": "BOOST Pudding Chocolate",
    "n_tokens": 499,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-03/boost-pudding-chocolate.png",
        "role": "secondary",
        "alt": "BOOST Pudding Chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/boost-pudding-vanilla.png?itok=ka0vUG7O",
        "role": "secondary",
        "alt": "BOOST Pudding Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-strawberry-image.png?itok=Flt7C3xM",
        "role": "secondary",
        "alt": "Boost strawberry flavor"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-chocolate-image.png?itok=w-8ctZU6",
        "role": "secondary",
        "alt": "Boost 2.24 chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-vanilla-image.png?itok=2w5mq0It",
        "role": "secondary",
        "alt": "Boost 2.24 vanilla flavor"
      }
    ]
  },
  "text": [
    "BOOST Pudding Chocolate",
    "BOOST Chocolate Pudding is a nutritionally complete oral nutrition supplement. Each 142g serving provides 230 calories and 7g of protein. Kosher and gluten-free, this ready-to-eat pudding can be consumed as a snack or as a dessert. Be sure to try BOOST Vanilla Pudding, too! BOOST Pudding can be stored, unopened, in a cool dry place. Avoid freezing or high temperatures. Once opened, cover, refrigerate, and use within 24 hours. For oral use only, as directed by a healthcare professional.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "BOOST Pudding ChocolateFeatures and Benefits",
    "Complete Nutrition: BOOST Pudding is a nutritionally complete oral nutrition supplement providing 230 calories and 7g of protein in each 142g serving",
    "Ready-to-Eat: BOOST Pudding is ready-to-eat and can be consumed as a snack or dessert",
    "Favourite Flavours: Try BOOST Pudding in both Chocolate and Vanilla",
    "Additional Information: Contains less than 0.5g lactose per 142g serving; Not for individuals with galactosemia",
    "Kosher & Gluten-free: BOOST Pudding is Kosher and gluten-free",
    "For Oral Use: Use as directed by a healthcare professional",
    "BOOST Pudding ChocolateNutrition Information",
    "BOOST Pudding VanillaPer 142 gAmount% DVCalories230Carbohydrate32gSugars14gFat8Protein7gSodium115mgAmount% DVBeta-Carotene405IU/UIBiotin0.05mgCalcium250mgChloride110mgCholine25mgChromium0.02mgCopper0.3mgFolic Acid0.08mgIodide0.02mgIron2.7mgLinoleic Acid1.7gMagnesium60mgManganese0.4mgMolybdenum0.01mgNiacin3mgPantothenic Acid1.5mgPhosphorus250mgPotassium250mgRetinol425IU/UIRiboflavin0.3mgSelenium0.01mgThiamine0.2mgVitamin A830IU/UIVitamin B120.001mgVitamin B60.4mgVitamin C36mgVitamin D80IU/UIVitamin E15IU/UIVitamin K0.02mgZinc2.7mg",
    "BOOST Pudding ChocolateIngredients",
    "BOOST Pudding VanillaWater, Corn maltodextrin, Sugar, Modified milk ingredients, Vegetable oil (canola, high oleic sunflower, corn), Modified corn starch, Salt, Vitamins (vitamin A palmitate, beta-carotene, vitamin D3, DL-alpha-tocopheryl acetate, vitamin K1, sodium ascorbate, ascorbic acid, thiamine hydrochloride, riboflavin, niacinamide, calcium pantothenate, pyridoxine hydrochloride, biotin, folic acid, cyanocobalamin, choline chloride), Minerals (sodium phosphate, potassium citrate, potassium chloride, tricalcium phosphate, dimagnesium phosphate, ferric pyrophosphate, ferrous sulphate, zinc sulphate, manganese sulphate, copper sulphate, potassium iodide, sodium selenite, sodium molybdate, chromium trichloride), Sodium stearoyl-lactate, Natural and artificial flavour, Carrageenan, Stevia extract",
    "RECIPES",
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Cereal Clusters",
    "This easy to make recipe is an amazing afternoon treat or fun, on-the-go snack.",
    "Hidden Veggie Orange Smoothie",
    "Tired of dipping carrots in hummus? Get some carrots in by adding this amazing smoothie to your breakfast - made with carrot-orange juice, banana, yogurt and of course, BOOST.",
    "BOOST High Protein Banana Chocolate Buckwheat Pancakes",
    "Buckwheat is an ancient grain packed with, vitamins, minerals and antioxidants and fibre. When combined with chocolate and bananas this snack packs a wallop of flavour.",
    "BOOST Original Tropical Smoothie Pops",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "You might be interested in",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}