{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost/boost-kids-essentials-vanilla",
    "category": "Product",
    "title": "BOOST Kids Essentials Vanilla",
    "n_tokens": 614,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-05/boost-kids-van.png",
        "role": "secondary",
        "alt": "boost kids vanilla pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/boost-pudding-vanilla.png?itok=ka0vUG7O",
        "role": "secondary",
        "alt": "BOOST Pudding Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-strawberry-image.png?itok=Flt7C3xM",
        "role": "secondary",
        "alt": "Boost strawberry flavor"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-chocolate-image.png?itok=w-8ctZU6",
        "role": "secondary",
        "alt": "Boost 2.24 chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-vanilla-image.png?itok=2w5mq0It",
        "role": "secondary",
        "alt": "Boost 2.24 vanilla flavor"
      }
    ]
  },
  "text": [
    "BOOST Kids Essentials Vanilla",
    "BOOST Kids Essentials Vanilla is a ready-to-drink nutritional supplement specially designed to meet the needs of children aged 4 to 12 years. Packed with 8g protein, 26 essential vitamins and minerals, and 2g fibre, BOOST Kids Essentials is an excellent way to complement your child's diet. Whether enjoyed as a snack or a top-up at mealtime, this drink offers extra nutrition to help fuel your child’s day. Packed with benefits, BOOST Kids Essentials provides protein to help build and maintain muscle and help build and repair body tissues. It supports the immune system with a powerful combination of vitamins A & C, zinc, and iron. Plus, with calcium and other vital nutrients, it helps maintain strong bones and teeth. Kosher and gluten-free, it contains no artificial flavours or colours. Plus, it comes with a great taste guarantee – your kids will love it, or your money back (terms and conditions apply). Give your child the nutrients they need with BOOST Kids Essentials Vanilla.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "BOOST Kids Essentials VanillaFeatures and Benefits",
    "Nutritional Supplement For Kids 4-12 Years Old: BOOST Kids Essentials Vanilla supports normal growth and development, provides 8g protein, 26 vitamins and minerals, and 2g fibre",
    "Extra Nutrition For Your Child: BOOST Kids Essentials are a great complement to your child's diet and a way to add extra nutrition to their day -- use as a snack or a mealtime top-up",
    "Maintains Muscles & Repairs Tissues: BOOST Kids Essentials provides 8g protein to help build and maintain muscle and help build and repair body tissues",
    "Supports Immune System: This kids BOOST vanilla drink is a source of vitamin A, vitamin C, zinc, and iron which contribute to the normal function of the immune system",
    "Free From: The ready-to-drink nutritional supplement is Kosher, gluten-free and contains no artificial flavours and no artificial colours",
    "Great Taste Guarantee: Guaranteed great taste or your money back (terms and conditions apply)",
    "BOOST Kids Essentials VanillaNutrition Information",
    "Amount% DVCarbohydrate34gFibre2gSugars9gEnergy870kJFat5gSaturates1gProtein8gSodium150mgAmount% DVBiotin30mcgCalcium325mgChloride210mgCholine80mgChromium9mcgCopper0.33mcgFolate108mcgIodide33mcgIron2.3mgMagnesium45mgMolybdenum17mcgNiacin6.5mgLinoleic Acid0.34gPantothenate1.3mgPhosphorus250mgPotassium400mgRiboflavin0.4mgSelenium9mcgThiamine0.35mgVitamin A300mcgVitamin B120.25mcgVitamin B60.4mgVitamin C40mgVitamin D1mcgVitamin E3mgZinc3mg",
    "BOOST Kids Essentials VanillaIngredients",
    "Water, Sugars (brown rice syrup, sugar), Milk protein, Canola oil, Pea fibre, Acacia gum, Salt, Vitamins (vitamin A palmitate, vitamin D3, DL-alpha-tocopheryl acetate, sodium ascorbate, ascorbic acid, thiamine hydrochloride, riboflavin, niacinamide, calcium pantothenate, pyridoxine hydrochloride, biotin, folic acid, choline bitartrate), Minerals (dipotassium phosphate, potassium citrate, potassium hydrate, potassium chloride, tricalcium phosphate, dimagnesium phosphate, ferric pyrophosphate, zinc sulphate, manganese sulphate, copper sulphate, potassium iodide, sodium selenite, sodium molybdate, chromium trichloride), Flavour, Citric acid, Carrageenan, Dimethylpolysiloxane.",
    "RECIPES",
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Cereal Clusters",
    "This easy to make recipe is an amazing afternoon treat or fun, on-the-go snack.",
    "Hidden Veggie Orange Smoothie",
    "Tired of dipping carrots in hummus? Get some carrots in by adding this amazing smoothie to your breakfast - made with carrot-orange juice, banana, yogurt and of course, BOOST.",
    "BOOST High Protein Banana Chocolate Buckwheat Pancakes",
    "Buckwheat is an ancient grain packed with, vitamins, minerals and antioxidants and fibre. When combined with chocolate and bananas this snack packs a wallop of flavour.",
    "BOOST Original Tropical Smoothie Pops",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "You might be interested in"
  ]
}