{
  "metadata": {
    "url": "https://www.madewithnestle.ca/boost/boost-original-vanilla",
    "category": "Product",
    "title": "BOOST Original - Vanilla",
    "n_tokens": 481,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-03/original-van.png",
        "role": "secondary",
        "alt": "Original vanilla tetra"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-03/original-van-pack.png",
        "role": "secondary",
        "alt": "Original vanilla multipack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/boost-pudding-vanilla.png?itok=ka0vUG7O",
        "role": "secondary",
        "alt": "BOOST Pudding Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-strawberry-image.png?itok=Flt7C3xM",
        "role": "secondary",
        "alt": "Boost strawberry flavor"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-02/boost-2.24-chocolate-image.png?itok=w-8ctZU6",
        "role": "secondary",
        "alt": "Boost 2.24 chocolate"
      }
    ]
  },
  "text": [
    "BOOST Original - Vanilla",
    "BOOST Original - ChocolateBOOST Original - VanillaBOOST Original - StrawberryBOOST Original - Chocolate LatteBOOST Original - Variety (Chocolate, Strawberry, Chocolate Latte, Vanilla)",
    "BOOST® Original Vanilla Meal Replacement Drink (6 x 237 ml) is a convenient and delicious way to help you get your nutrition when you’re on-the-go, or not getting enough in your daily diet. It offers complete balanced nutrition that fits perfectly with your active lifestyle. Plus, our recipe has no artificial flavour and colour with a guaranteed great taste* you will love.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "BOOST Original - VanillaFeatures and Benefits",
    "What’s Inside Your BOOST®*:",
    "10g Protein: to help build and maintain muscles and help build and repair body tissues.",
    "230 Calories: source of energy.",
    "26 Vitamins & Minerals: essential vitamins and minerals, including calcium, to help maintain strong bones and teeth.",
    "Gluten Free",
    "*per 237ml",
    "BOOST Original - VanillaNutrition Information",
    "Per 237 mlAmount% DVCalories230Carbohydrate34gSugars14gFat6gCholesterol6.8mgMonounsaturates3.3gSaturates0.7gProtein10gSodium265mgAmount% DVBiotin30μgCalcium24%Chloride320mgCholine55mgChromium11μgCopper0.6mgFolacin26%Iodide27%Iron19%Linoleic Acid1.2gLinolenic Acid0.24gMagnesium21%Manganese1.1mgMolybdenum22μgNiacin43%Pantothenate28%Phosphorus21%Polyunsaturates1.6gPotassium410mgRiboflavin33%Selenium11μgThiamine27%Vitamin A33%Vitamin B1211%Vitamin B624%Vitamin C17%Vitamin D8%Vitamin E17%Zinc37%",
    "BOOST Original - VanillaIngredients",
    "Water, Sugars (Corn Syrup, Sugar), Milk Protein, Vegetable Oils (Canola, High Oleic Sunflower and Corn), Soy Protein, Salt, Vitamins (Vitamin A Palmitate, Vitamin D3, DL-Alpha-Tocopheryl Acetate, Sodium Ascorbate, Ascorbic Acid, Thiamine Hydrochloride, Riboflavin, Niacinamide, Calcium Pantothenate, Pyridoxine Hydrochloride, Biotin, Folic Acid, Choline Bitartrate), Minerals (Sodium Citrate, Potassium Citrate, Potassium Hydrate, Potassium Chloride, Calcium Carbonate, Tricalcium Phosphate, Magnesium Phosphate, Ferrous Sulphate, Zinc Sulphate, Manganese Sulphate, Copper Sulphate, Potassium Iodide, Sodium Selenite, Sodium Molybdate, Chromium Trichloride), Cellulose Gel and Gum, Soy Lecithin, Flavour, Carrageenan, Stevia Extract, Dimethylpolysiloxane.Contains milk and soy.",
    "RECIPES",
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Cereal Clusters",
    "This easy to make recipe is an amazing afternoon treat or fun, on-the-go snack.",
    "Hidden Veggie Orange Smoothie",
    "Tired of dipping carrots in hummus? Get some carrots in by adding this amazing smoothie to your breakfast - made with carrot-orange juice, banana, yogurt and of course, BOOST.",
    "BOOST High Protein Banana Chocolate Buckwheat Pancakes",
    "Buckwheat is an ancient grain packed with, vitamins, minerals and antioxidants and fibre. When combined with chocolate and bananas this snack packs a wallop of flavour.",
    "BOOST Original Tropical Smoothie Pops",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "You might be interested in",
    "You may also like",
    "Nutrition Strategies for Active Older Canadians",
    "Article",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}