{
  "metadata": {
    "url": "https://www.madewithnestle.ca/carnation-hot-chocolate/carnation-rich-and-creamy-hot-chocolate",
    "category": "Sustainability",
    "title": "CARNATION Rich and Creamy Hot Chocolate Mix",
    "n_tokens": 562,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/carnation-aero-smores-hot-chocolate-carton.png?itok=xPl5Lwrm",
        "role": "package",
        "alt": " CARNATION AERO S'Mores Hot Chocolate Carton"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-10/6404727_Carnation_00065000133547_A1C1__.png",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 10-Pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374650_Carnation_00065000134124_A1C1__.png?itok=exojXNpl",
        "role": "secondary",
        "alt": " CARNATION Rich & Creamy Hot Chocolate Canister 1.7 kg"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374665_Carnation_00065000116052_A1C1__.png?itok=EF3IyHQk",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 450 g Canister "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6404729_Carnation_00065000368529_A1C1__.png?itok=6cY4HCRy",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Light Hot Chocolate, 10-Pack"
      }
    ]
  },
  "text": [
    "CARNATION Rich and Creamy Hot Chocolate",
    "Sip some good with CARNATION Rich & Creamy Hot Chocolate (10 x 25 g); NEW recipe & look; with the same great taste! Made with real and 100% sustainably sourced cocoa*, with no artificial flavours. CARNATION is committed to sustainable cocoa farming practices and helping farmers build a sustainable future for their communities. Proudly prepared in Canada, each carton contains 10 individual envelopes that mixes up a rich and creamy cup of hot chocolate you know and love. Perfect for sharing on a cold day, at the cottage, around a campfire, or taking a moment by yourself at home.*Rainforest Alliance Certified, as part of the NESTLÉ COCOA PLAN",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Instructions",
    "CARNATION Rich and Creamy Hot ChocolateFeatures and Benefits",
    "10 Envelopes of delicious Rich & Creamy hot chocolate",
    "Made with Real Cocoa & No Artificial Flavours",
    "We purchase 100% Sustainably Sourced Cocoa certified by Rainforest Alliance, as part of the NESTLÉ COCOA PLAN",
    "Pre-dosed, easy-to-mix packets",
    "Perfect to mix with hot water or steaming hot milk for an extra creamy cup",
    "CARNATION Rich and Creamy Hot ChocolateNutrition Information",
    "Per 1 sachet (25 g)Amount% DVCalories90Carbohydrate21gFibre1g4%Sugars17g17%Fat2g3%Cholesterol0mgSaturated Fat2g10%Trans Fat0gProtein1gSodium100mg4%Amount% DVCalcium40mg3%Iron1mg6%Potassium300mg6%*5% or less is a little, 15% or more is a lot",
    "CARNATION Rich and Creamy Hot ChocolateIngredients",
    "Sugar (sugar, glucose solids, lactose), Modified milk ingredients, Cocoa*, Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Carrageenan, Salt, Potassium chloride, Dipotassium phosphate, Mono- and diglycerides, Silicon dioxide, DATEM, Natural flavour.*Rainforest Alliance Certified",
    "Remember, small kids have small tummies, so serve a smaller portion.",
    "Add ¾ cup (175 ml) hot water to mix. For extra rich, creamy goodness, replace water with steaming hot milk. Stir & enjoy!",
    "RECIPES",
    "Mexican Hot Chocolate",
    "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "Iced Kit Kat Whipped Hot Chocolate",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "Decorated Carnation Hot Chocolate Mocha",
    "Carnation Frozen Hot Chocolate",
    "Create the perfect summer indulgent treat, frozen hot chocolate. Simply blend with ice and milk, then enjoy!",
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "You might be interested in"
  ]
}