{
  "metadata": {
    "url": "https://www.madewithnestle.ca/carnation-hot-chocolate/carnation-variety-pack-hot-chocolate-carton",
    "category": "Product",
    "title": "CARNATION Variety Pack Hot Chocolate Carton",
    "n_tokens": 712,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/carnation-aero-smores-hot-chocolate-carton.png?itok=xPl5Lwrm",
        "role": "package",
        "alt": " CARNATION AERO S'Mores Hot Chocolate Carton"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-10/6404730_Carnation_00065000116113_A1C1__.png",
        "role": "secondary",
        "alt": "CARNATION Variety Pack Hot Chocolate Carton 7 x 25 g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374650_Carnation_00065000134124_A1C1__.png?itok=exojXNpl",
        "role": "secondary",
        "alt": " CARNATION Rich & Creamy Hot Chocolate Canister 1.7 kg"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374665_Carnation_00065000116052_A1C1__.png?itok=EF3IyHQk",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 450 g Canister "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6404727_Carnation_00065000133547_A1C1__.png?itok=aHJXcu-Z",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 10-Pack"
      }
    ]
  },
  "text": [
    "CARNATION Variety Pack Hot Chocolate Carton",
    "Can’t decide on a hot chocolate flavour? How about all of them! NESTLÉ CARNATION Variety Pack Hot Chocolate (7 x 25 g) - NEW Look with the same great taste; stirs up sweet and delicious hot chocolates flavoured with your favourite NESTLÉ chocolate bars. The savoury caramel of TURTLES, a mint-chocolate delight of AFTER EIGHT, or delicious graham cracker flavours and marshmallows of AERO S’mores – so many options, and each so delicious! CARNATION is made with real & 100% sustainably sourced cocoa*. Proudly prepared in Canada, each carton contains 7 envelopes that mixes up a creamy cup of hot chocolate you know and love. Perfect for sharing on a cold day, at the cottage, around a campfire, or when taking a moment by yourself at home. Savour the irresistible combination of creamy CARNATION hot chocolate with your favourite chocolate bar flavours- a delicious little indulgence in your day!",
    "*Rainforest Alliance Certified, as part of the NESTLÉ COCOA PLAN",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "CARNATION Variety Pack Hot Chocolate CartonFeatures and Benefits",
    "7 Envelopes with a variety of Nestle Chocolate Bar flavoured hot chocolates",
    "2 envelopes of AERO S’mores, 3 envelopes of TURTLES, and 2 envelopes of AFTER EIGHT hot chocolate",
    "Made with Real Cocoa",
    "We purchase 100% Sustainably Sourced Cocoa certified by Rainforest Alliance, as part of the NESTLÉ COCOA PLAN",
    "Perfect to mix with hot water or steaming hot milk for an extra creamy cup",
    "CARNATION Variety Pack Hot Chocolate CartonNutrition Information",
    "AERO S'moresPer 1 sachet (25 g)Amount% DVCalories90Carbohydrate21gFibre1g4%Sugars16g16%Fat2g3%Cholesterol0mgSaturated1.5g8%Trans0gProtein1gSodium110mg5%Amount% DVCalcium30mg2%Iron1mg6%Potassium20mg4%*5% or less is a little, 15% or more is a lotAfter EightPer 1 sachet (25 g)Amount% DVCalories90Carbohydrate21gFibre1g4%Sugars17g17%Fat2g3%Cholesterol0mgSaturated2g10%Trans0gProtein1gSodium150mg7%Amount% DVCalcium30mg2%Iron1.25mg7%Potassium225mg5%*5% or less is a little, 15% or more is a lotTutrlesPer 1 sachet (25 g)Amount% DVCalories90Carbohydrate21gFibre1g4%Sugars17g17%Fat2g3%Cholesterol0mgSaturated2g10%Trans0gProtein1gSodium150g7%Amount% DVCalcium30mg2%Iron1mg6%Potassium200mg4%*5% or less is a little, 15% or more is a lot",
    "CARNATION Variety Pack Hot Chocolate CartonIngredients",
    "AERO S'moresSugars (sugar, glucose solids, lactose), Modified milk ingredients, Cocoa*, Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Dehydrated marshmallows [sugars (sugar, corn syrup), modified corn starch, gelatin, flavour and artificial flavour] Cellulose gum, Salt, Dipotassium phosphate, Mono- and diglycerides, Silicon dioxide, DATEM, Guar gum, Flavour and artificial flavour.After EightSugars (sugar, glucose solids, lactose), Modified milk ingredients, Cocoa*, Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Cellulose gum, Salt, Silicon dioxide, Dipotassium phosphate, Mono- and diglycerides, Flavour and artificial flavour, DATEM, Guar gum.TutrlesSugars (sugar, glucose solids, lactose), Modified milk ingredients, Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Cocoa*, Cellulose gum, Salt, Flavour and artificial flavour, Silicon dioxide, Dipotassium phosphate, Mono- and diglycerides, DATEM, Guar gum.*Rainforest Alliance Certified",
    "RECIPES",
    "Mexican Hot Chocolate",
    "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "Iced Kit Kat Whipped Hot Chocolate",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "Decorated Carnation Hot Chocolate Mocha",
    "Carnation Frozen Hot Chocolate",
    "Create the perfect summer indulgent treat, frozen hot chocolate. Simply blend with ice and milk, then enjoy!",
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "You might be interested in"
  ]
}