{
  "metadata": {
    "url": "https://www.madewithnestle.ca/carnation-hot-chocolate/turtles",
    "category": "Product",
    "title": "​ Nestlé CARNATION Turtles Hot Chocolate",
    "n_tokens": 574,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/carnation-aero-smores-hot-chocolate-carton.png?itok=xPl5Lwrm",
        "role": "package",
        "alt": " CARNATION AERO S'Mores Hot Chocolate Carton"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2023-07/IMAGE-removebg.png",
        "role": "secondary",
        "alt": "Nestlé Carnation Turtles Hot Chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374650_Carnation_00065000134124_A1C1__.png?itok=exojXNpl",
        "role": "secondary",
        "alt": " CARNATION Rich & Creamy Hot Chocolate Canister 1.7 kg"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374665_Carnation_00065000116052_A1C1__.png?itok=EF3IyHQk",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 450 g Canister "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6404727_Carnation_00065000133547_A1C1__.png?itok=aHJXcu-Z",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 10-Pack"
      }
    ]
  },
  "text": [
    "​  Nestlé CARNATION Turtles Hot Chocolate",
    "CARNATION TURTLES hot chocolate mix will put a smile on your face, even on the chilliest days. A yummy blend of CARNATION hot chocolate with pecan and caramel notes, it's easy to prepare. Just add 3 tablespoons hot chocolate powder to 250mL hot water or warm milk for a creamy-tasting, indulgent cup of hot chocolate perfect for sharing on a cold day at the cottage, around a campfire, or when taking a moment by yourself at home. Proudly prepared in Canada using 100% Rainforest Alliance certified sustainably sourced cocoa, CARNATION TURTLES hot chocolate mix comes in a convenient 400g canister that makes it easy to scoop, reseal and store. Make your hot chocolate extra special by dipping a caramel syrup-coated mug rim in shaved chocolate pieces, top with whipped cream, and finish with Mini Turtles Milk Chocolate candy. Enjoy CARNATION TURTLES hot chocolate from Canada's #1 hot chocolate brand today!​",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "​  Nestlé CARNATION Turtles Hot ChocolateFeatures and Benefits",
    "Presented on behalf of Canada’s Best Selling Hot Chocolate, CARNATION",
    "Made with Real Cocoa & No Artificial Flavours",
    "We purchase 100% Sustainably Sourced Cocoa certified by Rainforest Alliance, as a part of the NESTLÉ COCOA PLAN",
    "Make it Special: 1) Dip caramel syrup coated mug rim in shaved chocolate pieces 2) Top with whipped cream 3) Finish with a delicious Mini TURTLES(R) Milk Chocolate",
    "​  Nestlé CARNATION Turtles Hot ChocolateNutrition Information",
    "Per 3 tsp (36 g)Amount% DVCalories130Carbohydrate30gDietary Fiber1g4%Dietary FibreSugars24g24%CarbohydrateEnergyFat3g4%CholesterolMonounsatratedMonounsaturatedMonounsaturatesSaturated2.5g13%Saturated FatSaturatesTrans FatProtein1gSodium220mg10%Amount% DVCalcium50mg4%Iron1.25mg7%Potassium300mg6%",
    "​  Nestlé CARNATION Turtles Hot ChocolateIngredients",
    "Sugars (sugar, glucose solids, lactose), Modified milk ingredients, Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Cocoa*, Salt, Dipotassium phosphate, Mono- and diglycerides, Silicon dioxide, DATEM, Guar gum, Flavour and artificial flavour. *Rainforest Alliance Certified",
    "RECIPES",
    "Mexican Hot Chocolate",
    "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "Iced Kit Kat Whipped Hot Chocolate",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "Decorated Carnation Hot Chocolate Mocha",
    "Carnation Frozen Hot Chocolate",
    "Create the perfect summer indulgent treat, frozen hot chocolate. Simply blend with ice and milk, then enjoy!",
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "You might be interested in"
  ]
}