{
  "metadata": {
    "url": "https://www.madewithnestle.ca/carnation-hot-chocolate/carnation-aero-smores-hot-chocolate-carton",
    "category": "Product",
    "title": "CARNATION AERO S'Mores Hot Chocolate Carton",
    "n_tokens": 561,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2023-12/carnation-aero-smores-hot-chocolate-carton.png",
        "role": "package",
        "alt": " CARNATION AERO S'Mores Hot Chocolate Carton"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374650_Carnation_00065000134124_A1C1__.png?itok=exojXNpl",
        "role": "secondary",
        "alt": " CARNATION Rich & Creamy Hot Chocolate Canister 1.7 kg"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6374665_Carnation_00065000116052_A1C1__.png?itok=EF3IyHQk",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 450 g Canister "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6404727_Carnation_00065000133547_A1C1__.png?itok=aHJXcu-Z",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Rich and Creamy Hot Chocolate, 10-Pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-10/6404729_Carnation_00065000368529_A1C1__.png?itok=6cY4HCRy",
        "role": "secondary",
        "alt": "NESTLÉ CARNATION Light Hot Chocolate, 10-Pack"
      }
    ]
  },
  "text": [
    "CARNATION AERO S'Mores Hot Chocolate Carton",
    "Three amazing flavours come together: the irresistible, melt-in-your mouth bubbles of AERO, the marshmallow and graham cracker of S’mores, and the creaminess of hot chocolate. CARNATION AERO S’mores Hot Chocolate (7 x 25 g) is a delicious hot chocolate flavour experience that’ll delight everyone in the family. Proudly prepared in Canada and made with real & 100% sustainably sourced cocoa. Each carton contains 7 envelopes that mixes up a creamy cup of hot chocolate; perfect for sharing on a cold day, at the cottage, around a campfire, or taking a moment by yourself at home. Savour the irresistible combination of creamy CARNATION hot chocolate and bubbly AERO S’mores for a delectable take on the campfire classic- a delicious little indulgence in your day!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "CARNATION AERO S'Mores Hot Chocolate CartonFeatures and Benefits",
    "7 Envelopes that make rich and creamy hot chocolate with the delicious flavour of AERO S’mores",
    "Made with Real Cocoa",
    "We purchase 100% Sustainably Sourced Cocoa certified by Rainforest Alliance, as part of the NESTLÉ COCOA PLAN",
    "Pre-dosed, easy-to-mix packets",
    "Perfect to mix with hot water or steaming hot milk for an extra creamy cup",
    "CARNATION AERO S'Mores Hot Chocolate CartonNutrition Information",
    "Per sachet (25 g)Amount% DVCalories90Carbohydrate21gFibre1g4%Sugars16g16%Fat2g3%Cholesterol0mgSaturated1.5g8%Trans0gProtein1gSodium110mg5%Amount% DVCalcium30mg2%Iron1mg6%Potassium200mg4%*5% or less is a little, 15% or more is a lot",
    "CARNATION AERO S'Mores Hot Chocolate CartonIngredients",
    "Sugars (sugar, glucose solids, lactose), Modified milk ingredients, Cocoa* , Hydrogenated vegetable oil (coconut and/or palm kernel and/or soybean), Dehydrated marshmallows [sugars (sugar, corn syrup), modified corn starch, gelatin, flavour and artificial flavour], Cellulose gum, Salt, Dipotassium phosphate, Mono- and diglycerides, Silicon dioxide, DAT EM, Guar gum, Flavour and artificial flavour.*Rainforest Alliance Certified",
    "RECIPES",
    "Mexican Hot Chocolate",
    "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "Iced Kit Kat Whipped Hot Chocolate",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "Decorated Carnation Hot Chocolate Mocha",
    "Carnation Frozen Hot Chocolate",
    "Create the perfect summer indulgent treat, frozen hot chocolate. Simply blend with ice and milk, then enjoy!",
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "You might be interested in"
  ]
}