{
  "metadata": {
    "url": "https://www.madewithnestle.ca/coffee-mate/coffee-mate-limited-edition-kitkat",
    "category": "Product",
    "title": "COFFEE MATE Limited Edition KIT KAT",
    "n_tokens": 342,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/COFFEE-MATE-LT-DED-header.png",
        "role": "secondary",
        "alt": "COFFEE-MATE-LT-DED-header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/PIC_English-image.png",
        "role": "secondary",
        "alt": "PIC_English-image"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-10/00055000981347_A1C1%20%281%29%20%281%29.png?itok=KRzJ0sm5",
        "role": "secondary",
        "alt": "COFFEE-MATE Double Double-mate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/French_vanilla_946ml_0.png?itok=aj40_JT8",
        "role": "secondary",
        "alt": "COFFEE MATE Zero Sugar French Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/Coffee_mate_Hazelnut_946ml.png?itok=0twoJVrb",
        "role": "secondary",
        "alt": "COFFEE MATE Hazelnut"
      }
    ]
  },
  "text": [
    "COFFEE MATE Limited Edition KIT KAT",
    "Take your coffee to the next level with COFFEE MATE Limited Edition KITKAT Liquid Coffee Enhancer. Unlike regular coffee creamers, COFFEE MATE KITKAT delivers the taste of KITKAT's chocolate and wafer in a rich blend of real cocoa and baked wafer flavour. Proudly prepared in Canada, this delicious coffee companion has only 30 calories per 1 tbsp serving. Plus, it's lactose-free and cholesterol-free, making it a treat that can be enjoyed every day. Try COFFEE MATE Limited Edition KITKAT in both hot and cold beverages. Find it in the dairy aisle of your favourite grocery store. Whether you're savouring a quiet moment alone, taking a coffee break at work, or sharing a pot of coffee with friends, take your coffee to the next level with rich and creamy COFFEE MATE KITKAT Liquid Coffee Enhancer!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Recyclability",
    "COFFEE MATE Limited Edition KIT KATFeatures and Benefits",
    "Limited Edition: Get your Coffee Liquid Coffee Enhancer before it's gone!",
    "An Everyday Indulgence: Lactose-free, cholesterol-free, and just 35 calories per serving, you can enjoy this coffee enhancer every day",
    "Easy To Enjoy: Simply shake, pour into your coffee (hot or cold), stir well, and adjust to taste; Can also be used to mix up your own dirty cola",
    "Try Other Flavours: Explore COFFEE MATE classic, specialty, and other limited edition flavours",
    "Multiple Servings: The 828mL bottle means you can enjoy many servings of this limited edition treat",
    "COFFEE MATE Limited Edition KIT KATNutrition Information",
    "Per 1 tbsp (15 ml)Amount% DVCalories30Carbohydrate5gDietary Fiber0g0%Sugars5g5%Fat1g1%Cholesterol0mgMonounsatrated1gSaturated0.2g1%Trans Fat0g0%Protein0.1gSodium10mg1%Amount% DVCalcium0mg0%Iron0mg1%Omega-30gOmega-60.1gPolyunsaturated0.1gPotassium30mg1%",
    "COFFEE MATE Limited Edition KIT KATIngredients",
    "Water, Sugar, High oleic soy oil, Modified milk ingredients, Cocoa, Dipotassium phosphate, Mono- and diglycerides, Cellulose gel, DATEM, Salt, Cellulose gum, Carrageenan, Natural and artificial flavour.",
    "In 2023, we changed our Coffee mate Liquid shrink sleeves so that the label no longer needs to be removed and discarded prior to recycling; now the entire bottle, sleeve and cap are recyclable together and can be put into the blue box",
    "You might be interested in"
  ]
}