{
  "metadata": {
    "url": "https://www.madewithnestle.ca/confectionery-frozen-desserts/coffee-crisp-bars-frozen-dessert",
    "category": "Product",
    "title": "Coffee Crisp Bars, Frozen Dessert",
    "n_tokens": 292,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-03/Coffee-crisp-double-crunch-ice-bars_0.png",
        "role": "secondary",
        "alt": "Coffee crisp double crunch ice bars pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kitkat%20gold.jpg?itok=89Th56Ek",
        "role": "secondary",
        "alt": "KITKAT Gold Single Frozen Dessert Bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/00055000212328_A1N1_44387900_23.10.2024_0.png?itok=cZUp0Lnm",
        "role": "secondary",
        "alt": "KITKAT Gold Frozen Dessert Bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-05/rolo-cones-frozen-dessert.png?itok=UriRpv9N",
        "role": "secondary",
        "alt": " Rolo Cones, Frozen Dessert"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/kitkat-minis-frozen-bars.png?itok=LNNdJha9",
        "role": "secondary",
        "alt": "KitKat minis frozen bars"
      }
    ]
  },
  "text": [
    "Coffee Crisp Bars, Frozen Dessert",
    "Calling all COFFEE CRISP fans! Canadian favourite COFFEE CRISP has been transformed into an irresistible frozen treat. Creamy and sweet coffee-flavoured frozen dessert in a milk chocolatey shell with crushed wafer pieces come together for the ultimate blend of coffee, chocolate, and crispy wafer flavours in COFFEE CRISP frozen dessert bars. These yummy treats are individually wrapped so you can easily enjoy them alone or share with family and friends. One of Canada's signature treats, COFFEE CRISP frozen dessert bars are proudly crafted in Canada with Canadian dairy and no artificial colours. Keep frozen.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Coffee Crisp Bars, Frozen DessertFeatures and Benefits",
    "Calling All COFFEE CRISP Fans: Everything you love about COFFEE CRISP in a frozen dessert bar",
    "Indulgent: Coffee frozen dessert in a milk chocolatey shell with crushed wafer pieces",
    "For Coffee & Chocolate Lovers: COFFEE CRISP frozen dessert bars are the ultimate blend of coffee, chocolate, and crispy wafer flavours",
    "Individually Wrapped: Perfect for enjoying alone or sharing with friends and family",
    "No Artificial Colours: This delicious frozen treat is made with no artificial colours",
    "Crafted In Canada: COFFEE CRISP frozen dessert bars are crafted in Canada with dairy from Canadian cows",
    "Coffee Crisp Bars, Frozen DessertNutrition Information",
    "Per 1 bar (80 ml)Amount% DVCalories190Carbohydrate20gDietary Fibre1g4%Sugars15g15%Fat11g15%Cholesterol5mgSaturated8g41%Trans Fat0.1Protein2gSodium50mg2%Amount% DVCalcium50mg4%Iron0.75mg4%Potassium125mg4%",
    "Coffee Crisp Bars, Frozen DessertIngredients",
    "Frozen dessert: Modified milk ingredients, Sugars (sugar, glucose), Milk ingredients, Coconut oil, Instant coffee, Mono- and diglycerides, Propylene glycol monostearate, Cellulose gum, Carob bean gum, Carrageenan, Caramel colour, Natural and artificial flavour (contains celery). Coating: Coconut oil, Palm oil, Sugar, Wafer pieces (wheat flour, sugar, soybean oil, salt, soy lecithin), Cocoa, Modified milk ingredients, Unsweetened chocolate, Soy lecithin, Natural flavour.",
    "You might be interested in"
  ]
}