{
  "metadata": {
    "url": "https://www.madewithnestle.ca/del-monte/del-monte-raspberries-and-chocolate-gelato",
    "category": "Product",
    "title": "DEL MONTE Raspberries and Chocolate Gelato",
    "n_tokens": 309,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-04/del-monte-rasb-choc-tub.png",
        "role": "secondary",
        "alt": "Del Monte Rasberry anad chocolate"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/del-monte-straw-lemon-tub.png?itok=7ppb50j4",
        "role": "secondary",
        "alt": "Del Monte strawberry and lemon tub"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/del-monte-mango-tub.png?itok=nTNrq6K2",
        "role": "secondary",
        "alt": "Del Monte tropical mango tub"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/delmonte_mango.png?itok=vCXhyazS",
        "role": "secondary",
        "alt": "Alt text placeholder"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/delmonte_berry_peach.png?itok=kZOONcJh",
        "role": "secondary",
        "alt": "Alt text placeholder"
      }
    ]
  },
  "text": [
    "DEL MONTE Raspberries and Chocolate Gelato",
    "Enjoy the real fruit flavour of DEL MONTE Real Raspberries & Chocolate Gelato. This delicious frozen dessert is elevated refreshment for the entire family. Made with real raspberries, DEL MONTE Real Raspberries & Chocolate Gelato lets you satisfy your fruit and chocolate cravings all year round. Cool and refreshing, it's packed with the goodness of real fruit. Our convenient 946mL tubs make it easy to share the fruity and indulgent combination of raspberries and chocolate with your friends and family. Proudly crafted in Ontario, Canada, it has no artificial flavours or colours. The classic combination of raspberries and chocolate makes DEL MONTE Real Raspberries & Chocolate Gelato the perfect treat for hot summer days. Try DEL MONTE Real Raspberries & Chocolate Gelato today for an irresistible treat in every delicious spoonful!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "DEL MONTE Raspberries and Chocolate GelatoFeatures and Benefits",
    "Made With Real Fruit: DEL MONTE Real Raspberries & Chocolate Gelato frozen dessert is made with real raspberries",
    "Elevated Refreshment: This real fruit gelato lets you satisfy your fruit and chocolate cravings year round",
    "The Goodness Of Real Fruit: Made with no artificial colours or flavours",
    "Indulgent: DEL MONTE Real Raspberries & Chocolate Gelato is bursting with the delicious combination of real raspberries and delicious chocolatey goodness",
    "Shareable: In convenient 946mL tubs that make it easy to share",
    "Made in Canada: Proudly made in London, Ontario",
    "DEL MONTE Raspberries and Chocolate GelatoNutrition Information",
    "Per 3/4 cup (188 ml)Amount% DVCalories170Carbohydrate36gDietary Fibre1g4%Sugars24g24%Fat3g4%Cholesterol20mgSaturated2.5g13%Trans Fat0gProtein1gSodium50mg2%Amount% DVCalcium30mg2%Iron0.5mg3%Potassium150mg4%",
    "DEL MONTE Raspberries and Chocolate GelatoIngredients",
    "Water, Sugars (sugar, glucose solids, raspberry purée, glucose), Modified milk ingredients, Coconut oil, Cocoa, Milk ingredients, Concentrated lemon juice, Pectin, Beet juice, Carob bean gum, Mono- and diglycerides, Guar gum, Proplyene glycol monostearate, Cellulose gum, Carrageenan, Citric acid, Beta-carotene, Turmeric, Natural flavour.",
    "You might be interested in"
  ]
}