{
  "metadata": {
    "url": "https://www.madewithnestle.ca/drumstick/drumstick-berry-bliss",
    "category": "Product",
    "title": "DRUMSTICK Berry Bliss",
    "n_tokens": 330,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-02/drumstick-berry-bliss1-special-edition-en-header.png",
        "role": "secondary",
        "alt": "drumstick berry bliss special edition en header"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/Plant-Based-Caramel-En-new-header.png?itok=1ZHawC7E",
        "role": "secondary",
        "alt": "Plant Based Caramel En new"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/drumstick_chock_fudge_browny_king_cones.png?itok=LRk1IXyg",
        "role": "secondary",
        "alt": "drumstick chockolate fudge brownie king cones"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-01/drumstick_chock_fudge_browny_tub_new.png?itok=MnR9rFNr",
        "role": "secondary",
        "alt": "Drumstick Chocolate Fudge Brownie Tub"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-01/drumstick_straw_cheesecake_tub_new.png?itok=i8cWxn_c",
        "role": "secondary",
        "alt": "Drumstick Strawberry Cheesecake Tub"
      }
    ]
  },
  "text": [
    "DRUMSTICK Berry Bliss",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Find DRUMSTICK Berry Bliss cones in your grocery store's Ice Cream & Frozen Dessert aisle and experience a creamy strawberry frozen dessert with a delicious strawberry ripple and a crunchy white chocolatey coating blended with tangy raspberry pieces. But there's more! Inside the crispy DRUMSTICK wafer cone, you'll discover a delicious chocolatey nugget at the bottom. Crafted in Canada with dairy from Canadian cows, DRUMSTICK Berry Bliss cones use non-artificial colours and natural flavours. NESTLÉ DRUMSTICK is committed to supporting the community. For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service. Since 1928, DRUMSTICK has been Canada's favourite sundae cone, creating joyful memories for generations.",
    "Crispy Wafer Cone: The DRUMSTICK cone you love filled with creamy strawberry frozen dessert with delicious strawberry ripple",
    "Layers Of Fun: White chocolatey coating blended with pieces of raspberry, and a giant chocolatey nugget at the bottom of each cone",
    "From Canada With Love: DRUMSTICK Berry Bliss cones are crafted in Canada with dairy from Canadian cows",
    "Just The Good Stuff: Made with non-artificial colours and natural flavours",
    "Canada's Favourite Cone: The original sundae cone experience since 1928; Find it in your grocery store's Ice Cream & Frozen Dessert aisle",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Per 1 cone (125 ml)Amount% DVCalories270Carbohydrate38gFibre1g4%Sugars26g26%Fat12g16%Cholesterol5mgSaturated9g45%Trans0gProtein3gSodium80mg3%Amount% DVCalcium50mg4%Iron1mg6%Potassium175mg5%",
    "Modified milk ingredients, Sugars (sugar, glucose), Coconut oil, Wheat flour, Strawberry ripple (strawberry purée, sugar, glucose, water, citric acid, pectin, elderberry and lemon juice concentrates, carob bean gum, calcium chloride), Milk ingredients, Cocoa, Modified palm oil, Soy lecithin, Mono- and diglycerides, Palm oil, Freeze dried raspberries, Citric acid, Propylene glycol monostearate, Salt, Soybean oil, Cellulose gum, Carob bean gum, Carrageenan, Beet red, Caramel colour, Natural flavour.",
    "Where to Buy",
    "You might be interested in"
  ]
}