{
  "metadata": {
    "url": "https://www.madewithnestle.ca/drumstick/drumstick-cookies-creme",
    "category": "Product",
    "title": "DRUMSTICK Cookies n’ Crème",
    "n_tokens": 329,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/Plant-Based-Caramel-En-new-header.png?itok=1ZHawC7E",
        "role": "secondary",
        "alt": "Plant Based Caramel En new"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/drumstick_chock_fudge_browny_king_cones.png?itok=LRk1IXyg",
        "role": "secondary",
        "alt": "drumstick chockolate fudge brownie king cones"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-01/drumstick_chock_fudge_browny_tub_new.png?itok=MnR9rFNr",
        "role": "secondary",
        "alt": "Drumstick Chocolate Fudge Brownie Tub"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-01/drumstick_straw_cheesecake_tub_new.png?itok=i8cWxn_c",
        "role": "secondary",
        "alt": "Drumstick Strawberry Cheesecake Tub"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-01/drumstick_caramel_tub_new.png?itok=dvZRgXJL",
        "role": "secondary",
        "alt": "Drumstick Vanilla Caramel Tub"
      }
    ]
  },
  "text": [
    "DRUMSTICK Cookies n’ Crème",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Find DRUMSTICK Cookies n' Crème cones in your grocery store's Ice Cream & Frozen Dessert aisle and experience a delicious vanilla frozen dessert with scrumptious chocolate cookie pieces throughout, coated in a crunchy white chocolatey coating blended with chocolate cookie pieces. But there's more! Inside the crispy DRUMSTICK wafer cone you'll discover a delicious chocolatey nugget at the bottom. Crafted in Canada with dairy from Canadian cows, DRUMSTICK Cookies n' Crème cones use non-artificial colours crafted from natural sources. NESTLÉ DRUMSTICK is committed to supporting the community. For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service. Since 1928, DRUMSTICK has been Canada's favourite sundae cone, creating joyful memories for generations.",
    "Crispy Wafer Cone: The DRUMSTICK cone you love filled with delicious vanilla frozen dessert with crunchy chocolate cookie pieces throughout",
    "Layers Of Fun: White chocolatey coating blended with chocolate cookie pieces, and a giant chocolatey nugget at the bottom of each cone",
    "From Canada With Love: DRUMSTICK Cookies 'n Crème cones are crafted in Canada with dairy from Canadian cows",
    "Just The Good Stuff: Made with non-artificial colours prepared from natural sources",
    "Canada's Favourite Cone: The original sundae cone experience since 1928; Find it in your grocery store's Ice Cream & Frozen Dessert aisle",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Per 1 cone (125 ml)Amount% DVCalories270Carbohydrate37gFibre1g4%Sugars24g24%Fat12g16%Cholesterol5mgSaturated9g45%Trans0gProtein3gSodium110mg5%Amount% DVCalcium50mg4%Iron1mg6%Potassium175mg5%",
    "Modified milk ingredients, Sugars (sugar, glucose), Coconut oil, Wheat flour, Milk ingredients, Cookie pieces (wheat flour, sugar, palm oil, cocoa, baking soda, salt, soy lecithin), Modified palm oil, Cocoa, Cocoa butter, Soy lecithin, Mono- and diglycerides, Palm oil, Salt, Soybean oil, Propylene glycol monostearate, Cellulose gum, Carob bean gum, Carrageenan, Caramel colour, Annatto, Natural flavour.",
    "Where to Buy",
    "You might be interested in"
  ]
}