{
  "metadata": {
    "url": "https://www.madewithnestle.ca/french-christmas",
    "category": "Promo",
    "title": "French Canadian Christmas",
    "n_tokens": 747,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2021-11/01_location.png?itok=Mdx8cN3W",
        "role": "secondary",
        "alt": "location"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2021-11/02_maple-syrup.png?itok=uTT6_gN6",
        "role": "secondary",
        "alt": "maple syrup"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2021-10/moon.png?itok=xnsY4uu5",
        "role": "secondary",
        "alt": "conversation"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2021-10/fireworks.png?itok=RzG3jxIh",
        "role": "secondary",
        "alt": "infinite"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-11/xmas_03_Footer.jpg",
        "role": "secondary",
        "alt": "Christmas Gift"
      }
    ]
  },
  "text": [
    "Fun facts",
    "Deep Roots",
    "Recipes",
    "Nestle Holiday",
    "On a cold winter’s day, nothing’s quite like a warm waft full of spices such as clove, cinnamon and nutmeg.",
    "If you’re lucky enough to visit the kitchen of a French-Canadian, you’ll be offered loads of traditional sweet and savoury dishes.  We’ve got indulgent French-Canadian dishes to share from favourite Christmas desserts like TURTLES butter tarts and NESQUIK Bûche de noël to a unique version of tourtières with added NESCAFÉ coffee flavour!",
    "If your favourite French-Canadian, Acadian or Québécois dishes are missing, we’d love to hear from you. Send us a message on social media!",
    "It’s that time of year to decorate your Christmas tree, listen to Christmas tunes and overindulge in delicious meals and feasts! Why not try some French-Canadian classics? Simple, easy, inexpensive.",
    "Gather your loved ones around the table for a taste of the French-Canadian culture and cuisine rooted in tradition. Many French-Canadian desserts were crafted by the working class with kitchen staples on hand like; butter, flour, milk and sweeteners such as brown sugar, maple syrup or molasses. Some of these delicious economical desserts were made with leftover pastry to avoid waste.",
    "French Canadian Recipes",
    "Nesquik Bûche de Noël",
    "A Yule log or bûche de Noël is a traditional Christmas cake.  This gluten-friendly dessert is flavoured with Nesquik and made…up of a delicious cream cheese filling. Why not add to the celebration with some fun and festive SMARTIES! Get creative in the kitchen and decorate this classic holiday dessert to your liking. This dessert enjoyed by many French-Canadian families around the holidays will impress any dinner guests.",
    "63 mins.",
    "20 mins.",
    "MacKintosh's Caramel Apple Beignets",
    "These delicious doughy treats get their name from the French term for “fritter”. This doughnut pastry is best served warm…and offers 16 fresh and easy to make beignets sure to please your friends and family. Dotted with chopped Mackintosh toffee bits and dried apple and dusted with cinnamon sugar, these beignets will be perfect as a holiday treat.",
    "25 mins.",
    "Chocolate Bannock Mixed Berry Shortcakes",
    "This lightly sweetened and fresh fruit dessert is a healthier and lightened-up version of shortcake that tastes as good as it…looks. Try this classic recipe with a hint of maple syrup and our added twist using BOOST Powdered Chocolate. Dusted with a bit of icing sugar or garnished with a fresh mint leaf, these 6 beautiful and delicious shortcakes will be great for sharing with your loved ones.",
    "Mackintosh’s Chomeur Pudding",
    "Fabricated during the Great Depression, this go to cake batter is made up of kitchen staples traditionally served with hot…maple syrup or caramel. This classic French-Canadian dessert, also known as “unemployment cake”, is prepared with MacKintosh’s Toffee Bars for a wonderful sweet and creamy variation.",
    "23 mins.",
    "22 mins.",
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that…is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "Savoury NESCAFE Flavoured Beef Tourtière",
    "This savoury pie is a classic French-Canadian meal traditionally enjoyed as part of the Christmas Eve feast. This recipe is…typically handed down through generations, with every family preparing a slight variation on the type of meat used for the pie. Here, Nescafé Rich and Maggi Seasoning bring depth and dimension — sure to become a new family favourite this holiday season",
    "45 mins.",
    "110 mins.",
    "Chocolate Caramel Tarte au Sucre",
    "Inspired by traditional Quebecois cuisine, this ooey-gooey tart is a Canadian holiday classic. Originally made with just…maple syrup for sweetness, as it was a common ingredient in the region, the recipe has been adapted over the years to include brown sugar as well. This modern version includes nutty Turtles chocolates and creamy Mackintosh Caramels for extra flavour, enhanced texture and added indulgence.",
    "30 mins.",
    "61 mins.",
    "Classic Butter Tarts topped with TURTLES",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a…classic dessert.",
    "12 mins.",
    "TURTLES Baked Apples",
    "Treat the family to delicious TURTLES baked apples, and everyone will be thankful for YOU!",
    "40 mins.",
    "AERO Caramel Truffles Yule Log Cake",
    "15 mins."
  ]
}