{
  "metadata": {
    "url": "https://www.haagen-dazs.ca/en/haagen-dazs/chocolate-chocolate-chunk-ice-cream",
    "category": "Product",
    "title": "HÄAGEN-DAZS Chocolate & Chocolate-Chunk Ice Cream",
    "n_tokens": 329,
    "n_tables": 1,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.haagen-dazs.ca/sites/default/files/hdz-prod-tub_classics_ccc.png",
        "role": "secondary",
        "alt": "Alt text placeholder"
      }
    ]
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "Chocolate Chocolate Chunk Ice Cream",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Indulge in the irresistible taste of HÄAGEN-DAZS®Chocolate Chocolate Chunk Ice Cream. Since 1960, our passion has taken us on a journey to transform only the finest ingredients into a simply extraordinary ice cream experience. Chocolate Chocolate Chunk is the perfect combination of fine cocoa, chocolate fudge chunks and pure, sweet cream. Made with 100% dairy, this decadent, textured treat will satisfy any chocolate craving.",
    "The perfect combination of fine cocoa, chocolate fudge chunks and pure, sweet cream.",
    "Our ice cream is made with 100% Canadian dairy and 100% sustainably sourced cocoa.",
    "HÄAGEN-DAZS®has been perfecting premium ice cream since 1960.",
    "Each tub is finished with a quality seal to guarantee freshness.",
    "Also try HÄAGEN-DAZS®Double Chocolate Almond Ice Cream Bars for a chocolate experience elevated with almonds.",
    "Per 3/4 cup (188 ml)Amount% DVCalories440Carbohydrate41gFibre2g7%Sugars36g36%Fat28g37%Cholesterol110mgSaturated Fat18g93%Trans Fat0.5gProtein7gSodium130mg6%Amount% DVCalcium200mg15%Iron4.5mg25%Potassium450mg10%",
    "Cream, sugar, concentrated skim milk, chocolate fudge  chunks (sugar, coconut oil, cocoa, butter oil, corn starch, soy lecithin, natural flavour, milk), liquid egg yolks, cocoa. May contain peanuts / nuts.",
    "RECIPES",
    "CARDAMOM DONUTS WITH VANILLA BEAN ICE CREAM",
    "Did anyone say ice cream?! These cardamon donuts are taken to the next level with Haagen Dazs flavoured vanilla bean ice cream. Once the donuts are done they are drizzled with honey for an epic bite sure to knock your socks off. For extra flavour, sprinkle cinnamon and cardamon on the ice cream, yum!",
    "Meringue Sandwiches With Pineapple Coconut Ice Cream",
    "Delightful mini meringues served with sweet and refreshing pineapple coconut ice cream.",
    "PISTACHIO AND COCOA DUSTED PICCOLINOS",
    "Bite-size chocolate ice cream bites with artisanal inspired dustings of pistachio and cocoa.",
    "Caramel Apple Ice Cream Muffins",
    "APPLES AND CARAMEL ICE-CREAM MUFFINS",
    "COFFEE ICE CREAM FUDGE CAKE",
    "Coffee ice cream sandwiched between layers of rich chocolate cake, coated in chocolate ganache.",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy"
  ]
}