{
  "metadata": {
    "url": "https://www.haagen-dazs.ca/en/haagen-dazs/dulce-de-leche-ice-cream",
    "category": "Product",
    "title": "HÄAGEN-DAZS Dulce De Leche Ice Cream",
    "n_tokens": 347,
    "n_tables": 1,
    "n_images": 2,
    "images": [
      {
        "url": "https://www.haagen-dazs.ca/sites/default/files/2025-05/hdz-dulche-de-leche.png",
        "role": "secondary",
        "alt": "aagen-Dazs Dulce De Leche 8x450ml CA (EA)"
      },
      {
        "url": "https://www.haagen-dazs.ca/sites/default/files/hdz-prod-tub_classics_ddl.png",
        "role": "secondary",
        "alt": "Alt text placeholder"
      }
    ]
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "Dulce De Leche Ice Cream",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Indulge in the irresistible taste of HÄAGEN-DAZS®Dulce De Leche Ice Cream. Since 1960, our passion has taken us on a journey to transform only the finest ingredients into a simply extraordinary ice cream experience. Our Dulce De Leche ice cream is a delightful combination of caramel and sweet cream, swirled with ribbons of golden caramel. Inspired by Latin America’s treasured dessert and made with 100% Canadian dairy, this is an authentic representation of the classic that is sure to impress.",
    "An irresistible combination of caramel and sweet cream, swirled with ribbons of golden caramel.",
    "Our ice cream is made with 100% Canadian dairy.",
    "Inspired by Latin America’s treasured Dulce de Leche dessert.",
    "HÄAGEN-DAZS®has been perfecting premium ice cream since 1960.",
    "Also try HÄAGEN-DAZS®Salted Caramel ice cream for another delicious caramel experience.",
    "per 3/4 cup (188 ml)Amount% DVCalories4200%Carbohydrate44gSugars44g0%Fat24g32%Cholesterol105mg0%Saturated Fat15g78%Trans Fat0.5g0%Protein6g0%Sodium120mg5%Amount% DVCalcium225mg17%Iron0.3mg2%Potassium250mg5%",
    "Cream, concentrated skim milk, sugar, caramel swirl (sweetened condensed milk, sugar, water,corn syrup, coconut oil, pectin, soy lecithin, salt, sodium bicarbonate, natural flavour), sweetened condensed milk, liquid egg yolk, corn syrup, water, sodium bicarbonate, salt, natural flavour. May contain peanuts / nuts.",
    "RECIPES",
    "CARDAMOM DONUTS WITH VANILLA BEAN ICE CREAM",
    "Did anyone say ice cream?! These cardamon donuts are taken to the next level with Haagen Dazs flavoured vanilla bean ice cream. Once the donuts are done they are drizzled with honey for an epic bite sure to knock your socks off. For extra flavour, sprinkle cinnamon and cardamon on the ice cream, yum!",
    "Meringue Sandwiches With Pineapple Coconut Ice Cream",
    "Delightful mini meringues served with sweet and refreshing pineapple coconut ice cream.",
    "PISTACHIO AND COCOA DUSTED PICCOLINOS",
    "Bite-size chocolate ice cream bites with artisanal inspired dustings of pistachio and cocoa.",
    "Caramel Apple Ice Cream Muffins",
    "APPLES AND CARAMEL ICE-CREAM MUFFINS",
    "COFFEE ICE CREAM FUDGE CAKE",
    "Coffee ice cream sandwiched between layers of rich chocolate cake, coated in chocolate ganache.",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy"
  ]
}