{
  "metadata": {
    "url": "https://www.madewithnestle.ca/halloween",
    "category": "Promo",
    "title": "Nestlé Halloween Products For You and Your Community",
    "n_tokens": 397,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/product_thumbnail/public/2023-12/kitkat-halloween-scary-friends-90-pack.png?itok=-CP-0oYq",
        "role": "package",
        "alt": "KITKAT Halloween Scary Friends 90 pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/product_thumbnail/public/2023-12/kitkat-halloween-scary-friends-40-pack.png?itok=8Jx1ywHQ",
        "role": "package",
        "alt": "KITKAT Halloween Scary Friends 40 pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/product_thumbnail/public/2023-12/aero-halloween-25ct-carton.png?itok=1PjXj7LQ",
        "role": "package",
        "alt": "AERO Halloween 25ct Carton"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/product_thumbnail/public/2024-09/Smarties-25.jpg?itok=0lBhQS5I",
        "role": "secondary",
        "alt": "NESTLÉ SMARTIES Carton 25 discovery field trip pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/product_thumbnail/public/2023-08/00059800451758_A1C1.png?itok=9ICV3dcx",
        "role": "secondary",
        "alt": "NESTLÉ Scary Assorted Halloween Full-Sized Bars Carton 8 pack"
      }
    ]
  },
  "text": [
    "Our Scary Products",
    "Halloween Activities",
    "Recipes",
    "Happy Halloween!",
    "Encouraging a fun and haunted Halloween for you and your community",
    "Our Products",
    "KITKAT Halloween Scary Friends 90 pack",
    "KITKAT Halloween Scary Friends 40 pack",
    "NESTLÉ SMARTIES Carton 25",
    "AERO Halloween 25ct Carton",
    "NESTLÉ Scary Assorted Halloween Full-Sized Bars Carton 8 pack",
    "KITKAT Halloween 25ct Carton",
    "Coffee Crisp Snack Size 25ct Box",
    "NESTLÉ Assorted Minis Carton 120 pack",
    "More",
    "Fun Activities for Halloween",
    "Whether you’re celebrating with family, or looking for scary things to do all month long, these fun activities will get you in the Halloween spirit.",
    "Make a list of common Halloween decorations – a pumpkin, witch, spider’s web etc. – and find them around the home or neighbourhood. Extra points if you see the real Dracula!​",
    "Download now!",
    "If you want to stay spooky and cozy, stay in and watch a Halloween-themed movie or show. Festive snacks and drinks are encouraged but costumes are a must!",
    "Hide treats all over your home for little Frankensteins to find. Use bedroom or closet doors for a trick-or-treat experience, set up candy stations, or draw a helpful map.",
    "Craft a Halloween-themed calendar. Fill days with activities, jokes, fun facts, whatever! For extra oomph, end the month with a Halloween Piñata.",
    "Create a new Halloween tradition with a fun and spooky spirit who hides treats around the house all through October. For extra spirit points, have the kids search for treats while wearing their costumes.",
    "Haunted Recipes",
    "Nothing satisfies monsters more than homemade treats. That’s why we’ve included recipes that are quick, easy, and totally eerie.",
    "KITKAT® Scary Coffins",
    "This terrifying twist on the classic cupcake has a KITKAT surprise waiting within, OPEN AT YOUR OWN RISK!",
    "Get the recipe",
    "Pump(kin) up the volume this Halloween with these KITKAT Pumpkin Cupbreaks!",
    "These witchy KITKAT rice treats will make you want to fly away on a broomstick!",
    "These delicious monsters have more mmm than bite!",
    "These creepy, crawly cookies will cause delight, not fright!",
    "Proudly prepared in Canada",
    "Whether it’s KITKAT’s crisp wafers and smooth milk chocolate; AERO’s melt-in-your-mouth bites of real milk chocolate filled with tiny bubbles; SMARTIES’ colourful candy-coated milk chocolate; and COFFEE CRISP’s crispy wafer, coffee crème filling, and thin chocolatey coating, Nestlé® Minis are proudly prepared in Canada in a peanut-free facility using quality ingredients, these peanut-free treats are made with natural flavours and no artificial colours."
  ]
}