{
  "metadata": {
    "url": "https://www.haagen-dazs.ca/en/hd-en/vanilla-bean-ice-cream",
    "category": "Product",
    "title": "HÄAGEN-DAZS Vanilla Bean Ice Cream",
    "n_tokens": 307,
    "n_tables": 1,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.haagen-dazs.ca/sites/default/files/hdz-prod-tub_classics_vb.png",
        "role": "secondary",
        "alt": "Alt text placeholder"
      }
    ]
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Indulge in the irresistible taste of HÄAGEN-DAZS®Vanilla Bean Ice Cream. Since 1960, our passion has taken us on a journey to transform only the finest ingredients into a simply extraordinary ice cream experience.  Madagascar vanilla is blended with pure, sweet cream to create this unique twist on a classic flavour, with flecks of real vanilla beans in every bite. Made with 100% Canadian dairy, this sweet delight is perfection.",
    "Madagascar vanilla blended with pure, sweet cream and flecks of real vanilla beans.",
    "Our ice cream is made with 100% Canadian dairy.",
    "Each tub is finished with a quality seal to guarantee freshness.",
    "HÄAGEN-DAZS®has been perfecting premium ice cream since 1960.",
    "Elevate your dessert by pairing it with HÄAGEN-DAZS®Vanilla Bean ice cream.",
    "Per 3/4 cup (188 ml)Amount% DVCalories410Carbohydrate39gFibre0g0%Sugars38g38%Fat26g35%Cholesterol120mgSaturated Fat16g83%Trans Fat0.5gProtein7gSodium80mg3%Amount% DVCalcium225mg17%Iron0.4mg2%Potassium300mg6%",
    "Cream, sugar, concentrated skim milk, liquid egg yolk, vanilla extract, ground vanilla beans. May contain peanuts/ nuts.",
    "RECIPES",
    "CARDAMOM DONUTS WITH VANILLA BEAN ICE CREAM",
    "Did anyone say ice cream?! These cardamon donuts are taken to the next level with Haagen Dazs flavoured vanilla bean ice cream. Once the donuts are done they are drizzled with honey for an epic bite sure to knock your socks off. For extra flavour, sprinkle cinnamon and cardamon on the ice cream, yum!",
    "Meringue Sandwiches With Pineapple Coconut Ice Cream",
    "Delightful mini meringues served with sweet and refreshing pineapple coconut ice cream.",
    "PISTACHIO AND COCOA DUSTED PICCOLINOS",
    "Bite-size chocolate ice cream bites with artisanal inspired dustings of pistachio and cocoa.",
    "Caramel Apple Ice Cream Muffins",
    "APPLES AND CARAMEL ICE-CREAM MUFFINS",
    "COFFEE ICE CREAM FUDGE CAKE",
    "Coffee ice cream sandwiched between layers of rich chocolate cake, coated in chocolate ganache.",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy",
    "[table]  | Proudly Prepared in Canada using 100% Canadian Dairy"
  ]
}