{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/concerns-plastic-used-packaging",
    "category": "Blog",
    "title": "Concerns with the Plastic Used in Nestlé Packaging",
    "n_tokens": 298,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Concerns with the Plastic Used in Nestlé Packaging",
    "Thursday, May 23, 2024",
    "At Nestlé, we have three guiding pillars that influence everything we do - we call it our Purpose. This includes our efforts for individuals and families, for communities, and lastly, for the environment. When it comes to our use of plastics, we are pursuing our commitment for fully recyclable or reusable packaging, progressing towards above 95% Design for Recycling by 2025, with the aim of getting to 100%. This commitment is not only applicable here in Canada, but around the globe.",
    "We have committed to working with our partners and industry associations to explore packaging solutions – to reduce plastic usage, facilitate recycling, and develop new approaches to eliminating plastic waste - to help us reach our goals.",
    "Some examples of packaging improvements in Canada include:",
    "Smarties packaging is now made with responsibly sourced paper, diverting up to 26 tonnes of plastic from Canadian landfills each year.",
    "Nestlé Real Dairy Ice Cream is one of the first recyclable ice cream containers in Canada.",
    "All BOOST® ready-to-drink 237ml meal replacement drinks have moved to recyclable, reclosable Tetra® Prisma packaging.",
    "There are a lot of factors that go into selecting the materials we use for our packaging. In order to comply with food regulations and standards, which often have an impact on the types of materials we can use, we perform extensive testing to ensure we meet these requirements while considering the material’s environmental impact. Plastic packaging also plays an important role in safely delivering high-quality foods and drinks, while reducing food waste.",
    "To learn more regarding Sustainable Packaging at Nestlé Canada visit:Sustainable Packaging at Nestlé Canada | Nestlé (nestle.ca)",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}