{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/refund-form",
    "category": "Support",
    "title": "Great Guarantee Refund Form",
    "n_tokens": 275,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Great Guarantee Refund Form",
    "Great Taste Guarantee Refund Form",
    "BOOST® has the nutrition your body needs, and a taste you'll love. If for any reason you don't love the taste, we'll refund your purchase*. To receive a full refund of the purchase price of  BOOST®, complete the following form and follow the instructions below.",
    "Name",
    "Address",
    "- Select -",
    "Brand",
    "Original",
    "- None -",
    "Offer only applies to one (1) purchase of BOOST® products up to a maximum of $35.89, excluding sales tax.A refund check will be mailed to the name and address you provide in the amount of the purchase price reflected on original cash register receipt.Limit one refund per person, household or address.  You may send only one (1) original receipt per request.  If multiple purchases are made on the same receipt or at different times, only one purchase will qualify.No PO boxes allowed. All purchases must be made on or after January 1, 2019 as visible on the original purchase receipt in order to qualify for a refund.  Refund requests must be postmarked no later than three (3) months after the purchase date.  Offer valid only in Canada.  To be eligible for a refund, consumer must upload the original receipt and a completed Refund Request Form.The Great Taste Guarantee cannot be honored by retailers.The following requests will not be honoured: requests from employees, retailers, distributors, healthcare providers, resellers, groups, clubs, or organizations; duplicate, fraudulent, incomplete, or illegible requests; lost, late or undeliverable responses. Rights to the refund are not assignable or transferrable. Allow 6-8 weeks for processing. Void where prohibited, taxed, or restricted.For any questions, call at 1 800 565 1871orcontact us."
  ]
}