{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/how-nestle-tackles-plastic-waste",
    "category": "Blog",
    "title": "How Nestlé Tackles Plastic Waste",
    "n_tokens": 287,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "How Nestlé Tackles Plastic Waste",
    "Thursday, October 31, 2024",
    "At Nestlé, tackling plastic pollution is an urgent priority for us. Our vision is that none of our packaging, including plastics, ends up in landfill or as litter.",
    "As of 2023, Nestlé achieved 83.5% of plastic packaging designed for recycling globally, and achieved 14.9% virgin plastic reduction globally compared to our 2018 baseline.",
    "Examples of packaging improvements in Canada include transitioning the Smarties portfolio to responsibly sourced paper from plastic packaging.",
    "We are making investments to develop innovative packaging solutions and collaborating with industry associations, government, and civil society to mobilize the collective action needed to shape a waste-free future. On January 27, 2021, Nestlé Canada joined theCanada Plastics Pact (CPP), a collaborative, solutions-driven initiative that brings together industry, government, and social organizations from across Canada’s plastics value chain. The goal of the CPP is to drive significant system-wide change towards a circular economy by rethinking the way that we design, use and reuse plastics.",
    "Plastic packaging plays an important role in safely delivering high-quality food and drinks to consumers, and in reducing food loss and waste. We need to consider alternatives carefully before making changes.",
    "For more information, visit:",
    "Our sustainable packaging strategy | Nestlé Global (nestle.com)",
    "Sustainable Packaging at Nestlé Canada | Nestlé (nestle.ca)",
    "See how our product packaging is labelled with recycling information to help ensure it is disposed of in the right way,here.",
    "Discover our 2022-2023 Creating Shared Value snapshot that shares our progress and stories of how we bring our Purpose to life, making the greatest impact on our people, communities and our planet.Click here.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}