{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/coupon-usage",
    "category": "Support",
    "title": "Where to use Nestlé Complimentary Coupon Vouchers",
    "n_tokens": 962,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Select a Category",
    "Where and How to Use Nestlé Manufacturer Coupon/Vouchers",
    "Monday, July 22, 2024",
    "Thank you for taking the time to contact us and for sharing your concerns with us. We work hard to ensure the quality of our products and when something isn’t right, we appreciate the valuable feedback from consumers such as yourself!",
    "If you have received one of our Manufacturer vouchers, we understand that you may have some questions on where and how to use it. Please see the most commonly asked questions below.",
    "Q. Where can the Nestlé vouchers be used?",
    "Nestlé vouchers are accepted at most major retailers except for Costco. Ultimately, coupon acceptance is at the discretion of the retailer. If you are having difficulty claiming your voucher, please speak to the Front Store Manager who should be able to address any questions or concerns",
    "Q. Which products does the voucher cover?",
    "Your vouchers can be used on a variety of your favourite Nestlé products. See the list below of Nestlé products to which your vouchers can be applied:",
    "Chocolates and Treats",
    "AFTER EIGHT",
    "BACI",
    "BIG TURK",
    "CRUNCH",
    "KIT KAT",
    "MACKINTOSH TOFFEE",
    "MIRAGE",
    "QUALITY STREET",
    "ROLO",
    "TURTLES",
    "COFFEE MATE",
    "Ice Cream & Frozen treats:",
    "CONFECTIONERY FROZEN DESSERTS",
    "DEL MONTE",
    "DRUMSTICK",
    "HÄAGEN-DAZS",
    "PARLOUR",
    "REAL DAIRY",
    "Infant Nutrition:",
    "GERBER CEREALS",
    "GERBER MEALS",
    "GERBER PURÉES",
    "GERBER SNACKS",
    "GERBER SUPPLEMENTS",
    "NESTLÉMATERNA",
    "NIDO",
    "CERELAC",
    "Meal Time:",
    "Nutrition +:",
    "CARNATION BREAKFAST ESSENTIALS",
    "IBGARD",
    "NATURE'S BOUNTY",
    "SUNDOWN NATURALS",
    "Spring and Sparkling Water:",
    "PERRIER",
    "MAISON PERRIER",
    "SAN PELLEGRINO",
    "Quick Mix Drinks:",
    "CARNATION HOT CHOCOLATE",
    "GOOD HOST",
    "MILO",
    "NESFRUTA",
    "NESQUIK",
    "Q. Does the voucher include other Nestlé businesses?",
    "These vouchers do not apply to Nestlé Purina, Nespresso, Starbucks® Coffee at Home or Nestlé Professional.",
    "Q. Does the voucher expire? When can I use it?",
    "Please keep in mind that our coupons are generally valid for a period of at least 5-6 months and should be redeemed within that timeframe.",
    "Q. Do Nestlé Canada manufacturing vouchers have to be used all at once or can it be used multiple times?",
    "The manufacturing voucher is of one-time use. They cannot be redeemed multiple times and only apply to one purchase.",
    "Q. How to know if the product being purchased is a Nestlé Canada product?",
    "It is important to note that Nestlé is an international corporation with many products world wide. Although some Nestlé products may be found in Canadian stores, they may be coming from other markets (such as Nestlé USA).",
    "Here are some tips on how to determine if a Nestlé product is manufactured, produced or imported by Nestlé Canada.",
    "Nestlé Canada will be printed on the packaging.We recommend that you consult the back of the label of the product. Our products will mention “Nestlé Canada” as either the manufacturing or importing company.",
    "Language.The packaging will be in English & French.",
    "Website.You can also consult our official Canadian websitehttps://www.madewithnestle.cafor our available brands and products.",
    "Note: Product from other markets may be found on our corporate website:https://www.nestle.com",
    "Q. What to do if a retailer is refusing the Nestlé Canada manufacturing voucher?",
    "Our vouchers should be accepted at most major retailers. If you are experiencing the refusal of a voucher this could be for a variety of reasons:",
    "Damage or torn voucher",
    "Voucher passed expiry date",
    "Attempt to redeem on Nestlé products from another market",
    "Store coupon policies",
    "Ultimately, coupon acceptance is at the discretion of the retailer. If you are having difficulty claiming your voucher, please speak to the Front Store Manager who should be able to address any questions or concerns regarding the refusal of the voucher.",
    "Q. Where can I obtain other Nestlé coupons?",
    "We hear you!",
    "We love a good coupon or free sample, too.",
    "While we don’t always have product available for giveaways, here are a few options that you might want to explore:",
    "Nestlé Canada e-newsletter:",
    "CLICK HEREto sign up for our exclusive Nestlé Canada e-newsletter, where you can find out about special offers on Nestlé products, contests, prizes, event invitations and of course – coupons.",
    "Nestlé Baby & me program:",
    "CLICK HEREto register for the Nestlé Baby & me program, to receive high value coupons and discounts to support you through your pregnancy, and your baby right through to toddlerhood.",
    "The NEW eco-friendly Ready for Baby Savings Pack includes high value coupons on ANY GOOD START baby formula. You’ll have flexibility to redeem your formula coupons on a wide range of GOOD START products at your nearest retail store. You’ll also receive our popular Baby Feeding Guide, which offers you feeding guidelines, new baby checklists, along with nutritional tips for you and your little one.",
    "In addition to all these Nestlé GOOD START formula coupons and savings, we want to remind you that you’ll also receive personalized savings and coupons throughout your parenting journey – both in your email inbox and also your mailbox. So please keep an eye out for more savings from us after you receive your Nestlé Baby & me program Ready for Baby Savings Packs.",
    "Social Media:",
    "One of the best way to stay informed on our latest contests, promotions and giveaways is through our social media channels. Follow us on Facebook, Twitter and Instagram.",
    "Nestlé partners:",
    "We also recommend you try checking for promotions through partners we frequently work with:",
    "save.ca for current promotions from your favourite grocery retailer",
    "Checkout 51, a free cash back app that we often partner with for many of our products.",
    "SampleSource.com (Check for any ongoing promotions and choose which samples you would like to receive)",
    "Sampler (New product samples and promotions from time to time)",
    "Additionally, we recommend to that you check your local grocery store for in-store promotions, and coupons.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}