{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/nestle-canada-help-reduce-plastic-use",
    "category": "Blog",
    "title": "Nestlé Canada Efforts to Help Reduce Plastic Use",
    "n_tokens": 267,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Select a Category",
    "Nestlé Canada Efforts to Help Reduce Plastic Waste",
    "Thursday, November 28, 2024",
    "Our vision is that none of our packaging ends up in landfill or as litter. We are helping create a future where cleverly designed packaging, innovative new materials, better recycling infrastructure and reusable packaging can prevent waste on land and in lakers, waterways, and oceans.",
    "On January 27, 2021, Nestlé Canada joined theCanada Plastics Pact(CPP), a collaborative, solutions-driven initiative that brings together industry, government, and social organizations from across Canada’s plastics value chain. The goal of the CPP is to drive significant system-wide change towards a circular economy by rethinking the way that we design, use and reuse plastics.",
    "Plastic packaging plays an important role in safely delivering high-quality food and drinks to consumers, and in reducing food loss and waste. We are collaborating with industrial partners to develop new packaging materials and solutions. Examples of packaging improvements in Canada include transitioning the Smarties portfolio to responsibly sourced paper from plastic packaging.",
    "As of 2023, Nestle achieved 83.5% of plastic packaging designed for recycling globally, and achieved 14.9% virgin plastic reduction globally compared to our 2018 baseline.",
    "For more information:",
    "See how our product packaging is labelled with recycling information to help ensure it is disposed of in the right way,here.",
    "Discover our Creating Shared Value 2023 report that shares our progress and stories of how we bring our Purpose to life, making the greatest impact on our people, communities and our planet.Click here.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}