{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/Support-LGBTQI2S-Community",
    "category": "Blog",
    "title": "How Nestlé Supports the LGBTQI2S Community",
    "n_tokens": 450,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Select a Category",
    "How Nestlé Supports the 2SLGBTQIA+ Community",
    "Friday, December 20, 2024",
    "Nestlé Canada:",
    "At Nestlé Canada, Diversity, Equity, and Inclusion (DE&I) values are vital to living our purpose. We seek a culture of success that respects diversity, pursues equity, enables inclusion, and ensures our people reflect the consumers and communities we serve.​",
    "Here are some ways that Nestlé Canada supports the 2SLGBTQIA+ community:",
    "In 2020 we developed 5 Employee Resource Groups (ERGs), including our Nestlé Pride Alliance Employee Resource Group, which encourages members of the community and allies alike, to come together to establish a safe space for LGBTQ+ employees to connect, raise awareness and socialize to promote a more inclusive workplace for all.​",
    "We’re committed to empowering employee engagement groups to encourage dialogue and create a safe space for conversations with the 2SLGBTQIA+ community.",
    "We have worked with Egale Canada and various other organizations and educational institutions, holding 2SLGBTQIA+ learning workshops and sessions to help inform and educate our employees.",
    "KitKat®’s Partnership with Friends of Ruby",
    "In February 2022, Kit Kat® proudly announced a two-year partnership with Friends of Ruby, a Toronto-based 2SLGBTQIA+ organization dedicated to the progressive well-being of 2SLGBTQIA+ youth through mental health services, social services and housing.",
    "As part of the partnership, limited-edition bars featuring packaging designed by the Friends of Ruby team were available throughout February in honour of Chosen Family Day. The bars were available for purchase at Kit Kat Chocolatory in Yorkdale Mall in Toronto and 100% of proceeds were directly donated to Friends of Ruby. In December 2022, KitKat® launched another limited edition KitKat® bar with all proceeds donated to Friends of Ruby.",
    "In June, 2023, KitKat® expanded the reach of the new limited edition KitKat Pride bars, which was available on SKIP EXPRESS LANE in major cities across Canada. 100% of proceeds was donated to Friends of Ruby.  KitKat® was also an official sponsor of Pride Toronto in 2023. KitKat® had a booth at the Toronto Pride Street Fair and KitKat® and Friends of Ruby marched together in support of the 2SLGBTQIA+ community in the Toronto Pride Parade.",
    "Learn more about Friends of Ruby atfriendsofruby.ca.",
    "Nestlé Global:",
    "Globally,Nestlé Supports the 2SLGBTQIA+community:",
    "We support theUN’s LGBTI Standards of Conduct for Business.",
    "We’re partnering with LGBT+ civil society groups to advocate for civil rights and workplace protections, such as l’Autre Cercle in France, Stonewall Diversity Champions in the UK, PARKS in Italy, and Pride Connection in Mexico, Colombia and Panama.",
    "We’ve gained recognition from non-profit organizations such as Swiss LGBTI label, a certification that recognizes open and LGBTI-inclusive corporate culture.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details",
    "Still need help?"
  ]
}