{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/peanut-free-nestle-canada-products",
    "category": "Blog",
    "title": "Are Smarties Peanut-Free?",
    "n_tokens": 933,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Select a Category",
    "Peanut-Free Nestlé Canada Products",
    "Friday, August 25, 2023",
    "At Nestlé Canada, we take food allergies seriously;",
    "and the health and safety of our consumers is always our #1 priority. We want you to feel confident that the ingredient lists of our products and the details on our packaging are transparent and easy to understand – it’s important to us.",
    "Please read below to see our most frequently asked questions regarding peanut and nut allergens. We want to help answer your questions so that you can continue to enjoy your favourite treats, worry-free.",
    "The Peanut-Free logo found on our mini-sized favourites, signifies that the product was produced exclusively in our peanut-free facility. Additionally, all Nestlé products are required to follow the regulations by Health Canada and the Canadian Food Inspection Agency (CFIA). We always recommend that you check label ingredient lists or the “May Contain” statement for peanuts or tree nuts.",
    "Q. When do you use the “Peanut Free” logo?",
    "Nestlé Canada has one factory that is dedicated to peanut-free products. Neither peanut nor tree nuts are allowed in the facility – all ingredients are tested for peanuts before they are received into the factory. This logo signifies that the product was produced exclusively in our peanut-free facility in Toronto.",
    "Q. Why do certain products not have the “Peanut Free” logo? If the product does not have the logo is it safe to consume?",
    "To enjoy a product without worry, we recommend that you always verify the product label for allergen warnings. If it contains any of Canada’s priority allergens or sensitivities, it will be listed. The label on the package is the most up-to-date, and we strongly encourage consumers with any dietary needs or restrictions to look at the ingredients at the store prior to making any purchase, and certainly before consumption.",
    "Some of our products may not have the “Peanut Free” logo on them, as we have multiple manufacturing locations. If your treat does not show the “Peanut Free” logo on the packaging, it may not have been tested or produced at our peanut-free facility.",
    "Rest assured that we are required to follow the regulations by Health Canada and the Canadian Food Inspection Agency (CFIA). Any products containing peanuts would have them listed either in the ingredient list or in a “May Contain” statement.",
    "Q. What measures does the peanut-free facility take?",
    "Our peanut free facility takes extraordinary measures to ensure that there are no peanuts in the products they produce or anywhere inside the factory. They also minimize the chance of cross-contamination.",
    "Measures include:",
    "Testing of raw materials to confirm the absence of peanuts",
    "Allergy awareness training and workshops for factory workers",
    "Periodic checks of employee lockers to ensure that personnel are not bringing any peanut-containing products into the facility",
    "Q. What products have the “Peanut Free” logo on them?",
    "We put our “Peanut Free” logo on our mini-sized favourites (KitKat, Coffee Crisp, Aero and Smarties) exclusively made in our peanut free facility in Toronto.",
    "Q. Why does the label only read “Peanut Free” and not “Nut Free”?",
    "We only test for peanuts at the peanut free facility, and not for tree nuts.",
    "We do not manufacture anything with tree nuts at our Toronto facility, but we do not test ingredients for their presence.",
    "Q. What does “May Contain” mean?",
    "Priority allergens and sensitivities must be declared on the ingredient list when they are added to pre-packaged products or on precautionary allergen statements if there is a potential for cross-contamination.​ The “May Contain” statement on a label is meant to warn consumers of the possibility of cross-contamination.",
    "At Nestlé, we make all possible efforts to eliminate the potential of the cross-contact of priority food allergens on our processing lines and in our factories. Some of our factories may handle products containing priority food allergens, but through comprehensive management programs we minimize the risk of undeclared priority allergens.",
    "In circumstances where more than one product is processed on the same equipment and the equipment design makes it impossible to 100% guarantee the removal of all traces of these allergens after cleaning, we will use precautionary labelling to warn consumers of the possibility of cross-contamination (\"May Contain\" statement).​",
    "Q. What are the top priority food allergens?",
    "In Canada, there are eleven (11) priority food allergens and 2 sensitivities that must be labelled on all packaging:",
    "Peanuts",
    "Tree nuts (almonds, brazil nuts, cashew nuts, hazel nuts, macadamia nuts, pecans, pine nuts, pistachio, walnuts)",
    "Sesame seeds",
    "Milk",
    "Eggs",
    "Fish",
    "Crustaceans and Shellfish",
    "Molluscs",
    "Soy",
    "Wheat",
    "Mustard",
    "Sulfites (any more than 10ppms)",
    "Gluten (from oats, barley, triticale and wheat)",
    "These priority allergens and sensitivities have been shown to account for more than 90% of severe adverse reactions related to food allergens and must be declared on the ingredient list when they are added to pre-packaged products or on precautionary allergen statements if there is a potential for cross-contamination.​",
    "Q. What if my allergy is not part of the top 13 priority allergies and sensitivities, how do I know if the product contains this ingredient.",
    "Since this ingredient is not one of the priority allergens in Canada, the CFIA does not require it to be called out as such in the ingredients or in a \"May Contain\" statement. Because of this, we are not able to guarantee that there is no cross-contamination. Should you have any further questions regarding your allergy, we invite you to connect with one of our Consumer Experience Ambassadors for further information.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}