{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/retailers-nestle-product-claims-inquiries",
    "category": "Blog",
    "title": "Retailers: Nestlé Product Claims & Inquiries",
    "n_tokens": 243,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Retailers: Nestlé Product Claims & Inquiries",
    "Thursday, February 27, 2025",
    "Our Nestlé Connect Program allows eligible vendors to submit claims for expired or damaged products including Nestlé Confectionary chocolates, beverages and nutrition. Please note that due to the nature of certain products, there are no returns for ice cream products, water and Health Science products.",
    "If you already have an existing account, you can access the portal here:https://nestleconnect.ca/login.aspTo register:•    Please visithttps://nestleconnect.ca/login.asp•    Click on “Register Here” to set up your account.•    An email address is required for registration.•    If you have multiple stores, each request must be submitted separately.•    Once you click on “Register Here,” you will land on a separate page where you can proceed with the registration.•    After your application is approved by the Nestlé Connect team, you will have the ability to create and submit return claims online.",
    "If you have an active account and have any inquiries/issues, please email our support team at support@nestleconnect.ca or call toll-free at 1-877-772-0012. Please include the following details in your message so our representatives can better assist you:- Store Name- Store Number- Contact Name- Contact Phone Number- Transaction reference ID# (this is the 9-digit number you received from the portal if you’ve already submitted a claim)- Detailed explanation of your question/issueFor more information, please refer to the following resources:•Program Questions and Answers•Registration Process•Canada Post Shipping Information",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}