{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/coffeemate-change",
    "category": "Blog",
    "title": "Coffee-Mate Original Powder Recipe Change",
    "n_tokens": 630,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-06/Coffee%20Mate-%20Pack%20Change.PNG",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "Coffee-Mate Original Powder Recipe Change",
    "Tuesday, November 05, 2024",
    "First and foremost, we want to express our appreciation for your love and support for our Coffee-Mate Powder. Your loyalty means the world to us!",
    "We want to inform you about some recent changes we have made to our Coffee-Mate Powder recipe. These modifications were necessary to ensure the continued availability of our product. It is important to note that in the case of this change, we conducted a series of sensory tests over a period of 8 months. These tests involved a diverse group of individuals with varying taste preferences and backgrounds. Our team carefully analyzed the feedback and data collected from these tests to make informed decisions about the recipe adjustment.",
    "We understand that changes to a beloved product can raise questions, and we want to assure you that we have made these modifications with careful consideration.",
    "Q. What has changed?",
    "Ingredients:It is important to note that the vast majority of ingredients in Coffee Mate Powder have not changed. We have adjusted a few select ingredients to maintain the supply of Coffee Mate Powder in Canada amidst the constantly changing global supply chain.",
    "Packaging Redesign:Alongside these ingredient changes, we have taken the opportunity to redesign the packaging of Coffee Mate Powder.",
    "Q. Does the Coffee Mate Original Powder now contain Hazelnut?",
    "We want to assure you that our production factory is completely free from tree nuts of any kind, and the only allergen used onsite is milk. Our ingredient suppliers also adhere to strict standards and are free from tree nuts.",
    "Nestlé Canada recently completed a reformulation of the product, which involved a change in the flavour component. The new flavour ingredient has a hint of sweetness which some consumers have described as vanilla as well as mocha, almond, and hazelnut, due to the complex nature of taste perception and individual sensory experiences. It's important to note that individual taste experiences can vary greatly, and what one person perceives as a specific flavour may differ from another person's perception.",
    "We want to assure you that there are no hazelnuts, almonds, or any other tree nuts in our Coffee Mate. The reformulation may have caused some variations in taste and aroma, which we understand can be unexpected.",
    "We value your feedback and take it seriously. We are continuously working to improve our products and appreciate your patience and understanding during this transition. If you have any further concerns or questions, please don't hesitate to reach out to our consumer support team.",
    "Q. What is the closest alternative?",
    "We understand that recent changes to the Coffee Mate Original recipe have left some consumers feeling disappointed. We want to assure you that we value your feedback. We also wish to remind you about Coffee Mate Light, an existing option in our portfolio that closely aligns with the original recipe you know and love.",
    "We understand that change can be challenging, but we believe that Coffee Mate Light will meet your expectations. We invite you to rediscover this beloved option. We are confident that you will find it to be a worthy alternative that brings joy to your daily coffee ritual.",
    "If you have any further questions or require additional information, please do not hesitate to reach out to our support team. We are here to address any concerns and provide you with the necessary assistance. Thank you for your continued support and loyalty to Coffee Mate Powder. We value your feedback and trust, and we remain committed to delivering a delightful experience.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details",
    "How can we help?",
    "Please provide us with more details, including product information, and we'll be happy to help.",
    "Still need help?"
  ]
}