{
  "metadata": {
    "url": "https://www.madewithnestle.ca/help/article/buying-selling-resale-retailers",
    "category": "Blog",
    "title": "Retailers: Buying and Selling Nestlé Products",
    "n_tokens": 357,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Retailers: Buying and Selling Nestlé Products",
    "Thursday, February 27, 2025",
    "We have pretty big size requirements for bulk orders that are important to consider before placing an order. If you are looking to make a small order or a one-time purchase, we recommend reaching out to your closest wholesaler.",
    "It is important to note that our company has established specific policies regarding sales. Unfortunately, we only sell to our retail customers for resale purposes within Canada, and we export directly to our affiliates. While this policy may limit our ability to seize certain market opportunities, it is a global policy that has been put in place to maintain the integrity and consistency of our operations.",
    "Contact InfoExisting customers:- For BOOST ® sales, call 1-800-267-8782.- For Coffee sales, call 1-800-288-8682.- For Ice Cream sales, call 1-888-763-7853. For freezer repair requests, call 1-877-871-1525.- For Infant Nutrition, call 1-800-387-5536.- For Health Science Medical Nutrition, call 1-800-565-1871.- For Waters, call Nestlé Waters Customer Service at 1-888-565-1445.- For Nestlé Professional Equipment Service (freezer repair etc): 1-800-538-3545- For  Starbucks® Equipment Services: 1-866-778-7289- For all other inquiries: 1-800-500-5634",
    "New customers:For new customers, particularly retailers and wholesalers, or anyone interested in selling our products, we encourage you to contact our Sales department directly at 1-800-500-5634. By selecting option 5, you will be directed to our Customer Service line, where our representatives are ready to assist you. They can answer any questions you may have and guide you through the process.",
    "If you are a retailer interested in purchasing Nestlé ice cream products from your local distributor, we have streamlined the process to help you get started. You can visithttps://shop.nestleicecream.ca/to explore your options.",
    "For Ice Cream related inquiries, please contact our Customer Care team directly. You can expect a response within 48 hours.",
    "Email: icecream.customercare@ca.nestle.com.Phone: 1-888-763-7853.",
    "Note: If you are a consumer, you can purchase our products at most major retailers. If you are encountering a problem or an issue, we want to hear from you as well! Please connect with our one of our Ambassadors by visitinghttps://www.madewithnestle.ca/help/connect-with-Nestle-Canada",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}