{
  "metadata": {
    "url": "https://www.madewithnestle.ca/holiday-favourites/nestle-holiday-advent-calendar",
    "category": "Promo",
    "title": "NESTLE Holiday Advent Calendar",
    "n_tokens": 575,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-07/Holiday-Advent-Calendar.png",
        "role": "secondary",
        "alt": "Holiday Advent Calendar "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-07/Holiday-Advent-Calendar-back-shot.png",
        "role": "secondary",
        "alt": "Holiday Advent Calendar "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/kit-kat-hockey-stick.png?itok=yNbOarHC",
        "role": "secondary",
        "alt": "hockey stick bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/TURTLES-Classic-Holiday-Gift-Box.png?itok=TffHhr_E",
        "role": "secondary",
        "alt": "TURTLES Classic Holiday Gift Box"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/quality_street_180_g_tin.png?itok=7IURMh8h",
        "role": "secondary",
        "alt": "QUALITY STREET Celebration Tin, 180 grams. Assortment of caramels, crèmes, and chocolate pralines."
      }
    ]
  },
  "text": [
    "NESTLE Holiday Advent Calendar",
    "Countdown to Christmas with NESTLÉ North Pole Friends Advent Calendar! Behind each of the 24 doors of this advent calendar lies a special Christmas chocolate treat -- a KITKAT Mini, a SMARTIES Ornament, a KITKAT Bubble, an AERO Mini, or a KITKAT Santa. The festive packaging makes NESTLÉ North Pole Friends Advent Calendar the perfect chocolate gift to kick off the holiday season. As part of their commitment to sustainability practices, NESTLÉ uses 100% sustainably sourced cocoa that is certified by the Rainforest Alliance, an organization that works to help farmers improve the quality of their products and strengthen their communities. Closer to home, for more than 25 years NESTLÉ Canada has raised more than $10.2 million in support of Kids Help Phone.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "NESTLE Holiday Advent CalendarFeatures and Benefits",
    "Countdown To Christmas: NESTLÉ North Pole Friends Advent Calendar is a fun way to countdown to Christmas",
    "Christmas Chocolate Fun: Behind each of the 24 doors of this advent calendar is either a KITKAT Mini, a SMARTIES Ornament, a KITKAT Bubble, an AERO Mini, or a KITKAT Santa",
    "Ready For Gifting: NESTLÉ North Pole Friends Advent Calendar makes a perfect Christmas chocolate gift to kick off the holiday season",
    "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases 100% Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities",
    "Proudly Supporting Kids Help Phone: For more than 25 years NESTLÉ Canada has raised more than $10.2 million in support of Kids Help Phone",
    "Loved Worldwide: Over 22 billion KITKAT fingers are consumed globally every year",
    "NESTLE Holiday Advent CalendarNutrition Information",
    "KitKat mini barPer 1 piece (12 g)Amount% DVCalories60Carbohydrate8gDietary Fiber0g0%Sugars6g6%Fat3g4%Cholesterol5mgSaturated2gTrans Fat0gProtein1gSodium10mg0%Amount% DVCalcium20mg2%Iron0.4mg2%Potassium40mg1%Kit Kat mini ornaments-enPer 1 piece (5.7 g)Amount% DVCalories30Carbohydrate4gDietary Fiber0g0%Sugars3g3%Fat1.5g2%Cholesterol5mgSaturated1gTrans Fat0gProtein0.4gSodium3mg0%Amount% DVCalcium10mg1%Iron0.3g2%Potassium20mg0%KitKat BubblesPer 1 piece (7 g)Amount% DVCalories40Carbohydrate4gDietary Fiber0gSugars4g4%Fat2.5g3%Cholesterol5mgSaturated1gTrans Fat0gProtein0.4gSodium5mg0%Amount% DVCalcium10mg1%Iron0.3g2%Potassium20mg1%Aero mini barPer 1 piece (7.3 g)Amount% DVCalories40Carbohydrate5gDietary Fiber0g0%Sugars4g4%Fat2g3%Cholesterol5mgSaturated1gTrans Fat0gProtein0.4gSodium0.2mg1%Amount% DVCalcium10mg1%Iron0.2mg1%Potassium30mg1%KitKat SantaPer 1 piece (29 g)Amount% DVCalories160Carbohydrate17gDietary Fiber1g4%Sugars15g15%Fat9g12%Cholesterol5mgSaturated5gTrans Fat0.1gProtein2gSodium30mg1%Amount% DVCalcium40mg3%Iron1.25mg7%Potassium100mg3%",
    "NESTLE Holiday Advent CalendarIngredients",
    "KITKAT Mini Bar Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugar, Wheat flour, Modified palm oil, Cocoa*, Palm oil, Baking soda, Soy lecithin, Yeast, Protease, Xylanase. * Rainforest Alliance CertifiedAERO Mini Bar Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour). *Rainforest Alliance CertifiedKITKAT Bubbles Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, sunflower and/or rapeseed lecithin), Sugars (sugar, lactose), Palm and vegetable oils, Cocoa powder*, Rice flour, Modified milk ingredients, Unsweetened chocolate*, Potato and corn starch, Sunflower and/or rapeseed lecithin, Corn bran, Corn flour, Baking soda, Salt, Natural flavour. May contain: Tree nuts.*Rainforest Alliance CertifiedSMARTIES Mini Ornaments Ingredients: Milk chocolate (sugar, unsweetened chocolate*, modified milk ingredients, cocoa butter*, soy lecithin, natural flavour), Sugar, Modified milk ingredients, Unsweetened chocolate*, Cocoa butter*, Wheat flour, Rice starch, Sunflower lecithin, Carnauba wax, Barley malt extract, Citric acid, Beeswax, Glycerol, Modified corn starch, Acetic acid, Sodium citrate, Beet red, Carotene, Turmeric, Spirulina, safflower, and radish concentrates. May contain: Tree nuts *Rainforest Alliance CertifiedNESTLE KIT KAT SANTA Ingredients: Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, sunflower and/or rapeseed lecithin), Sugars (sugar, lactose), Palm and vegetable oils, Rice flour, Cocoa*, Modified milk ingredients, Potato and corn starch, Unsweetened chocolate*, Sunflower and/or rapeseed lecithin, Baking soda, Salt, Natural flavour, Corn flour. May contain: Tree nuts.*Rainforest Alliance Certified",
    "You might be interested in"
  ]
}