{
  "metadata": {
    "url": "https://www.madewithnestle.ca/holiday-favourites/quality-street-salted-caramel-milk-chocolate-truffles",
    "category": "Promo",
    "title": "QUALITY STREET Salted Caramel Milk Chocolate Truffles",
    "n_tokens": 191,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/salted_caramel_truffles.png",
        "role": "secondary",
        "alt": "Alt text placeholder"
      }
    ]
  },
  "text": [
    "QUALITY STREET Salted Caramel Milk Chocolate Truffles",
    "Surprise someone special with the decadent and delicious holiday gift of NESTLÉ QUALITY STREET Salted Caramel Milk Chocolate Truffles. Each carton opens up to individually wrapped milk chocolate truffles with a smooth salted caramel flavoured centre and coated in crunchy salted caramel pieces. Indulgent, enticing and sure to bring a smile to anyone's face, these delightful sweet treats are perfect for sharing and make for a lovely gift to cherish those special holiday moments.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "QUALITY STREET Salted Caramel Milk Chocolate TrufflesFeatures and Benefits",
    "Milk chocolate truffles with a salted caramel flavoured centre covered with salted caramel",
    "Easy to gift and share, each carton contains individually wrapped truffles",
    "Natural flavours and no artificial colours",
    "100% Sustainably Sourced Cocoa certified by UTZ",
    "QUALITY STREET has been proudly part of British heritage since 1936",
    "QUALITY STREET Salted Caramel Milk Chocolate TrufflesNutrition Information",
    "Per 4 pieces (40 g)Amount% DVCalories190Carbohydrate25gFibre1g4%Sugar Alcohol3gSugars20g20%Fat10g13%Cholesterol5mgSaturated Fat6g31%Trans Fat0.1gProtein2gSodium35mg2%Amount% DVCalcium30mg2%Iron2mg11%Potassium100mg2%",
    "QUALITY STREET Salted Caramel Milk Chocolate TrufflesIngredients",
    "Sugars (sugar, glucose-fructose), unsweetened chocolate, modified milk ingredients, cocoa butter, sorbitol, sunflower lecithin, natural flavour, invertase, salt, baking soda."
  ]
}