{
  "metadata": {
    "url": "https://www.madewithnestle.ca/kit-kat/kit-kat-easter-break-chocolate-and-wafer-bunnies-12-pack",
    "category": "Product",
    "title": "Kit Kat Easter Break Chocolate and Wafer Bunnies 12 Pack",
    "n_tokens": 407,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-01/KK-EasterBunny-132g-Pouch.png",
        "role": "secondary",
        "alt": "Kit kat Easter Mini Bunnies Pouch"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-salt-caramel-tablet.png?itok=2l6dOMcN",
        "role": "secondary",
        "alt": "KITKAT Salt caramel Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-hazelnut-tablet.png?itok=oXBjb1D4",
        "role": "secondary",
        "alt": "KITKAT Hazelnut Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-classic-tablet.png?itok=qjbDJjGD",
        "role": "secondary",
        "alt": "KITKAT Classic Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/KITKAT-CHUNKY-King-header.png?itok=M2vcFY9c",
        "role": "secondary",
        "alt": "KITKAT CHUNKY King bar"
      }
    ]
  },
  "text": [
    "Kit Kat Easter Break Chocolate and Wafer Bunnies 12 Pack",
    "Ready for your Easter Break? Each pouch of NESTLÉ Easter Break KITKAT Chocolate and Wafer Bunnies 12 Pack (132 g) graces the season with milk chocolate bunny rabbits filled with pieces of signature, crispy KITKAT wafer. During the Easter season, we know that everyone needs a break, so that's why even our Easter bunny is taking a little break too. You can feel good about treating loved ones to great chocolate, as our milk chocolate bunnies are made with natural flavours, and sustainably-sourced cocoa certified by the RAINFOREST ALLIANCE. A delight for the whole family, each little bunny is perfect for sharing, gifting, and filling up an Easter Basket. HAVE A BREAK, HAVE A KITKAT",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Kit Kat Easter Break Chocolate and Wafer Bunnies 12 PackFeatures and Benefits",
    "NESTLÉ Easter Break KITKAT Chocolate and Wafer Bunnies 12 Pack (132 g) are little milk chocolate bunnies filled with the signature, crispy KITKAT wafer",
    "Individually-wrapped, perfect for including in an Easter basket, or sharing the love of KITKAT with friends and family",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Kit Kat Easter Break Chocolate and Wafer Bunnies 12 PackNutrition Information",
    "Per 4 Bunnies (44g)Amount% DVCalories240Carbohydrate26Dietary Fiber1g4%Sugars22g22%Fat14g19%Cholesterol5mgSaturated Fat8g41%Trans Fat0.1gProtein3gSodium45mg2%Amount% DVCalcium50mg4%Iron1.75mg10%Potassium150mg3%5% or less is a little, 15% or more is a lot.",
    "Kit Kat Easter Break Chocolate and Wafer Bunnies 12 PackIngredients",
    "Sugar, Modified Milk Ingredients, Palm and Vegetable Oils, Cocoa Butter*, Unsweetened Chocolate*, Rice Flour, Cocoa Powder*, Sunflower Lecithin, Potato and Corn Starch, Baking Soda, Salt, Natural Flavour, Bamboo Powder.May contain tree nuts.*Rainforest Alliance Certified",
    "RECIPES",
    "KIT KAT Spiked Hot Chocolate",
    "Hot chocolate on its own is great. But hot chocolate + KIT KAT and coffee liqueur, now that's just unfair.",
    "KIT KAT Seattle Strips",
    "KIT KAT, bacon and avocado",
    "KIT KAT Cowboy Crudité",
    "Fancy to say, couldn’t be less fancy to make.",
    "KIT KAT POPS Fruit Custard",
    "Enjoy a delightful twist on a popular Chinese-inspired recipe, perfect for the Mid-Autumn Festival. A creamy custard with fresh fruits mixed with KIT KAT POPS for an added chocolate crispy crunch. Plus, it's very easy to prepare, making it a fantastic family activity.",
    "Festive KITKAT Holiday Chocolate House",
    "Our KIT KAT House is the sweetest decoration around!",
    "You might be interested in"
  ]
}