{
  "metadata": {
    "url": "https://www.madewithnestle.ca/kit-kat/kitkat-nhl-chocolate-hockey-stick",
    "category": "Product",
    "title": "KITKAT NHL Chocolate Hockey Stick",
    "n_tokens": 456,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-07/kit-kat-hockey-stick.png",
        "role": "secondary",
        "alt": "hockey stick bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-salt-caramel-tablet.png?itok=2l6dOMcN",
        "role": "secondary",
        "alt": "KITKAT Salt caramel Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-hazelnut-tablet.png?itok=oXBjb1D4",
        "role": "secondary",
        "alt": "KITKAT Hazelnut Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-classic-tablet.png?itok=qjbDJjGD",
        "role": "secondary",
        "alt": "KITKAT Classic Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/KITKAT-CHUNKY-King-header.png?itok=M2vcFY9c",
        "role": "secondary",
        "alt": "KITKAT CHUNKY King bar"
      }
    ]
  },
  "text": [
    "KITKAT NHL Chocolate Hockey Stick",
    "Calling all hockey fans! NESTLÉ KITKAT and the NHL have teamed up to make this awesome holiday gift -- a fun hockey stick-shaped package filled with individually wrapped KITKAT Minis. Open the package to enjoy KITKAT's signature crispy wafers enrobed in smooth milk chocolate. The perfect chocolate gift for the hockey fan in your life, it makes an ideal stocking stuffer. As part of their commitment to sustainability practices, NESTLÉ uses sustainably sourced cocoa that is certified by the Rainforest Alliance, an organization that works to help farmers improve the quality of their products and strengthen their communities. It’s time to take a break and treat yourself to KITKAT's perfect balance of crisp wafers and smooth milk chocolate. Have a break, have a KITKAT!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "KITKAT NHL Chocolate Hockey StickFeatures and Benefits",
    "Calling All Hockey Fans: NESTLÉ KITKAT and the NHL have teamed up to make this awesome holiday treat -- a fun hockey stick-shaped package filled with individually wrapped KITKAT Minis",
    "Chocolate Gift: Makes a perfect stocking stuffer or chocolate gift for your favourite hockey fan",
    "Have A Break, Have A KITKAT: Enjoy the delicious taste of NESTLÉ KITKAT's signature crispy wafers covered in smooth milk chocolate",
    "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Loved Worldwide: Over 22 billion KITKAT fingers are consumed globally every year",
    "Proudly Prepared in Canada",
    "KITKAT NHL Chocolate Hockey StickNutrition Information",
    "Per 3 barres (35 g)Amount% DVCalories180Carbohydrate23gDietary Fiber1g4%Sugars18g18%Fat9g12%Cholesterol5mgSaturated5g26%Trans Fat0.1gProtein2gSodium30mg1%Amount% DVCalcium40mg3%Iron1mg6%Potassium125mg4%",
    "KITKAT NHL Chocolate Hockey StickIngredients",
    "Milk chocolate (sugar, modified milk ingredients, cocoa butter*, unsweetened chocolate*, soy lecithin, polyglycerol polyricinoleate, natural flavour), Sugar, Wheat flour, Modified palm oil, Cocoa*, Palm oil, Baking soda, Soy lecithin, Yeast, Protease, Xylanase. * Rainforest Alliance Certified",
    "RECIPES",
    "KIT KAT Spiked Hot Chocolate",
    "Hot chocolate on its own is great. But hot chocolate + KIT KAT and coffee liqueur, now that's just unfair.",
    "KIT KAT Seattle Strips",
    "KIT KAT, bacon and avocado",
    "KIT KAT Cowboy Crudité",
    "Fancy to say, couldn’t be less fancy to make.",
    "KIT KAT POPS Fruit Custard",
    "Enjoy a delightful twist on a popular Chinese-inspired recipe, perfect for the Mid-Autumn Festival. A creamy custard with fresh fruits mixed with KIT KAT POPS for an added chocolate crispy crunch. Plus, it's very easy to prepare, making it a fantastic family activity.",
    "Festive KITKAT Holiday Chocolate House",
    "Our KIT KAT House is the sweetest decoration around!",
    "You might be interested in"
  ]
}