{
  "metadata": {
    "title": "Nature's Bounty\n – Nature's Bounty",
    "n_tokens": 706,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://naturesbounty.ca/cdn/shop/files/hero-mobile.jpg?v=1743718382&width=3840",
        "role": "package",
        "alt": ""
      },
      {
        "url": "https://naturesbounty.ca/cdn/shop/files/a047c47f6d65dacd68dd0ed0c8de29a1.jpg?v=1737409844&width=3840",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://naturesbounty.ca/cdn/shop/files/Appearance_dbfd1013-ca91-4e48-9d6a-8f756aa65d0a.jpg?v=1741805829&width=1500",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://naturesbounty.ca/cdn/shop/files/Stress.jpg?v=1741805927&width=1500",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://naturesbounty.ca/cdn/shop/files/Sleep.jpg?v=1741805889&width=1500",
        "role": "secondary",
        "alt": ""
      }
    ],
    "url": "https://naturesbounty.ca/",
    "category": "Product"
  },
  "text": [
    "Take the Personalized Vitamin Quiz to get a $3 Coupon!",
    "Language",
    "Health BenefitsHealth BenefitsAppearanceBone & JointEnergyEyeGeneral WellnessGutHeartImmunitySleepStressHerbalWomen's HealthKid's Health",
    "ProductsProductsBest SellersVitaminsVitaminsVitamin BVitamin CVitamin DGummy VitaminsView All VitaminsSupplementsSupplementsBiotinMelatoninOmegasProbioticsView All SupplementsMineralsMineralsCalciumIronMagnesiumZincView All MineralsHerbsHerbsTurmericView All HerbsAll Others",
    "Where to Buy",
    "ProductsBest SellersVitaminsSupplementsMineralsHerbsAll OthersVitamin BVitamin CVitamin DGummy VitaminsView All VitaminsBiotinMelatoninOmegasProbioticsView All SupplementsCalciumIronMagnesiumZincView All MineralsTurmericView All Herbs",
    "It’s in your nature toth",
    "Who you are today is already enough. We’re just here to supplement you.",
    "Shop by Health Benefits",
    "AppearanceSupport your natural beauty from the inside out with Nature’s Bounty Hair,...AppearanceFeel better in your skin",
    "Stress & MoodNature's Bounty® stress and mood supplements use the latest science and finest...Stress & MoodFeel better in your skin",
    "SleepPerfect for those experiencing occasional sleeplessness or seeking to improve their quality...SleepFeel better in your skin",
    "General WellnessLooking for general wellness to maintain good health? Nature's Bounty® is here...General WellnessFeel better in your skin",
    "Bone & JointNature's Bounty® bone and joint supplements provide nutrients that support strong and...Bone & JointFeel better in your skin",
    "EnergyEnergyFeel better in your skin",
    "EyeNature’s Bounty® supplements for eye health give you the nutritional support you...EyeFeel better in your skin",
    "HeartFrom Fish Oil to Co Q-10, Nature's Bounty® offer a range of supplements to...HeartFeel better in your skin",
    "Immune SupportAntioxidants may help fight free radicals in the body and assist in...Immune SupportFeel better in your skin",
    "GutGet More from your digestive supplements with Nature’s Bounty®. We offer a...GutFeel better in your skin",
    "HerbalHerbs have useful properties and may offer plant-based support for your healthy...HerbalFeel better in your skin",
    "Women's HealthEvery woman deserves to feel her best. That’s why Nature’s Bounty® offers...Women's HealthFeel better in your skin",
    "Kid's HealthNature's Bounty® offers a wide range of vitamin gummies from multi-vitamins that...Kid's HealthFeel better in your skin",
    "Biotin, Ultra Strength, 10,000 mcg, Softgels45 SoftgelsBiotin, Ultra Strength, 10,000 mcg, Softgels",
    "Extra Strength Hair, Skin & Nails, Gummies80 GummiesExtra Strength Hair, Skin & Nails, Gummies",
    "Vitamin D3, 1000 IU, Value Size, 250 Softgels250 SoftgelsVitamin D3, 1000 IU, Value Size, 250 Softgels",
    "Maximum Strength Melatonin, 10 mg60 TabletsMaximum Strength Melatonin, 10 mg",
    "Melatonin Gummies, Helps Reset Sleep-wake Cycle60 GummiesMelatonin Gummies, Helps Reset Sleep-wake Cycle",
    "Magnesium Plus Electrolytes, 500 mg, Tablets150 TabletsMagnesium Plus Electrolytes, 500 mg, Tablets",
    "Gentle Iron 28 mg, Helps Prevent Anemia, Capsules150 CapsulesGentle Iron 28 mg, Helps Prevent Anemia, Capsules",
    "Calcium With D3 & Zinc, Gummies60 GummiesCalcium With D3 & Zinc, Gummies",
    "Milk Thistle, 1000 mg, 200 Softgels200 SoftgelsMilk Thistle, 1000 mg, 200 Softgels",
    "Oil Of Oregano, 1500 mg, Source Of Antioxidants90 SoftgelsOil Of Oregano, 1500 mg, Source Of Antioxidants",
    "Turmeric Curcumin Plus Black Pepper, 1000 mg45 CountTurmeric Curcumin Plus Black Pepper, 1000 mg",
    "Hair, Skin & Nails Advanced, Tablets90 TabletsHair, Skin & Nails Advanced, Tablets",
    "Explore our Best Sellers",
    "Take the Quiz",
    "These products may not be right for you, always read and follow the label.For detailed information about our privacy practices, we encourage you to read ourPrivacy PolicyAll trademarks are owned by Société des Produits NESTLÉ S.A Vevey. Switzerland and used under licence©2025 NESTLÉ®",
    "Have questions?Email us atconsumer.care@ca.nestle.comor call us at1-800-565-1871. Visit ourContact Uspage for additional info.Nestle Canada Inc.25 Sheppard Ave. W.North York, ON. M2N 6S8Canada",
    "Privacy policy",
    "Terms of service",
    "Shipping policy",
    "Refund policy",
    "Cookie Notice",
    "Payment methods",
    "Choosing a selection results in a full page refresh.",
    "Opens in a new window.",
    "Information we collect about you",
    "Manage Consent Preferences",
    "Performance Cookies",
    "These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.",
    "Targeting Cookies",
    "These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.",
    "Cookie List",
    "checkbox label",
    "Leg.Interest"
  ]
}