{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescaf%C3%A9/story",
    "category": "About",
    "title": "Nescafe - Story",
    "n_tokens": 379,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Our Coffees",
    "80 Degrees",
    "Rich",
    "GOLD",
    "Sweet & Creamy",
    "Taster's Choice",
    "The NESCAFÉ Story",
    "Recipes NESCAFÉ",
    "Understanding Coffee",
    "Great coffee since 1938",
    "Our coffee specialist, Max Morgenthaler, was on a mission to create a delicious cup of coffee simply by adding water. There was a growing surplus of coffee beans in Brazil as a result of the Wall Street Crash of 1929. Nestlé saw an opportunity to help preserve coffee supply.",
    "Max and his team worked hard to find a new way to make instant coffee that would retain the coffee’s original flavour. In 1938, they found the answer, and NESCAFÉ was born.",
    "The NESCAFÉ brand is born",
    "Named by using the first three letters in Nestlé and suffixing it with ‘café’, NESCAFÉ became the new name in coffee.",
    "Instant Success!",
    "Making coffee had never been this fast and easy. During WWII NESCAFÉ became a staple food ration for US forces. (Pictured) A Swiss newspaper advert highlights the speed and ease of making a NESCAFÉ.",
    "On Top of the World",
    "During their record-breaking expedition to Mount Everest in 1953, Edmund Hillary and Tenzing Norgay, bring a trusty little tin of NESCAFÉ.",
    "The Founding Factory",
    "This factory in Orbe, Switzerland has been producing our products since we started it all back in 1938.",
    "Classy Glass",
    "In 1961, we launched our first glass jar, in Japan. It was a huge success and helped position NESCAFÉ as a premium product.",
    "Going for Gold",
    "We launched NESCAFÉ Gold, a classic premium blend, in Germany, France and the UK in the mid-1960’s.",
    "To the Moon and Back",
    "The first coffee to land on the moon. NESCAFÉ joined the crew of Apollo 11, Neil Armstrong, Buzz Aldrin and Michael Collins, in their pioneering mission in 1969.",
    "Developing Conscious Coffee",
    "In 2010, we started to focus on more sustainable development and created the NESCAFÉ Plan. It’s a way to help coffee farmers make a better living; support local communities; inspire the next generation of farmers; and do so without damaging our planet.",
    "Today",
    "The world’s favourite coffee. NESCAFÉ is enjoyed in over 180 countries. Our coffee isgrown,madeandpackagedin a way that respects the environment and the people who farm our coffee beans.",
    "Stay connected",
    "Follow us on our social media accounts to get even more tasty content."
  ]
}