{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescaf%C3%A9/faq",
    "category": "Support",
    "title": "Nescafe - FAQ",
    "n_tokens": 1541,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Our Coffees",
    "80 Degrees",
    "Rich",
    "GOLD",
    "Sweet & Creamy",
    "Taster's Choice",
    "The NESCAFÉ Story",
    "Recipes NESCAFÉ",
    "Understanding Coffee",
    "Frequently Asked Questions",
    "Ingredients",
    "What ingredients are in NESCAFÉ instant coffee and decaffeinated instant coffee?",
    "What is the caffeine content for all of your NESCAFÉ products?",
    "Are NESCAFÉ products gluten-free?",
    "Are the NESCAFÉ Sweet and Creamy sachets vegan or vegetarian?",
    "Are any NESCAFÉ coffees Kosher?",
    "What decaffeination process do you use?",
    "What is the meaning of \"artificial flavoring\" on the label of NESCAFÉ Rich Hazelnut?",
    "Why do you use acesulfame-potassium in NESCAFÉ Rich Hazelnut flavor?",
    "What are Arabica beans?",
    "What are Robusta beans?",
    "Do farmers use a lot of pesticides on the coffee beans? Do you test for glyphosate residues?",
    "Our pure roast and ground and instant coffees are both made from a single ingredient: green coffee.",
    "Green coffees are seeds of coffee cherries grown on coffee trees. That means that our pure roast and ground, and instant coffees are both natural food products. If any other flavours or ingredients are added to an instant coffee product, it would be indicated on the package. For example, a flavour-added instant coffee would be named FLAVOURED INSTANT COFFEE. We follow the Canadian Food Inspection Agency’s strict guidelines when labeling our pre-packaged food products.",
    "A serving size is typically one rounded teaspoon. This guide shows approximately how much caffeine is present in a typical 6oz serving of prepared coffee. Amount is in milligrams.",
    "NESCAFÉ Colombian: 80-100 mgNESCAFÉ Decaf: > 5 mgNESCAFÉ Espresso: 90–110 mgNESCAFÉ Dark Roast: 60–80 mgAll NESCAFÉ SSOD/Single Serve on Demand coffee products (capsules): 80–100 mg",
    "If there are no gluten sources listed in the ingredient list (wheat, rye, barley, triticale, oat) then a product does not contain gluten. We recommend that you always check the label on your packaging to get the most up-to-date information.",
    "NESCAFÉ Sweet & Creamy products are not vegetarian or vegan as they contain milk products.",
    "NESCAFÉ Taster's Choice 100g jars, Classic and Decaf are not Kosher certified. For that reason, they do not have the Kosher certified symbol on the package. The reason they are no longer certified Kosher is because we switched manufacturing locations and the new location is not Kosher approved at this time.",
    "All NESCAFÉ decaf coffees are decaffeinated using water to remove the caffeine from the beans. If you have additional questions regarding our decaf coffee, here are some answers to our most frequently asked questions:https://www.madewithnestle.ca/nescafe-decaffeination-process",
    "It is artificial, meaning that the source of flavour materials is not from a hazelnut but synthetic. It also means that the product does not contain hazelnut for people with nut allergies.",
    "The acesulfame-potassium is an approved Health Canada ingredient. It enhances the hazelnut flavour to provide a great sensory profile of coffee and hazelnuts.",
    "70% of the world’s coffee",
    "Prone to disease & pests which makes it difficult to grow",
    "Grown at altitudes over 2000 ft above sea level",
    "More flavourful & aromatic",
    "Higher priced than Robusta",
    "Half the caffeine of Robusta",
    "Smaller rounder beans",
    "Easier to grow, greater resistance to disease & pests",
    "Tolerant to higher temperatures and wetter climates",
    "Grown at 300 - 800 ft above sea level",
    "Grows faster and yields bigger crops",
    "Edgy, more powerful flavour",
    "Less fragrant",
    "We always make sure that the quality and safety of our products is our top priority. We begin by carefully selecting our ingredients and raw materials.",
    "That includes strict quality assurance measures to control and verify pesticide residues.",
    "Our standards guarantee that we’re in line with all Canada, US and EU regulatory requirements. We are always closely following innovative scientific and regulatory developments to maintain our high quality and food safety standards.",
    "Nestlé carries out more than 6 million food safety analyses per year, and that includes testing for glyphosate residues.",
    "Use and Storage",
    "What is the shelf life of NESCAFÉ products after the container is open?",
    "I just opened my NESCAFÉ Taster's Choice Coffee canister and it's only half full. Why is that?",
    "Can I put my NESCAFÉ Taster's Choice in the fridge or freezer?",
    "What is the general shelf life of Ice Java? How should it be stored?",
    "Which machine are the coffee pods compatible with?",
    "Opened NESCAFÉ products are still safe to drink up to the Best Before date on the packaging. The shelf life is maintained as long as the product is stored securely closed in a cool dry place.",
    "NESCAFÉ Taster’s Choice granules can settle during shipping, which makes the canister appear less full. Each canister is filled to an average weight in excess of the guarantee. The Quality Assurance team at our plant also makes sure that the fillers are functioning properly by checking the final weight of each of our canisters before they leave our manufacturing facilities.",
    "We recommend storing opened coffee in a cupboard, or pantry. It's best to store it in a cool dry place with the lid tightly closed. If the product is stored correctly, the contents should last from 4-6 weeks.",
    "It can be refrigerated however, freezing is not recommended.",
    "The shelf-life of Ice Java Cappuccino is 18 months.",
    "Once it’s opened, Ice Java can be left ambient or stored in the refrigerator. If you refrigerate the product, you may notice some sugar crystallization.",
    "Our pods work with all Keurig machines.",
    "Comparing NESCAFÉ products",
    "Is there a difference between NESCAFÉ Tasters Choice and NESCAFÉ Gold?",
    "What is the difference between NESCAFÉ Rich and NESCAFÉ Taster's choice?",
    "What is the difference between NESCAFÉ Sweet & Creamy and NESCAFÉ RICH?",
    "Is there any difference between the NESCAFÉ Gold Espresso in Canada and the NESCAFÉ Gold Espresso Italy?",
    "What is the difference between spray dried coffee and freeze dried coffee?",
    "There is! The main difference between NESCAFÉ Tasters Choice and NESCAFÉ Gold is the Microgrind process. That means we take Arabica beans and grind them 10 times finer than regular coffee. This process makes for a more full-bodied coffee experience.",
    "If you aren't a fan of the microgrind, we still have options that we think will suit your taste. We recommend trying NESCAFÉ Taster's Choice coffee because it doesn't have the grinds at the bottom and will be a lighter cup of coffee.",
    "The main difference is that NESCAFÉ Rich is spray dried coffee and NESCAFÉ Taster's Choice is freeze dried. This is the technical process that goes into producing the coffee and that is why the granules appear different. Freeze dried is considered to be more premium and high quality, which is why NESCAFÉ Taster's Choice is more expensive than NESCAFÉ Rich.",
    "NESCAFÉ Sweet & Creamy is a blend of beans from Brazil, dark roasted similar to NESCAFÉ Rich. NESCAFÉ Sweet and Creamy is all in one solution, with coffee, cream and sugar. NESCAFÉ Rich is a line-up of black and flavoured coffees.",
    "Both products are made at the same facility, so you can enjoy the same familiar taste whether you’ve purchased it in Canada or Italy!",
    "An important step in theNESCAFÉprocess is drying the coffee. During this step we lock in the flavour ensuring it is perfectly preserved until it is ready to be consumed. There are two methods used to dry the coffee: spray drying and freeze drying.",
    "When we spray dry the coffee, we use heat to evaporate the water from the coffee. This is done very quickly in a tower by spraying the coffee into warm air. This results in coffee with a darker color and texture likeNESCAFÉRich. We can also freeze dry the coffee. In this case we freeze the coffee, which separates water from the coffee solids and turns it into ice crystals that contain only pure water. We then carefully remove the ice crystals using a process called sublimation which turns them from a solid directly to a gas. This process is very gentle and preserves the finest quality of our premium coffees likeNESCAFÉGold.",
    "Packaging",
    "Are NESCAFÉ jars recyclable?",
    "What are the recycling numbers for the material used for the lids of NESCAFÉ Gold and NESCAFÉ Taster's Choice?",
    "Are the pods recyclable?",
    "Are the ingredients in the NESCAFÉ jar foil freshness seals safe?",
    "Yes, they are. We also encourage you reuse it for other purposes.",
    "Both lids are PP (Polypropylene): number 5 material This information is mentioned on the lids’ inner surface.",
    "Yes, the pods are recyclable anywhere where plastic #5 is accepted. However, because each local municipality has its own bylaws around recycling programs, you should consult your local recycling guide, or reach out to your local Municipality directly to see if they're currently recycling plastic #5.",
    "We provide steps for proper recycling on all of our packaging.",
    "The materials used in our seals are food-grade approved by Health Canada, so they're safe for food contact.",
    "Where NESCAFÉ is made",
    "Where are your products made?",
    "Where are the pods manufactured?",
    "NESCAFÉ products are made in various countries: Canada, USA, UK, France, Brazil, Germany, Hungary, Spain, Poland, Japan and Korea.",
    "All pods are manufactured in the USA.",
    "Can’t find what you’re looking for?",
    "Contact us through our website and we’ll get back to you. Alternatively, drop us a message through one of our social media accounts. We’re here to help whatever your coffee need.",
    "Stay connected",
    "Follow us on our social media accounts to get even more tasty content."
  ]
}