{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescaf%C3%A9/sustainability",
    "category": "Sustainability",
    "title": "Nescafé Make your world - Sustainability",
    "n_tokens": 220,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-01/supporting-farmers.jpg",
        "role": "secondary",
        "alt": "Supporting farmers"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-01/regenerative-agriculture.jpg",
        "role": "secondary",
        "alt": "Regenerative Agriculture"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-01/rainforest-alliance.jpg",
        "role": "secondary",
        "alt": "Rainforest Alliance"
      }
    ]
  },
  "text": [
    "Our Coffees",
    "80 Degrees",
    "Rich",
    "GOLD",
    "Sweet & Creamy",
    "Taster's Choice",
    "The NESCAFÉ Story",
    "Recipes NESCAFÉ",
    "Understanding Coffee",
    "Make Your World",
    "Using our global scale for good. One cup at a time.",
    "Small cup. Big impact.",
    "We work with coffee farmers to help enhance their resilience to climate change, improve their incomes, and build stronger communities. Because we believe everyone deserves a chance to make their world.",
    "Supporting Farmers",
    "How we’re helping coffee farmers transition to more sustainable practices.",
    "Regenerative Agriculture",
    "Regenerative agriculture is an approach to farming that aims to improve soil health and soil fertility – as well as protect water resources and biodiversity. Through these practices, we aim to make your coffee more sustainable for the future.",
    "Partnering with others",
    "We’re proud to partner with organizations with knowledge and expertise for us to evaluate, improve, and adapt our activities to bring long-term benefits to hundreds of thousands of coffee farmers. The Rainforest Alliance helps us make sure we’re seeing visible results in our field programs. We work with 4C to help build a more sustainable supply chain and improve farmer livelihoods.",
    "Our progress so far",
    "We’re committed to Nescafé Plan 2030 and are cultivating a difference with every cup. Read about our progress so far and our goals for the future.",
    "See 2022 Progress ReportNescafé Plan 2030"
  ]
}