{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescaf%C3%A9/coffee-tasting",
    "category": "Product",
    "title": "Nescafe - Coffee Tasting",
    "n_tokens": 451,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Our Coffees",
    "80 Degrees",
    "Rich",
    "GOLD",
    "Sweet & Creamy",
    "Taster's Choice",
    "The NESCAFÉ Story",
    "Recipes NESCAFÉ",
    "Understanding Coffee",
    "Coffee Tasting",
    "Why do we use professional coffee tasters?",
    "Coffee has so many complex tastes and aromas. It takes years of practice and experience to identify and judge a coffee’s different flavours and smells correctly and consistently.",
    "Professional tasters are the only way to guarantee quality and consistency. Highly trained tasters will all closely agree on the exact characteristics of any coffee they taste which is critical for delivering a consistent flavour to our customers.",
    "How we ensure NESCAFÉ quality",
    "After the harvest",
    "Coffee cherries are milled to get rid of the outer fruit as well as the parchment-like skin around the bean. The end result is called green coffee. Quality-control is vital at this stage.",
    "Before the coffee is shipped",
    "Our network of six specialist quality-control centres make sure the coffee has been stored and handled to high standards. Professional tasters test the quality of our coffee.",
    "In our factories",
    "There are professional tasting teams in every NESCAFÉ plant. Satisfying their expert taste buds is the last of many quality tests that help guarantee the fresh, delicious taste of every mug of NESCAFÉ.",
    "The language of coffee tasting",
    "Talking coffee",
    "Experts in the coffee-tasting profession use a book called the Sensory Lexicon. It’s an insider’s guide to the strength of the different flavours in coffee listing more than 100 different flavours. They are organised into groups such as:",
    "Floral, spices, sweet, cocoa",
    "Fruity, green/vegetative",
    "Roasted, cereal, nutty",
    "Each group includes many flavours. For example, the “sweet” group includes molasses, maple syrup, brown sugar, caramelised, honey and vanilla.",
    "Judging coffee",
    "Coffee tasters use the Sensory Lexicon to describe subtle differences in coffee. Tasters can detect if the way the coffee was grown, milled and roasted has affected the final flavour. From the soil the tree was planted in, to the way it was watered, to the bag the beans were stored in, many factors can change flavour.",
    "How the pros taste coffee",
    "Professional tasters use a technique called “cupping” to identify the complex tastes and aromas in coffee. This includes:",
    "Le Nez du Café Aroma. Appreciating the 36 basic scents found in coffee aroma.",
    "Sensory skills. Judging the strength of tastes like sweet, sour and bitter.",
    "Peer calibration. Blind-tasting coffee so you can match the judgment of experienced tasters.",
    "From farm to cup",
    "Coffee tasters consider the entire coffee journey including:",
    "The agriculture and science of coffee",
    "How coffee is stored, milled and roasted",
    "How has handling affected the final quality",
    "Coffee Origins",
    "Learn more",
    "Grown Respectfully",
    "Explore",
    "Stay connected",
    "Follow us on our social media accounts to get even more tasty content."
  ]
}