{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescafe-decaffeination-process",
    "category": "Product",
    "title": "NESCAFÉ Decaffeination Process",
    "n_tokens": 891,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "NESCAFÉ Decaffeination Process",
    "Thursday, May 02, 2024",
    "We understand the importance of offering decaffeinated coffee that meets the highest standards of quality, taste, and safety.That’s why all of our NESCAFÉ decaf coffees are decaffeinated using only water to extract the caffeine from the coffee beans.",
    "We offer a range of decaf coffees in our NESCAFÉ line, including:",
    "NESCAFÉ Taster’s Choice Decaf",
    "NESCAFÉ Rich Decaf",
    "NESCAFÉ Gold Espresso Decaf",
    "The method of using water as the decaffeination agent is known as the Swiss Water process. In opting to use water as the only decaffeination agent for our NESCAFÉ coffees, we don’t use any chemicals or additives in our decaffeination process, ensuring only the most natural cup of coffee is in our NESCAFÉ jars.",
    "We know the importance of understanding exactly what you’re consuming, so here's an overview of how we decaffeinate our NESCAFÉ coffees using only water to ensure the removal of caffeine, while preserving the quality and flavour:",
    "1 - Coffee beans are immersed in a flow of hot water to extract the caffeineAll of our NESCAFÉ instant coffees and decaffeinated instant coffees are made from one ingredient and one ingredient only: green coffee (the seeds of coffee cherries grown on coffee trees). Green coffee beans are immersed in a flow of hot water, expanding them, and allowing the water to penetrate the beans to extract the caffeine, since caffeine is soluble in water.",
    "2 - The decaffeinated coffee beans are driedOnce the caffeine has been extracted from the coffee beans using water, the coffee beans are dried using hot air that evaporates the water used in the previous process. Once the usual moisture of coffee beans is recovered, the result is a coffee bean with a fraction of the caffeine. The coffee beans retain the same properties of flavour and feel as regular coffee beans, however, a typical cup of NESCAFÉ decaffeinated coffees have less than 0.3% or 5 mg of caffeine per serving, compared to between 70 – 140mg in a cup of regular coffee. From this moment on, the coffee beans are ready for roasting, following the same method as regular coffee, which gives rise to NESCAFÉ decaffeinated coffee.",
    "By using water to decaffeinate our NESCAFÉ coffees, we’re reaffirming our commitment to ensuring all of our ingredients and products meet your expectations of quality, health, and taste. Consumers who want to enjoy a cup of coffee without the caffeine, can enjoy any of our NESCAFÉ decaf coffees for a rich and indulgent cup that retains the natural flavours and characteristics of regular coffee. Visit our NESCAFÉ page to browse our decaf line and find it in stores near you.",
    "If you have additional questions regarding our decaf coffee, here are some answers to our most frequently asked questions:",
    "1. Are there any health risks associated with consuming decaf coffee?",
    "Decaf coffee is considered safe for consumption and does not pose significant health risks for most individuals. However, while decaf coffee contains significantly less caffeine than regular coffee, it still contains a small amount. Individuals who are highly sensitive to caffeine may still experience mild effects such as increased heart rate or sleep disturbances. It's advisable for those with caffeine sensitivity to monitor their intake and consult with a healthcare professional if necessary.",
    "2. Why isn’t this on the label?",
    "Our decaffeination process is not mentioned on the label due to limited space constraints. The primary purpose of a product label is to provide essential information such as ingredients, nutritional facts, and potential allergens. While the decaffeination process is an important aspect of our product, it does not impact the overall composition or quality. Moreover, since NESCAFÉ coffees are decaffeinated using only water, without any chemical additives, there is no need to declare water in the ingredients list or as the method of decaffeination anywhere on the label. If chemical additives were used for decaffeination, they should be declared. Rest assured, our decaffeinated products undergo rigorous testing and adhere to industry standards to ensure the removal of caffeine while maintaining taste and quality, as well as prioritizing our consumers’ health.",
    "3. Can the decaffeination process alter the aroma or flavour profile of the coffee?",
    "The Swiss Water decaffeination process is one of the most gentle processes for removing caffeine, ensuring most of the original aroma and flavour of the coffee is preserved. However, in the process, some compounds responsible for flavour can be slightly reduced. You may find that our decaffeinated coffees are a little more mild with slightly lower acidity and bitterness. However, flavour will still vary by product due to the blend and roasting process.",
    "4. Are there any additional steps taken to ensure the removal of other impurities during the decaf process?",
    "Because we use only water to decaffeinate our coffee, impurities are not introduced during the decaffeination process.",
    "5. How does this method of decaffeination compare to others in terms of sustainability?",
    "Swiss Water decaffeination is an eco-friendly process. It avoids the use of chemicals making it more eco-friendly than methods that rely on solvents. In addition, we use a closed-loop system in which we recycle caffeine free extract and recover water for re-use. This reduces water consumption and waste generation, making it a more sustainable process.",
    "Did you find this answer helpful?",
    "Thank you for letting us know!",
    "Article feedback",
    "I need more details"
  ]
}