{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescafe/nescafe-sweet-creamy-iced-original-instant-coffee-mix",
    "category": "Product",
    "title": "NESCAFE Sweet & Creamy Iced Original Instant Coffee Mix",
    "n_tokens": 339,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-09/iced-coffee.png",
        "role": "secondary",
        "alt": "NESCAFE Sweet & Creamy Iced Original Instant Coffee Mix"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/iced.png?itok=fx8kDpaO",
        "role": "secondary",
        "alt": "Nescafé rich iced"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/caramel.png?itok=K93J-MgV",
        "role": "secondary",
        "alt": "Nescafé rich caramel"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/intense_0.png?itok=VK1blAbc",
        "role": "secondary",
        "alt": "Nescafé intense"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-05/rich-instant-tin.png?itok=VKsiZHcV",
        "role": "secondary",
        "alt": "NESCAFÉ Rich Instant Coffee"
      }
    ]
  },
  "text": [
    "NESCAFE Sweet & Creamy Iced Original Instant Coffee Mix",
    "Description",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "NESCAFÉ Sweet & Creamy Instant Iced Coffee Mix makes a deliciously sweet and creamy tasting cup of iced coffee! Part of a range of all-in-one instant coffees, NESCAFÉ Sweet & Creamy Instant Iced Coffee sachets are perfectly prepared each time, as each single-serve sachet includes the ideal amount of coffee, whitener, and sugar. To prepare, empty one instant coffee sachet into a mug, add cold water and ice, and stir to enjoy a consistently delicious and creamy tasting cup of iced coffee. NESCAFÉ Sweet & Creamy Instant Iced Coffee Mix has a smooth, creamy coffee taste and a rich coffee aroma – the perfect choice for home, office or on the go, so everyone can enjoy their favourite coffee anytime, anywhere. NESCAFÉ Sweet & Creamy Instant Iced Coffee Mix is made with 100% responsibly sourced coffee. NESCAFÉ plans to continue helping 100,000+ coffee farmers with programs that aim to improve resilience to climate change. Find a moment of joy in your day with NESCAFÉ Sweet & Creamy.",
    "For Iced Coffee Lovers: NESCAFÉ Sweet & Creamy Iced Instant Coffee makes delicious iced coffee in an instant",
    "Instant Coffee, Coffee Whitener & Sugar Together: Each instant iced coffee sachet includes the ideal amount of coffee, whitener, and sugar for a delicious taste every time",
    "On-the-Go Convenience: Sweet & Creamy Instant Iced Coffee single-serve sachets are all you need for home or office, simply add cold water and ice for a great cup of iced coffee anytime, anywhere",
    "Delicious Iced Coffee: Each refreshing cup has a smooth and creamy coffee taste",
    "100% Responsibly Sourced Coffee: NESCAFÉ plans to continue helping 100,000+ coffee farmers with programs that aim to improve resilience to climate change",
    "Coffee Experts: Crafted by NESCAFÉ, an expert in coffee innovations",
    "Per 1 sachet (15 g)Amount% DVCalories60Fibre0g0%Sugars11g11%Carbohydrate12gFat0.4g1%Saturated Fat0.4g2%Protein1gSodium50mg2%Amount% DVCalcium0mg0%Iron0mg0%Potassium40mg1%",
    "Sugars (sugar, glucose syrup), Milk ingredients, Instant coffee, Coconut oil, Sodium phosphate, Salt, Natural and artificial flavour.",
    "Where to Buy",
    "You might be interested in"
  ]
}