{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nescaf%C3%A9/coffee-origins",
    "category": "Product",
    "title": "Nescafe - Coffee Origins",
    "n_tokens": 566,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Our Coffees",
    "80 Degrees",
    "Rich",
    "GOLD",
    "Sweet & Creamy",
    "Taster's Choice",
    "The NESCAFÉ Story",
    "Recipes NESCAFÉ",
    "Understanding Coffee",
    "Coffee Origins",
    "Where does coffee come from?",
    "At NESCAFÉ, we’ve put together this guide to help you learn about the different types of coffee beans, where they are grown, and the all-important roasting process.",
    "Coffee does not come from just one place. It’s grown in more than 50 countries across Africa, Latin America and Asia, known as “the coffee belt”. These areas have the right combination of altitude, soil and weather, providing the perfect climate for growing the most delicious beans.",
    "African coffee",
    "Thought to be some of the best in the world due to its wonderfully distinctive flavour, African coffee possesses the following characteristics:",
    "Syrupy",
    "Medium acidity",
    "Complex fruity notes",
    "Latin American coffee",
    "Universally enjoyed for its well-rounded taste, Latin American coffee makes up most of the blends found on supermarket shelves today. A few key characteristics are:",
    "Nutty",
    "Low acidity",
    "Fuller bodied",
    "Asian coffee",
    "Home to some of the most unique coffee blends with bold, unique flavourings unlike any other. Typically, you can expect Asian coffee to be:",
    "Earthy",
    "Gentle acidity",
    "Spicy",
    "Get to know your coffee beans",
    "It may surprise you to learn that coffee beans come from the fruit of the coffee plant (called “cherries”). The cherries are edible but taste absolutely nothing like coffee. In fact, they are mild and slightly sweet – a far cry from the rich and flavoursome coffee beans inside.",
    "There are over 120 varieties of coffee plants and each variety has its own distinct flavour. Most of the coffee we drink comes from either Arabica or Robusta coffee beans, or a blend of the two.",
    "Arabica coffee beans",
    "Known for its vibrant and complex flavours, Arabica is the most popular type of coffee bean because of its smooth and less acidic taste.",
    "There are two types of Arabica coffee bean, Typica and Bourbon. Typica (also known as Sumatra and Arabigo) is believed to be the first bean ever discovered (1,000 BC.). Bourbon is considered to be a natural mutation of Typica and offers a more balanced and slightly sweeter flavour.",
    "Commonly grown in Africa and Indonesia, these beans have a higher caffeine content and offer a deeper and stronger taste than the Arabica variety. A popular choice for espressos due to the rich flavour and layer of crema it gives. It is also widely used in instant coffee.",
    "Why is coffee roasted?",
    "Coffee roasting is the process of heating the beans to bring out the rich and aromatic flavour that we know and love. A chemical change occurs giving them a deep brown colour with a wonderfully earthy smell. Before roasting, the beans are green and have a grassy smell. After roasting, coffee beans are ready to be ground and brewed.",
    "Light Roasts",
    "A light roast coffee is higher in acidity, low in bitterness and can also highlight fruitiness and floral notes.",
    "Medium Roasts",
    "Medium roast coffee has a stronger flavour, more body, less acidity and can be the most fruity and sweet among roast types.",
    "Dark Roasts",
    "Dark roast coffee is the most intense and bitter and is far less acidic than other roast types. It can have a smoky or chocolatey sweet taste too.",
    "Coffee Tasting",
    "Learn more",
    "Grown Respectfully",
    "Explore",
    "Stay connected",
    "Follow us on our social media accounts to get even more tasty content."
  ]
}