{
  "metadata": {
    "url": "https://www.nestlebaby.ca/materna-maternal-supplements",
    "category": "Support",
    "title": "Materna Prenatal Supplements",
    "n_tokens": 1279,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.nestlebaby.ca/sites/default/files/styles/header_image_desktop/public/header_image/materna_2024_webbanner_desktop_1920x560.jpg?h=d47b79af&itok=WwF19i4Z",
        "role": "secondary",
        "alt": "Materna® Maternal Supplements"
      },
      {
        "url": "https://www.nestlebaby.ca/sites/default/files/styles/image_mobile/public/generic_image/materna-maternal-supplements.png?itok=jullcYcV",
        "role": "secondary",
        "alt": "Materna Maternal Supplements"
      },
      {
        "url": "https://www.nestlebaby.ca/sites/default/files/styles/card_white_detailed_product_mobile_grid/public/card_image/materna_2024_web_productp_desktop_640x480-01.jpg?itok=xQwG-DLf",
        "role": "secondary",
        "alt": "Materna Prenatal Vitamins"
      },
      {
        "url": "https://www.nestlebaby.ca/sites/default/files/styles/card_white_detailed_product_mobile_grid/public/product/materna-gummies-product-push-en.jpg?itok=il0l1Ajk",
        "role": "secondary",
        "alt": "Materna Prenatal Gummies"
      },
      {
        "url": "https://www.nestlebaby.ca/sites/default/files/styles/card_white_detailed_product_mobile_grid/public/card_image/materna_2024_web_productp_desktop_640x480-06.jpg?itok=7-zeBD77",
        "role": "secondary",
        "alt": "Materna® Prenatal | Multivitamins"
      }
    ]
  },
  "text": [
    "Scroll to top",
    "Skip to main content",
    "Skip to footer",
    "Menu",
    "Close",
    "Register",
    "Need Help?",
    "Support Hub",
    "Clear search input",
    "About Nestlé Baby & meBackAbout Nestlé Baby & me",
    "StagesBackStagesYour child's development, every step of the way.Getting PregnantPregnancy0-6 months6-8 months8-12 months12+ months",
    "TopicsBackTopicsFind advice and answers to some of parenthood's biggest questions.View all articlesPreparing for BabyPregnancy Diet & ExerciseBreastfeeding SupportInfant NutritionToddler NutritionGrowth & DevelopmentCrying & Colic ReliefSleepAllergiesParenting Support",
    "BrandsBackBrandsExplore nutritional brands that support you and your child’s overall growth and development.Materna®Gerber®Cerelac®NIDO®",
    "ProductsBackProductsDiscover our best nutritional offerings for you and your little one.View all productsMATERNA® Prenatal VitaminsGERBER® Baby SupplementsNIDO® Nutritional Toddler DrinkGERBER® Baby & Toddler CerealsGERBER® PuréesGERBER® SnacksGERBER® MealsCerelac™ Toddler Cereal",
    "ToolsBackToolsEnjoy all our parenting tools in one place.Ovulation CalculatorPregnancy Due date calculatorPregnancy Weekly CalendarBaby Name GeneratorRecipesChecklists finder",
    "QuizBackQuiz",
    "Join us",
    "Country - Language",
    "Materna Maternal Supplements: Nourish Yourself and Support a Healthy Pregnancy",
    "#1 DOCTOR RECOMMENDED* BRAND OF PRENATAL MULTIVITAMINS**",
    "Together for the big adventure.",
    "Becoming a mom is life’s biggest adventure. From preconception through pregnancy to after birth and breastfeeding, everything you do today can positively impact your baby’s lifelong health.",
    "As the #1 brand in Prenatal Multivitamins* and the #1 doctor recommended brand, we want to give you and your baby only the best, our products are crafted by the latest science and inspired by our deep understanding of maternal needs. Our ambition is to provide the best prenatal vitamins for your health at every stage of motherhood - when trying to conceive, during pregnancy, post pregnancy and/or during breastfeeding.",
    "*Claim based on IQVIA L52W period ending in Dec 2023.",
    "Let Materna take care of you before, during and after pregnancy and birth.",
    "#1 Prenatal Multivitamin brand in Canada*",
    "#1 Doctor Recommended**",
    "Contains 100% Daily Folic Acid & Vitamin D***",
    "Non-GMO & Vegetarian****",
    "Previous",
    "Next",
    "Discover Materna®Prenatal Multivitamin range of products",
    "View details   Materna® Prenatal | Multivitamins+DHA | Tablet + Softgel",
    "Materna®Prenatal | Multivitamins+DHA | Tablet + Softgel",
    "With 100% of the recommended daily folic acid and Vitamin. Contains DHA to help support cognitive and brain … and more!",
    "Buy now",
    "View details   Materna® Prenatal | Multivitamins+DHA | Gummies",
    "Materna®Prenatal | Multivitamins+DHA | Gummies",
    "With Folic acid to help reduce risk of neural tube defects*. Contains DHA to help support cognitive and brain function … and more!",
    "View details   Materna® Prenatal | Multivitamins | Tablets",
    "Materna®Prenatal | Multivitamins | Tablets",
    "With 100% of the recommended daily folic acid and Vitamin D. Helps support early fetal development. Helps … and more!",
    "See more results",
    "Trending articles",
    "Article",
    "Prenatal multivitamins and folic acid for pregnancy",
    "A lack of folic acid during pregnancy leads to higher risk of neural tube defects in the baby. Learn about supplementing with folic acid and how much you need.",
    "4 mins to read",
    "Read now",
    "A Good Pre-Conception, Pregnancy, and Post-Pregnancy Diet",
    "Even before you conceive, every bite counts. Wait, that’s a lot to consider, right? Don’t worry, this healthy eating breakdown serves up diet information that will matter to you.",
    "6 mins to read",
    "Gestational diabetes symptoms",
    "10 essential questions about gestational diabetes answered",
    "Healthy pregnancy diet: What to eat and avoid",
    "A healthy, well-balanced diet is beneficial for you and the baby growing in your belly, but some nutrients are critical for the healthy growth and development of your baby.",
    "8 mins to read",
    "How to exercise safely through pregnancy",
    "Why 30 minutes a day can impact a lifetime.",
    "Footnotes",
    "*Claim based on Nielsen MarketTrack L52W period ending October 9 2021 for National Grocery, Drug, Mass Merchandisers.",
    "**Over-the-counter prenatal multivitamin brand. Provoice research 2020. Data on file",
    "‡LC40TMis distributed under license by Biosearch S.A.",
    "1Hurtado JA et al. (2017) Oral Administration to Nursing Women of Lactobacillus fermentum CECT5716 Prevents Lactational Mastitis Development: A Randomized Controlled Trial. Breastfeeding Medicine. 12(4):202-09.",
    "2Maldonado-Lobòn JA et al. (2015) Lactobacillus fermentum CECT5716 Reduced Staphylococcus Load in the Breastmilk of Lactating Mothers Suffering Breast Pain: A Randomized Controlled Trial. Breastfeeding Medicine. 10(9):425-32.",
    "3Arroyo R et al. (2010) Treatment of Infectious Mastitis during Lactation: Antibiotic versus Oral Administration of Lactobacilli Isolated from Breast Milk. Clinical Infectious Disease. 50(12):1551-1558.",
    "Eat today for their tomorrow. Each daily tablet of Materna®contains folic acid to help prevent neural tube defects, and 22 essential vitamins and minerals to support you during your pregnancy.",
    "Your parenting instincts, our support",
    "SIGN UP & GET A CHANCE TO WIN",
    "Sign up for Nestlé Baby & me and automatically be entered for a chance to win a $100* gift card!",
    "For full details, please visit theTerms & Conditions.",
    "PERSONALIZED EMAILS & SUPPORT",
    "Receive customized emails with useful info, special offers, & more to help guide you through each parenting phase.",
    "HELPFUL TOOLS & RESOURCES",
    "Get access to our helpful and interactive parenting tools & resources in one convenient hub.",
    "EXPERT GUIDANCE",
    "We offer science-based advice & specialized nutritional guidance for every stage of the parenting journey—from preconception to toddlerhood.",
    "Discover more",
    "Register Here",
    "Still haven't found what you are looking for?",
    "open assistant",
    "close assistant",
    "Cookie",
    "Find the right product with our product finder",
    "Have a question?Check our FAQContact us",
    "Feedback",
    "Enjoy experts advice, exclusive offers and more!",
    "Discover your tailored content. Define your interests and access to your personalized contents page.",
    "Looking for inspiration on what to feed your little one?",
    "Change Country",
    "Nido",
    "SupportSupport HubLegalPrivacy policy",
    "Club infoFAQNestlé.caTerms & Conditions",
    "All trademarks are owned by Société des Produits Nestlé, S.A. or used with permission. © 2022. All rights reserved.",
    "Accessibility statement",
    "Sitemap",
    "Information we collect about you",
    "Manage Consent Preferences",
    "These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.",
    "Performance Cookies",
    "These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.",
    "Functional Cookies",
    "These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.",
    "Targeting Cookies",
    "These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.",
    "Social Media Cookies",
    "These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools.",
    "Cookie List",
    "checkbox label",
    "Leg.Interest"
  ]
}