{
  "metadata": {
    "url": "https://www.madewithnestle.ca/nestle-cookies-policy",
    "category": "Document",
    "title": "Nestlé Cookies Policy",
    "n_tokens": 1072,
    "n_tables": 1,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Nestlé Cookie Notice",
    "NESTLÉ CANADA INC. COOKIE NOTICE",
    "This cookie notice applies to all Nestlé Canada Inc. websites and mobile applications (“Nestlé Sites”).",
    "What are cookies?",
    "Cookies are text files that are placed on your computer by websites that you visit. Cookies are then sent back to the originating website on each subsequent visit, or to another website that recognises that cookie. They are used in order to make websites work, or work more efficiently, as well as to provide information to the owners of the website.",
    "We use the term \"cookies\" throughout this notice to also cover all similar technologies, such as web beacons SDK, log files, pixel tags.",
    "What types of cookies are used on Nestlé Sites?",
    "You may see what cookies are used on this website by clickinghere.",
    "We use the following types of cookies on Nestlé Sites:",
    "Cookie categories",
    "Lifespan",
    "Site functionality cookies",
    "These cookies allow you to navigate the site and use our features, such as registration, logging in and product favourites. If you disable these cookies certain parts of the website will not function for you, for example, adding items to your basket, proceeding to checkout.",
    "As long as necessary",
    "Site analytics cookies",
    "These cookies allow us to measure and analyse how you use our websites, apps and mobile platforms, to improve both its functionality and your experience.",
    "90 days",
    "Customer preference cookies",
    "When you are browsing on our sites, these cookies will remember your preferences (like your language or location), and other information you choose to provide to us, so we can help tailor your experience and make it more relevant and personal to you.",
    "Advertising or targeting cookies",
    "These cookies are used to deliver ads relevant to you. They also limit the number of times that you see an ad and help us measure the effectiveness of our marketing campaigns. We may also use the information obtained via these cookies to serve you with advertising that may be of interest to you based on your past online behaviour. We may share this information with other parties, including our partners.",
    "Social media cookies",
    "These cookies are used when you share information using a social media sharing button on a Nestle Site. The social network will record that you have done this. This information may be linked to targeting/advertising activities.",
    "Manage your cookie preferences",
    "You may access and change your cookie preferences at any time by clickinghere.",
    "You do not need to allow cookies to use or navigate through many parts of Nestlé Sites, although you may not have access to all the features on Nestlé Sites if you do not accept cookies. You should ensure that your device settings reflect your cookies preferences. You can also set your browser to warn you before accepting cookies or you set it to refuse them.",
    "Additionally, where available, you can opt-out of cookies by visiting the following sites:http://www.aboutads.info/choices/#completedorhttp://www.youronlinechoices.eu/",
    "Notice Update",
    "We reserve the right to make any changes and corrections to this Notice. Please refer to this page from time to time to review these and new additional information. We will place updates on Nestlé Sites and, where appropriate, we will notify of any changes by email.",
    "Privacy Policy",
    "For further information about how your data is used (including controller details), please see ourPrivacy Notice.",
    "This Cookie Notice was last updated 02/07/2022.",
    "[table] Cookie categories | Lifespan",
    "[table] Site functionality cookiesThese cookies allow you to navigate the site and use our features, such as registration, logging in and product favourites. If you disable these cookies certain parts of the website will not function for you, for example, adding items to your basket, proceeding to checkout. | As long as necessary",
    "[table] Site analytics cookiesThese cookies allow us to measure and analyse how you use our websites, apps and mobile platforms, to improve both its functionality and your experience. | 90 days",
    "[table] Customer preference cookiesWhen you are browsing on our sites, these cookies will remember your preferences (like your language or location), and other information you choose to provide to us, so we can help tailor your experience and make it more relevant and personal to you. | 90 days",
    "[table] Advertising or targeting cookiesThese cookies are used to deliver ads relevant to you. They also limit the number of times that you see an ad and help us measure the effectiveness of our marketing campaigns. We may also use the information obtained via these cookies to serve you with advertising that may be of interest to you based on your past online behaviour. We may share this information with other parties, including our partners. | 90 days",
    "[table] Social media cookiesThese cookies are used when you share information using a social media sharing button on a Nestle Site. The social network will record that you have done this. This information may be linked to targeting/advertising activities. | 90 days",
    "[table] Cookie categories | Lifespan",
    "[table] Site functionality cookiesThese cookies allow you to navigate the site and use our features, such as registration, logging in and product favourites. If you disable these cookies certain parts of the website will not function for you, for example, adding items to your basket, proceeding to checkout. | As long as necessary",
    "[table] Site analytics cookiesThese cookies allow us to measure and analyse how you use our websites, apps and mobile platforms, to improve both its functionality and your experience. | 90 days",
    "[table] Customer preference cookiesWhen you are browsing on our sites, these cookies will remember your preferences (like your language or location), and other information you choose to provide to us, so we can help tailor your experience and make it more relevant and personal to you. | 90 days",
    "[table] Advertising or targeting cookiesThese cookies are used to deliver ads relevant to you. They also limit the number of times that you see an ad and help us measure the effectiveness of our marketing campaigns. We may also use the information obtained via these cookies to serve you with advertising that may be of interest to you based on your past online behaviour. We may share this information with other parties, including our partners. | 90 days",
    "[table] Social media cookiesThese cookies are used when you share information using a social media sharing button on a Nestle Site. The social network will record that you have done this. This information may be linked to targeting/advertising activities. | 90 days"
  ]
}