{
  "metadata": {
    "url": "https://www.faitavecnestle.ca/recette/gulab-jamun",
    "category": "Recipe",
    "title": "Gulab Jamun",
    "n_tokens": 309,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/5c9107fb37a52f16ecadb5a30c3fcf52_gulab.PNG",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Gulab Jamun",
    "Ce dessert traditionnel est le centre d'attraction de chaque festival et occasion en Inde (en particulier Diwali). Ce délicieux dessert n'est pas seulement apprécié en Inde, mais aussi dans des pays comme le Népal, le Myanmar, le Pakistan, le Bangladesh et l'île Maurice. Ce plat sucré est délicieux et ajoute de l’esprit  à n'importe quel plateau de desserts - essayez-le pour votre prochaine célébration.",
    "Total time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "24\n\t\t\t\t\t\t\t\t\t\t\tPortions",
    "Skill level:",
    "Facile",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 tasse de farine autolevante",
    "Huile / ghee pour la friture",
    "1 cuillère à café de muscade moulue",
    "Pincée de cardamome en poudre",
    "1 tasse de sucre blanc granulé",
    "1,5 tasses d'eau",
    "1 cuillère à café d'essence de rose",
    "1 goutte de jus de citron",
    "2 tasses de sucre",
    "1 cuillère à café de cardamome en poudre",
    "3 cuillères à soupe de lait",
    "2 cuillères à soupe de ghee fondu",
    "Instructions",
    "préparer le sirop",
    "Porter le sirop à ébullition à feu moyen. Gardez le sirop légèrement plus liquide et coulant après sa réduction. Vous pouvez éteindre la cuisinière et la laisser sur la plaque chaude jusqu’à ce que vous soyez prêt à l’utiliser.",
    "Cuisine",
    "15 min",
    "Dans un bol, mélanger le ghee, le lait, la poudre de cardamome, la muscade et le lait concentré. Tamisez le klim et la farine auto-levante. Bien mélanger pour former une pâte molle.",
    "Préparation",
    "10 min",
    "Divisez la pâte en 24 morceaux et façonnez-la en boule ou en forme de doigt. Essayez de ne pas les rendre trop épaisses.",
    "Faire frire dans du ghee ou de l'huile à feu moyen jusqu'à ce qu'ils soient dorés et bien cuits. Vous devrez peut-être ajuster la chaleur pendant le processus de friture.",
    "Utilisez une cuillère trouée pour retirer de l'huile et placez-la dans le sirop immédiatement pour enrober.",
    "Garnir à votre envie.",
    "What you need",
    "How to prepare"
  ]
}