{
  "metadata": {
    "url": "https://www.madewithnestle.ca/parlour/vanilla-caramel-half-dipped-frozen-dessert-bars",
    "category": "Product",
    "title": "Vanilla Caramel Half Dipped Frozen Dessert Bars",
    "n_tokens": 334,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-04/parlour-vanilla-caramel.png",
        "role": "secondary",
        "alt": "parlour vanilla caramel bars pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-04/parlour-juicy-pops-mango-peach-cherry.png?itok=upUXfUWn",
        "role": "secondary",
        "alt": "parlour juicy pops mango peach cherry pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/nestle_product_covert-01-parlour-01-06.png?itok=F8c2-gWa",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2021-09/00055000893008_CF__PNG_Custom.png?itok=hf4yGYQ7",
        "role": "secondary",
        "alt": "PARLOUR French Vanilla"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/4065424_prlr_chcbna_1_5l_3d_eng.png?itok=2Pw34LoF",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "Vanilla Caramel Half Dipped Frozen Dessert Bars",
    "Delight in the decadent tastes and textures of PARLOUR Vanilla Caramel flavoured frozen dessert bars. These delicious frozen treats feature smooth, creamy vanilla flavoured frozen dessert on one side and sweet and light caramel flavoured frozen dessert on the other, all half dipped in a crackly, chocolatey coating. This feel good treat is 170 calories per serving and made with no artificial colours. Plus, the convenient share pack makes it easy to enjoy on the go or with family and friends. PARLOUR Vanilla Caramel half dipped frozen dessert bars are proudly crafted in Canada.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Vanilla Caramel Half Dipped Frozen Dessert BarsFeatures and Benefits",
    "Delicious Tastes & Textures: PARLOUR Vanilla Caramel bars have smooth creamy vanilla flavoured frozen dessert on one side, sweet and light caramel flavoured frozen dessert on the other, and are half dipped in a delicious, chocolatey crackle coating",
    "Indulgent: PARLOUR Vanilla Caramel half dipped bars are an indulgent frozen dessert treat",
    "Convenient & Shareable: This share pack of PARLOUR Vanilla Caramel frozen dessert bars is perfect on-the-go or for sharing with friends and family",
    "Feel Good Treat: These decadent frozen dessert bars are only 170 calories per serving and made with no artificial colours",
    "Crafted in Canada: PARLOUR Vanilla Caramel half dipped frozen dessert bars are proudly crafted in Canada",
    "A Canadian Favourite: PARLOUR is the quintessential Canadian ice cream",
    "Vanilla Caramel Half Dipped Frozen Dessert BarsNutrition Information",
    "Per 1 bar (80 ml)Amount% DVCalories170Carbohydrate20gDietary Fibre1g4%Sugars16g16%Fat10g13%Cholesterol5mgSaturated7g35%Trans Fat0gProtein2gSodium60mg3%Amount% DVCalcium50mg4%Iron0.5mg3%Potassium175mg5%",
    "Vanilla Caramel Half Dipped Frozen Dessert BarsIngredients",
    "Frozen dessert: Modified milk ingredients, Sugars (sugar, glucose, sweetened condensed milk, brown sugar), Coconut oil, Milk ingredients, Water, Mono- and diglycerides, Canola oil, Cellulose gum, Propylene glycol monostearate, Carob bean gum, Carrageenan, Salt, Sodium citrate, Soy lecithin, Potassium sorbate, Citric acid, Caramel colour, Annatto, Natural and artificial flavour. Coating: Coconut oil, Palm oil, Sugar, Cocoa, Modified milk ingredients, Milk ingredients, Unsweetened chocolate, Soy lecithin, Natural flavour.",
    "You might be interested in"
  ]
}