{
  "metadata": {
    "url": "https://www.madewithnestle.ca/quality-street/quality-street-holiday-gift-tin",
    "category": "Product",
    "title": "QUALITY STREET Holiday Gift Tin",
    "n_tokens": 534,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-08/00059800747790_A3N1_44348591_25.06.2024.png",
        "role": "secondary",
        "alt": "QUALITY STREET Holiday Gift Tin"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/kit-kat-hockey-stick.png?itok=yNbOarHC",
        "role": "secondary",
        "alt": "hockey stick bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/TURTLES-Classic-Holiday-Gift-Box.png?itok=TffHhr_E",
        "role": "secondary",
        "alt": "TURTLES Classic Holiday Gift Box"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/quality_street_180_g_tin.png?itok=7IURMh8h",
        "role": "secondary",
        "alt": "QUALITY STREET Celebration Tin, 180 grams. Assortment of caramels, crèmes, and chocolate pralines."
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-08/00059800751797_A1N1_44350840_25.06.2024_0.png?itok=iL8t7VSG",
        "role": "secondary",
        "alt": "QUALITY STREET Holiday Gift Box"
      }
    ]
  },
  "text": [
    "QUALITY STREET Holiday Gift Tin",
    "Celebrate with NESTLÉ QUALITY STREET! A Canadian favourite for over 75 years, QUALITY STREET'S decadent mix of chocolates and candies is a Canadian tradition. With treats like Truffle Block, Toffee Penny, Orange Créme, Hazelnut Flavoured Triangle, Coconut Éclair, Caramel Cup, Hazelnut in Caramel, Fudge, Strawberry Créme, Orange Crunch, and Toffee Finger, QUALITY STREET is sure to delight. Our beautifully designed collectible tin is ready for gift-giving or sharing with friends and family. Imported from England, QUALITY STREET's candies and chocolates are made with no artificial flavours using cocoa that is 100% Rainforest Alliance certified, which helps farmers improve the quality of their products and strengthen their communities. Enjoy QUALITY STREET candies and chocolates and open a tin full of tradition!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "QUALITY STREET Holiday Gift TinFeatures and Benefits",
    "Celebrate The Holidays: Delight your friends and family with QUALITY STREET's assorted chocolates and candies",
    "A Canadian Favourite For Over 75 Years: QUALITY STREET's decadent mix of milk chocolates, dark chocolates, crémes, toffees, and pralines are a Canadian tradition",
    "Ready For Gifting: Comes in a beautifully designed collectible tin, perfect for giving as a gift or sharing with friends and family",
    "No Artificial Flavours: NESTLÉ QUALITY STREET chocolates and candies are made with all natural flavours",
    "Individually Wrapped: QUALITY STREET chocolates and candies are individually wrapped",
    "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, we purchase 100% Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities",
    "QUALITY STREET Holiday Gift TinNutrition Information",
    "Per 5 pieces (42 g)Amount% DVCalories200Carbohydrate29gDietary Fiber1g4%Sugars24g24%Fat9g12%Cholesterol5mgSaturated5gTrans Fat0.1gProtein1gSodium40mg2%Amount% DVCalcium40mg3%Iron0.5mg3%Potassium100mg3%",
    "QUALITY STREET Holiday Gift TinIngredients",
    "Sugars (sugar, glucose-fructose, sweetened condensed milk), Modified milk ingredients, Palm, vegetable and coconut oils, Unsweetened chocolate*, Cocoa butter*, Dried coconut, Butter, Hazelnuts, Sunflower and/or rapeseed lecithin, Cocoa powder*, Salt, Monoglycerides, Lactic acid, Citric acid, Natural flavour.May contain: Peanuts, Other tree nuts.*Rainforest Alliance Certified",
    "RECIPES",
    "Quality Street Chocolate Coconut Kulfi",
    "These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour.",
    "Chocolate Hazelnut and Pistachio Burfi",
    "Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence",
    "QUALITY STREET Nankhatai",
    "Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season.",
    "Quality Street Khajoor Cake",
    "Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake!",
    "You might be interested in"
  ]
}