{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/spicy-thai-coconut-soup",
    "category": "Recipe",
    "title": "Spicy Thai Coconut Soup",
    "n_tokens": 344,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/676674bff1e5a90602efc93a24c12dd2_spicy_thai_coconut_soup-046_960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Spicy Thai Coconut Soup",
    "This soup, otherwise known in Thailand as Tom Kha, gets its name from tom, meaning soup, and kha, meaning “galangal,” a type of aromatic root vegetable. Make this quick and easy Thai classic at home, fragrant with herbs and spices, for dinner tonight.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "50\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 stalk lemongrass",
    "2 tbsp coconut oil",
    "4 cloves garlic, minced",
    "1 small piece fresh ginger, cut into 1/8-inch thick slices",
    "1/2 white onion, thinly sliced",
    "1 1/2 cups sliced mushrooms",
    "1 red bell pepper, thinly sliced",
    "6 tbsp Maggi powdered coconut milk",
    "2 cubes Maggi Bouillon",
    "2 tbsp chili paste",
    "1 tbsp fish sauce",
    "1/4 cup fresh cilantro leaves",
    "1/4 cup torn fresh Thai basil",
    "2 tbsp thinly sliced green onions",
    "Instructions",
    "Remove tough outer leaves from lemongrass; trim base and top of stalk, and finely chop tender core. Set aside.",
    "Heat coconut oil in large high-sided saucepan; cook garlic, ginger and lemongrass for 1 to 2 minutes or until fragrant. Add onion, mushrooms and bell pepper; cook for 2 to 4 minutes or until softened.",
    "In large bowl, whisk together 4 1/2 cups water, Maggi powdered coconut milk, Maggi Bouillon, chili paste and fish sauce; pour over vegetables. Bring to boil; reduce heat and simmer for 15 minutes.",
    "Spoon into bowls. Garnish with cilantro, basil and green onions.",
    "Tips",
    "For an authentic Thai cooking method, use a wok to cook your vegetables.",
    "For a vegan soup, substitute soy sauce for fish sauce.",
    "Add shredded chicken or tofu for extra protein if desired.",
    "Mix together any leftover soup with mashed potatoes the next day for a uniquely delicious side dish.",
    "What you need",
    "How to prepare"
  ]
}