{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/maggi-so-juicy-trinidadian-style-doubles",
    "category": "Recipe",
    "title": "MAGGI So Juicy Trinidadian-Style Doubles",
    "n_tokens": 615,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/a7d1f0f90fca4bdcc766ef39c4b8b27e_trinidadian_style_doubles-015-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "MAGGI So Juicy Trinidadian-Style Doubles",
    "This sandwich-style Caribbean classic is made with fresh fry bread, called bara, and a curried chickpea stew, called chana, making this all-day staple a delicious vegetarian option. Dating back to the 1930s, this popular dish is believed to have been created by Indo-Trinidadians from the island’s Princes Town and it has been a cultural culinary tradition ever since! In fact, doubles have garnered worldwide attention, even having their own national day of celebration on May 30.",
    "Prep time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "60\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2/3 cup (150 mL) Perrier Sparkling Water",
    "1 tsp (5 mL) quick-rising (instant) yeast",
    "1/4 tsp (1 mL) granulated sugar",
    "2 cups (500 mL) all-purpose flour",
    "1 tsp (5 mL) curry powder",
    "1/2 tsp (2 mL) ground cumin",
    "1/2 tsp (2 mL) ground turmeric",
    "4 cups (1 L) vegetable oil, for frying",
    "1 tbsp (15 mL) vegetable oil",
    "1 onion, diced",
    "4 cloves garlic, minced",
    "1 tbsp (15 mL) minced fresh gingerroot",
    "1 pkg (36 g) MAGGI So Juicy – Garlic seasoning",
    "1 small Scotch bonnet pepper, seeded and diced",
    "4 tsp (20 mL) curry powder",
    "1/4 tsp (1 mL) salt",
    "1 can (400 mL/14 oz) chickpeas, drained and rinsed",
    "2 cups (500 mL) shredded green cabbage",
    "2 green onions, sliced",
    "1 red bell pepper, thinly sliced",
    "1/2 cup (125 mL) shredded carrot",
    "1/4 cup (60 mL) mayonnaise",
    "2 tbsp (30 mL) freshly squeezed lime juice",
    "1/4 tsp (1 mL) black pepper",
    "Pinch ground celery seed",
    "1/2 cup (125 mL) mango chutney",
    "Instructions",
    "Fry Bread: In small bowl, stir together sparkling water, yeast and sugar",
    "In medium bowl, whisk together flour, curry powder, cumin and turmeric; fold in yeast mixture to form a dough. Cover with clean kitchen towel and let rise in cool, dark place for 1 hour or until dough has doubled in size.",
    "Meanwhile, in large heavy-sided skillet set over medium-high heat, preheat oil to 350°F or until shimmering.",
    "Punch dough to remove excess air and divide evenly into sixteen 1-tbsp (15 mL) balls. Using rolling pin, roll balls out into 4-inch (10 cm) rounds and transfer to baking sheet.",
    "In batches to avoid crowding, add dough rounds to oil and cook, turning once, for 1 to 2 minutes or until golden and puffed. Transfer to paper towel–lined baking sheet. Cover to keep warm as they are cooked.",
    "Chickpea Curry: Meanwhile, in large skillet set over medium heat, add oil. Add onion, garlic and ginger; cook, stirring frequently, for 2 to 3 minutes or until onion has softened. Add MAGGI So Juicy – Garlic seasoning, Scotch bonnet pepper, curry powder and salt; cook, stirring frequently, for 2 to 3 minutes or until fragrant. Stir in chickpeas and 1 cup (250 mL) water. Bring to a boil, reduce to heat to low, cover and simmer, stirring occasionally, for 10 to 15 minutes or until chickpeas are tender.",
    "Assembly: In medium bowl, toss together cabbage, green onions, red pepper and carrot.",
    "In small bowl, whisk together mayonnaise, lime juice, salt, pepper and celery seed. Scrape mayonnaise mixture into cabbage mixture and toss to coat.",
    "Divide chickpea curry evenly among 8 pieces of fry bread. Top with remaining fry breads to create 8 doubles. Serve with coleslaw and mango chutney.",
    "Tips",
    "Prepare chickpea curry ahead of time and keep refrigerated for up to 1 week or frozen for up to 3 months. Fry bread can also be made in advance; wrap individually in paper towel and store in an airtight container at room temperature for 1 week or freeze for up to 3 months. Thaw if frozen and lightly toast in oven before using.",
    "What you need",
    "How to prepare"
  ]
}