{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/maggi-subz-mast-masala",
    "category": "Recipe",
    "title": "Crispy Vegetarian MAGGI Subz Mast Masala",
    "n_tokens": 476,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/350f90e2c9b822f2488e61543b13875e_maggi_final.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "products",
    "Explore More Recipes",
    "MAGGI Subz Mast Masala",
    "A deliciously different way to prepare sabzi, our Subz Mast Masala makes dinner prep easy, thanks to MAGGI Tamarina Sauce and MAGGI Masala Chilli Sauce. You don’t have to add any masalas, just add your favourite vegetables to this spicy roasted medley and watch your family savour this vegetarian dish that is crispy, tasty, and mast all at once!",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 medium carrot, peeled",
    "1 small eggplant",
    "1 medium sweet red pepper",
    "1 medium onion, peeled",
    "2 cups cauliflower florets",
    "1 medium potato or sweet potato, peeled",
    "2 cloves garlic, peeled and halved lengthwise",
    "¼ cup olive oil",
    "2 tablespoons each: MAGGI Tamarina Sauce, MAGGI Masala Chilli Sauce  (Or use 4 tbsp of either sauce)",
    "1/6 cup Corn flour, whole-grain, white",
    "¼ cup chopped fresh coriander",
    "¼ cup chopped fresh mint leaves",
    "1 tsp chaat masala",
    "2 tablespoons chopped fresh coriander and mint for garnish",
    "1 tablespoon ginger slivers for garnish",
    "Instructions",
    "Preheat oven to 450F. Line a large, rimmed baking sheet with parchment (or use two medium baking sheets).",
    "Trim the vegetables by removing the top and bottom portions of the carrots, stem of the eggplant, seeds and stems of the peppers and root end of the onion. Cut vegetables into 1-inch pieces and place in a large mixing bowl.",
    "Add olive oil, MAGGI Tamarina Sauce, MAGGI Masala Chilli Sauce, and cornstarch. Mix well to coat vegetables evenly.",
    "Transfer to prepared baking sheets, spreading them in an even layer and scraping any residual sauce over them.",
    "Bake for about 30 mins or until the vegetables are slightly charred, cooked through and lightly crisped. Check after 25 mins and adjust cooking time accordingly.",
    "Transfer roasted vegetables to serving dish. Gently fold in chopped fresh herbs and sprinkle chaat masala over top.",
    "Sprinkle with additional chopped fresh coriander & mint and scatter ginger slivers over top to garnish.",
    "Tips",
    "Make It More Chatpata!",
    "Drizzle 2 tablespoons of MAGGI Masala Chilli Sauce over top of roasted vegetables.",
    "Substitution",
    "Use just one type of MAGGI Sauce if desired.",
    "Chef’s Tips",
    "Serve Subz Mast Masala right out of the oven to enjoy its delicious crispness.Choose vegetables that will take approximately the same amount of time to cook such as various root vegetables, acorn or butternut squash.Cut vegetables in approximately the same size for even roasting.",
    "Serving Suggestion",
    "Serve with lemon wedges and warm naan or pooris to scoop up the delicious veggies!",
    "Variations",
    "Choose vegetables that are in season and full of peak flavour, such as root vegetables and butternut or other squash in the Fall; zucchini, peppers, and eggplant in the Summer.Add cubes of paneer or canned drained chickpeas to the vegetables of your choice and follow recipe directions above.",
    "What you need",
    "How to prepare"
  ]
}