{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/maggi-masala-chilli-chatpata-chicken",
    "category": "Recipe",
    "title": "Masala Chilli Chatpata Chicken",
    "n_tokens": 346,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/2a20f85e0df5537888b87844b99681c2_maggi_chicken_2.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "products",
    "Explore More Recipes",
    "MAGGI Masala Chilli Chatpata Chicken",
    "A delicious way to break your fast at Iftar, this easy recipe comes together very quickly and tastes great with warm naan!",
    "Prep time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "8\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "18\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 lb (450g) Chicken breast, cubed into bite sized pieces",
    "1 tablespoon Cornstarch",
    "3 tablespoons Oil, divided",
    "2 tablespoons each: Finely chopped fresh coriander and mint leaves, divided",
    "3 tablespoons Maggi Masala Chilli Sauce, divided",
    "1 Small onion, chopped",
    "1 Small sweet red bell pepper, chopped",
    "1 Clove garlic, chopped",
    "½ Inch Piece ginger, cut into long thin slivers",
    "1 tablespoon Lime juice",
    "Instructions",
    "Combine chicken, cornstarch, 1 tbsp oil, 1 tbsp each of the chopped fresh herbs and 1 tbsp Maggi Masala Chilli Sauce in large mixing bowl. Mix well.",
    "Heat remaining 2 tbsp oil in large nonstick skillet over medium heat. Add chicken, spread it in a single layer.",
    "Let chicken cook undisturbed for 2 mins, then carefully flip pieces. Cook 2 mins, then stir fry 1 min until lightly golden.",
    "Add chopped onion, sweet pepper, garlic, ginger slivers, and remaining herbs to skillet. Cook 2 mins until slightly softened.",
    "Add remaining 2 tbsp Maggi Masala Chilli Sauce and fresh lime juice. Mix well.",
    "Transfer to bowl and serve with warm naan",
    "Tips",
    "INGREDIENT DISCLAIMER",
    "We prioritize transparency to meet the needs of our diverse consumers and provide ingredient details about Nestlé products used in our recipes. Maggi Masala Chilli Sauce and Maggi Tamarina Sauce contain no alcohol and all process aids used are of vegetarian origin.",
    "SUBSTITUTION",
    "To make this dish vegetarian, substitute cubes of paneer or firm tofu instead of the chicken.",
    "GARNISH",
    "Sprinkle with additional chopped fresh coriander and mint and scatter more ginger slivers over top.",
    "Make It More Chatpata!",
    "Add a drizzle of Maggi Tamarina Sauce over top.",
    "SERVING SUGGESTION",
    "Serve with Kachumber (chopped salad) on the side. Chop red onions, tomatoes, fresh coriander, and mint. Sprinkle with lemon juice and salt. Serve as an accompaniment.",
    "What you need",
    "How to prepare"
  ]
}