{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/festive-kitkat-holiday-chocolate-house",
    "category": "Recipe",
    "title": "KITKAT Holiday Chocolate House Recipe",
    "n_tokens": 262,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/fb32172b32f84ca3c4031567323ca3dc_nestle_carousel_916x636px_kkhouse.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Facts",
    "Videos",
    "Explore More Recipes",
    "Festive KITKAT Holiday Chocolate House",
    "Our KIT KAT House is the sweetest decoration around!",
    "Prep time:",
    "40\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "8 Bars KIT KAT",
    "1 Bar AERO Milk Chocolate Bubble Bar",
    "1 Tube white cake decorating icing",
    "for decoration SMARTIES, jelly candies, candy sprinkles",
    "Instructions",
    "Measure out two pattern pieces on bristol board or cereal box cardboard. Cut out patterns and fold along the dotted lines shown in the first diagram above.",
    "Tape the sides of the two pattern pieces together first to form the house frame. Tape roof together then tape bottom of house to foil covered board or white cake board.",
    "Dab icing on back of 4 KIT KAT bars to make sides of house and on 2 KIT KAT bars to make front and back; attach bars by pressing gently on house frame. Cut 2 KIT KAT bars in half widthwise; dab icing on backs and attach on each side of roof. Cut 3 pieces from AERO bar; set aside. Dab icing on back of remaining AERO piece; attach to house to make front door. Use icing to glue 2 of the leftover AERO pieces to form chimney; attach to roof. Use last remaining AERO piece for front step. Fill cabin seams with icing. Decorate by attaching your favourite decorations with icing.",
    "Tips",
    "Holiday fun!",
    "Make several and build your own yummy village.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}