{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/savory-breakfast-belizean-fry-jacks",
    "category": "Recipe",
    "title": "Savory Breakfast Belizean Fry Jacks",
    "n_tokens": 528,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/cd390e2788f2131039a104c7b1fe9c66_belizean_fry_jacks-037-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Savory Breakfast Belizean Fry Jacks",
    "Similar to beignets from New Orleans, these delicious pieces of fried dough are a popular staple in Belize, as well as throughout the Caribbean and Latin America. Commonly enjoyed for breakfast as fuel for the day ahead, fry jacks can be eaten sweet or savoury depending on the accompanying toppings and condiments.",
    "Prep time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "260\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "295\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2 tbsp (30 mL) olive oil",
    "1 green onion, sliced",
    "1 small white onion, diced",
    "3 cloves garlic, minced",
    "1/4 cup (60 mL) MAGGI Hot and Sweet Sauce",
    "1 tbsp (15 mL) ground cumin",
    "2 tsp (10 mL) Mexican dried oregano",
    "1 1/2 tsp (7 mL) salt",
    "2 cups (500 mL) dried pinto beans, soaked overnight, drained and rinsed",
    "2 1/4 cups (560 mL) all-purpose flour",
    "1 tbsp (15 mL) baking powder",
    "1 tsp (5 mL) salt",
    "1 tbsp (15 mL) vegetable shortening",
    "1/2 cup (125 mL) Original Carbonated Perrier or San Pellegrino Sparkling Water",
    "1/4 cup (60 mL) coconut milk",
    "4 cups (1 L) vegetable oil, for frying",
    "8 fried eggs",
    "3 cups (750 mL) cherry tomatoes",
    "Instructions",
    "Refried Beans: In large, high-sided skillet set over medium heat, add oil. Add green onion, white onion and garlic; cook, stirring frequently, for 3 to 5 minutes or until softened and fragrant. Add MAGGI Hot and Sweet Sauce, cumin, oregano and salt; cook, stirring, for 1 to 2 minutes or until coated. Stir in pinto beans and 4 cups (1 L) water",
    "Reduce heat to medium-low and bring to a simmer, stirring occasionally, for 3 to 4 hours or until beans are very tender and most of the liquid has evaporated. Mash beans in the skillet until smooth, then cook, stirring occasionally, for 15 to 20 minutes or until mixture is thick. Remove from heat and cover to keep warm",
    "Fry Jacks: In medium bowl, whisk together flour, baking powder and salt. Add shortening. Using fork, cut shortening into flour until mixture resembles a course meal. Gradually add Perrier, then coconut milk, scraping down sides, to create a soft dough. Divide mixture into 4 portions and let rest at room temperature for 10 to 15 minutes",
    "In deep-sided skillet set over medium-high heat, preheat oil to 350°F or until shimmering",
    "On lightly floured work surface, flatten each portion into a 6- to 7-inch (15 to 18 cm) round. Cut each round in half to make 8 half-circles, then cut 2 slits in center of each half-circle to make vent holes",
    "Working in batches to avoid crowding, add dough half-circles to preheated oil. Cook, turning once, for 4 to 6 minutes or until golden and puffed. Using slotted spoon, transfer fry jacks to paper towel–lined plate to drain",
    "Assembly: Divide fry jacks, fried eggs and cherry tomatoes among 4 serving plates. Serve with refried beans",
    "Tips",
    "Tip 2",
    "Fry jacks can also be served sweet. Dust with confectioners’ (icing) sugar, if desired, and serve with fruit, honey or jam!",
    "Tip 1",
    "Leftover refried beans can be used in burritos or taco bowls or as a side for roasted meat or fish",
    "What you need",
    "How to prepare"
  ]
}