{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/aero-and-turtles-bite-size-chocolate-pecan-rugelach",
    "category": "Recipe",
    "title": "AERO and TURTLES Bite Size Chocolate Pecan Rugelach",
    "n_tokens": 369,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/361d5cc19a3581f8f5b8aa8f3aacea81_chocolate_pecan_rugelach-027-960x640-_low_res.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "AERO and TURTLES Bite Size Chocolate Pecan Rugelach",
    "Deriving from the Yiddish word meaning “little twists,” these delicious bite-size cookies are traditionally served during Hanukkah, and can be made with dried fruit, nuts, jams or, as in this recipe, chocolate! Aero and chocolate add decadence and delight to this holiday favourite",
    "Prep time:",
    "25\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "45\n\t\t\t\t\t\t\t\t\t\t\t45 pieces",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (250 mL) all-purpose flour",
    "1/2 tsp (2 mL) salt",
    "1/2 cup (125 mL) cold butter, cubed",
    "1/2 cup (125 mL) cold brick-style cream cheese, cubed",
    "2 tbsp (30 mL) sour cream",
    "1/2 cup (125 mL) chopped Aero chocolate bar",
    "1/2 cup (125 mL) chopped Turtles chocolates",
    "1 egg",
    "Instructions",
    "To food processor, add flour and salt; pulse to combine. Add butter and cream cheese and pulse until dough begins to resemble coarse chunks. Add sour cream and pulse until combined, scraping down sides",
    "Turn mixture out onto lightly floured work surface and gather into a ball. Divide into 2 even portions and press into discs. Wrap in plastic wrap and refrigerate for 2 hours or until firm",
    "Preheat oven to 350°F (18°0). Line 2 baking sheets with parchment paper",
    "Let dough stand at room temperature for 10 minutes. Roll out each disc into a 12-inch (30 cm) circle. Using sharp paring knife or pizza cutter, cut each circle into 16 even wedges",
    "Sprinkle Aero chocolate and Turtles chocolate evenly over dough. Starting from wider side of each wedge, roll up dough to enclose chocolate, resembling mini croissants. Arrange on prepared baking sheets. Chill for 10 minutes",
    "In small bowl, whisk together egg and 1 tbsp (15 mL) water. Brush evenly over tops of dough roll-ups.",
    "Bake, turning sheets halfway, for 20 to 22 minutes or until golden, lightly puffed and flaky. Let cool slightly on baking sheets, then transfer to racks to cool completely",
    "Tips",
    "Freeze",
    "Rolled cookies can be frozen before baking. Freeze in an airtight container for up to 2 months",
    "At room temperature",
    "Leftover baked cookies can be stored in an airtight container at room temperature for up to 3 days or frozen for up to 2 months",
    "What you need",
    "How to prepare"
  ]
}