{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/bite-size-chocolate-cinnamon-pets-de-soeur",
    "category": "Recipe",
    "title": "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "n_tokens": 366,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/af0e0a798936101927e0ad132340c08f_-chocolate_cinnamon_pets_de_soeur-032-16x9.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Bite-Size Chocolate Cinnamon Pets de Soeur",
    "Pets de sœur, literally translated as Nun farts, and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried.",
    "Prep time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "110\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (250 mL) all-purpose flour",
    "Pinch salt",
    "2 tbsp (30 mL) shortening",
    "cubed",
    "1/4 cup (60 mL) cold butter",
    "1/4 cup (60 mL) Carnation Hot Chocolate",
    "3 tbsp (45 mL) brown sugar",
    "1 tsp (5 mL) cinnamon",
    "2 tbsp (30 mL) butter",
    "at room temperature",
    "Instructions",
    "In bowl, whisk flour with salt; using fingertips or pastry blender, rub or cut in shortening until combined, then blend in butter until mixture resembles coarse meal. Using fork, stir in 2 tbsp (30 mL) ice water until dough comes together.",
    "Shape dough into disk; place in large reusable plastic bag. Using rolling pin, flatten dough slightly inside reusable plastic bag into 1/2-inch (1 cm) thickness. Refrigerate for at least 1 hour or up to 2 days.",
    "Preheat oven to 375°F (190°C). Transfer dough to lightly floured work surface. Let stand at room temperature for 3 to 5 minutes or until dough can be rolled easily. Roll into 11- x 7-inch (28 x 18 cm) rectangle, about 1/8-inch (3 mm) thickness.",
    "In small bowl, combine Carnation Hot Chocolate, brown sugar and cinnamon; set aside. Spread butter over top of dough, leaving 1/2-inch (1 cm) border. Sprinkle with Carnation Hot Chocolate mixture; roll up into log.",
    "Freeze for 5 to 10 minutes or until firmed. Starting at one long edge, cut into 1/2-inch (1 cm) thick slices. Arrange on parchment paper–lined baking sheet, about 2 inches (5 cm) apart.",
    "Bake for 15 to 20 minutes or until crisp.",
    "Tips",
    "Simplify",
    "For quick and easy preparation, use store-bought refrigerator pie pastry or frozen puff pastry.",
    "What you need",
    "How to prepare"
  ]
}