{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/iced-kit-kat-whipped-hot-chocolate",
    "category": "Recipe",
    "title": "Iced Kit Kat Whipped Hot Chocolate",
    "n_tokens": 335,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Kitkat-Whipped-Choc.jpg",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "Iced Kit Kat Whipped Hot Chocolate",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "Prep time:",
    "3\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "7\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "Skill level:",
    "Intermediate",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "100ml milk",
    "5tsp Carnation Hot Chocolate",
    "2 cups Cream, fluid, light whipping",
    "2 tbsp Nestlé Professional Kit Kat Spread",
    "1 tbsp Nestlé Professional Kit Kat Inclusions",
    "Instructions",
    "Start by making the Carnation Whip Cream. Whip 35% cream with the Carnation Hot Chocolate. You can use a service-grade whip cream canister with a cartridge or a home mixer to achieve a fluffy and creamy texture.",
    "Take your serving cup and pour the Kit Kat spread onto the walls of the cup. This will add a delightful chocolatey layer to your drink.",
    "Add some ice to the cup, filling it about two-thirds of the way with cold milk. This will create a refreshing and chilled base for your drink.",
    "Now, it's time to top it all off with the Carnation Whip Cream. Gently spoon or pipe the whipped cream onto the milk, creating a beautiful and creamy layer.",
    "Sprinkle some Carnation Hot Chocolate powder over the whipped cream and crushed Kit Kat for an extra burst of flavor and a touch of sweetness.",
    "Finally, add a Kit Kat bar as a delightful garnish. You can place it on top of the whipped cream or even partially submerge it into the drink for an extra treat.",
    "Now, sit back, relax, and enjoy your decadent Iced Kit Kat Hot Chocolate creation. Cheers to a delightful and indulgent treat!",
    "Tips",
    "What you need",
    "How to prepare"
  ]
}