{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/mawa-kheer",
    "category": "Recipe",
    "title": "Simple & Delicious Mawa Kheer",
    "n_tokens": 265,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/d493abf0b253ee76ec8f24e14e688868_nestle_eid_recipe__web_mawa_kheer.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "products",
    "Explore More Recipes",
    "Mawa Kheer",
    "Similar to rice pudding and sprinkled with raisins, almonds, and cashews, this decadent treat, often made for special occasions such as Ramadan, Holi or Diwali, makes a great special pudding any time. Try this Mawa Kheer recipe and discover an easy and quick dessert to impress your friends and family at home.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "5\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "10g Pine nuts",
    "3 Saffron strands",
    "50g Lotus seeds (makhana)",
    "50g Raisins",
    "50g Cashew nuts, chopped",
    "25g Blanched almonds, chopped",
    "1tsp Cardamom powder",
    "450ml Semi-skimmed milk",
    "40g Ghee",
    "Instructions",
    "Mix your ingredients",
    "Mix together NESTLÉ® full cream sweetened condensed milk and fresh milk, add the saffron and set aside.",
    "Fry the seeds and the fruits",
    "Heat ½ tbsp ghee and fry the lotus seeds for a minute, remove from pan. Cool and crush the seeds. Heat remaining ghee and fry all the dried fruits until golden brown.",
    "Add seeds and fruits to the condensed milk",
    "Add the crushed makhana (seeds) and fruit to the condensed milk mixture and bring to a boil, simmer till thick and creamy. Add the cardamom powder, mix well and remove from heat. Serve hot or cold.",
    "What you need",
    "How to prepare"
  ]
}