{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipes/go",
    "category": "Recipe",
    "title": "On the Go",
    "n_tokens": 438,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/333ad62df5940dab69296477ba4ec6fa_coconut_meatball_curry-025-960x640.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/9e6691365a52bea5f8bece29d3fcd978_BOOST_Chocolate_Mocha_Energy_Bars.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/9cc6ae1fc742c57c18f868309b15069e_one_pot_hidden_veggie_bolognese-024-960x640.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/7c33a07e676c6e6658f15b0dfe0d5518_lemon_vanilla_custard-014-960x640.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/511e0ec8450cfb99a1bdf69c0fb56e34_tacos-al-pastor.png",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "On the Go",
    "Packed with hidden veggies, this curry-inspired one-pot dish is perfect for big-batch cooking to keep you fuelled for the week! Coconut milk powder provides creaminess that perfectly balances the warm spice of curry paste and the hot and sweet chili sauce.",
    "These energy bars are a great breakfast pick-me-up and even have espresso powder for your morning hit of caffeine.",
    "A veggie-packed variation on the traditional Italian ragù, this Bolognese is a one-pot dish that’s great for making ahead and preparing in batches for busy weeknight dinners. Originally from the Emilia-Romagna region, “Bolognese” refers to a slow-cooked meat sauce that was first developed in Bologna, Italy. This recipe includes loads of hidden vegetables so you can enjoy comfort-food classics while still getting important nutrients!",
    "Stacked with vibrant, colourful layers, this mason-jar salad is sure to keep you satisfied. Loaded with nourishing ingredients, this recipe makes for a perfect balanced lunch or a portable summery side dish for dining al fresco.",
    "Tacos al pastor is a Mexican street-food staple that was created by Lebanese immigrants in the 1930s. Cooked on a Middle Eastern shawarma–style spit called a trompo, this recipe — spiked with chiles, adobo sauce and orange juice, and topped with pineapple and cilantro — has been adapted to be easily created in your own kitchen – no trompo required.",
    "140",
    "Loaded with fibre and low on sugar, these chocolate and pumpkin mini muffins make it easy to eat healthy on the go. Make in advance or eat warm out of the oven.",
    "Finally, a smoothie that looks as whimsical as it is delicious. With protein, fibre, and nutritious spirulina.",
    "Coconut, apricots and oats are combined to form satisfying bite-size clusters that will give you a BOOST any time of the day.",
    "Add protein powder to chocolate chip cookies to make them feel like a healthier indulgence.",
    "Chia seeds for protein and fiber, fresh pineapple and mango for game-winning taste.",
    "Start the day with a cool and creamy chocolate smoothie with protein and fibre, plus a little kick from cayenne pepper.",
    "Peanut butter cookies sweetened with coconut sugar get an added crunch with roasted peanuts.",
    "Perfect for picnics or lunch on the go, these stacked mason-jar salads are easy to make yet impressive to serve. Play around with your favourite salad toppings for added texture and flavour, or omit prosciutto for a vegetarian alternative. This recipe is super versatile and is sure to be a crowd favourite.",
    "These oat bars bake up in a jiffy and are great to have on hand. You can even freeze them and just thaw when you need a snack."
  ]
}