{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/milo-malt-chocolate-maple-taffy",
    "category": "Recipe",
    "title": "MILO Malt & Chocolate Maple Taffy",
    "n_tokens": 238,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/685bccd6ea597cccdd7b8705fa4fd6a1_malt_and_chocolate_maple_taffy-032_960x640_(2).jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "MILO Malt & Chocolate Maple Taffy",
    "This delicious recipe is inspired by the Huron-Wendat’s (and other Indigenous communities) cultural use and understanding of maple trees, its sap, and the traditional methods of processing used to create one of Canada’s most loved and well-known condiment – maple syrup. This sweet and interactive snack is now a popular attraction at sugar shacks (or cabane à sucre) across the country during harvest season.",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "8 cups crushed ice",
    "1 1/2 cups (375 mL) maple syrup",
    "1/2 cup (125 mL) Nesquik Chocolate Syrup",
    "1/4 cup (60 mL) Milo Chocolate Malt Drink Mix",
    "Instructions",
    "Pat crushed ice into large baking dish or serving tray and keep frozen.",
    "In a small saucepan set over medium heat, add maple syrup. Cook, stirring occasionally for 3 to 5 minutes or until mixture reaches hard ball stage – when candy thermometer registers at 245°F (118°C) or when a small amount of mixture is dropped into cold water and forms a firm ball.",
    "In large spoonfuls, pour maple syrup mixture onto crushed ice, making 5-inch strips. Let cool for 5 to 10 seconds. Place popsicle sticks onto mixture and gently twirl, winding to pull taffy mixture from crushed ice. Repeat with remaining mixture and popsicle sticks.",
    "Drizzle with Nesquik Chocolate Syrup and sprinkle with Milo Chocolate Malt Drink Mix.",
    "What you need",
    "How to prepare"
  ]
}