{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/classic-filipino-silvana-cookies",
    "category": "Recipe",
    "title": "Classic Filipino Silvana Cookies",
    "n_tokens": 314,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/48e8c3d47ed2cf97a69fce47387d0ef6_silvanas.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Classic Filipino Silvana Cookies",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "40\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "75\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1/2 cup Egg, white, raw, fresh",
    "1 teaspoon Leavening agents, cream of tartar",
    "3/4 cup Sugars, granulated",
    "1/4 cup Nuts, cashew nuts, dry roasted, without salt added",
    "1/4 cup Wheat flour, white, all-purpose, unenriched",
    "0.50 gram Butter, without salt",
    "2 cups Sugars, powdered",
    "1 cup Nuts, cashew nuts, dry roasted, without salt added",
    "Instructions",
    "Combine egg white and cream of tartar in a mixing bowl. Whisk until fluffy. Gradually add sugar while whisking until stiff peaks.",
    "Mix ground cashew and flour. Gradually fold in the egg white mixture until combined. Transfer into a piping bag and pipe 3-inch round disks on a sheet tray lined with buttered and floured parchment paper.",
    "Bake in a preheated 320°F oven for 30 – 40 minutes or until dry and crunchy. Set aside to cool completely.",
    "For the filling, whip butter for 2 minutes. Add powdered sugar and NESTLÉ® All Purpose Cream and whip until light. Set aside.",
    "Mix ground cashew and graham cracker to make coating.",
    "Spread filling in between 2 meringue cookies. Cover the outside with the same filling and coat with cashew and graham cracker mixture. Freeze until serving.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}