{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/quality-street-chocolate-coconut-kulfi",
    "category": "Recipe",
    "title": "Quality Street Chocolate Coconut Kulfi",
    "n_tokens": 355,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/860048f4da6d5eeadd38492c750051eb_chocolate_coconut_kulfi-027-960x640-_high_res.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Quality Street Chocolate Coconut Kulfi",
    "These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour.",
    "Prep time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "40\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2 pkgs (each 1.7 oz/50 g) Maggi Coconut Milk Powder",
    "3 tbsp (45 mL) granulated sugar",
    "1/2 cup (125 mL) evaporated milk",
    "4 tsp (20 mL) rice flour",
    "2 tbsp (30 mL) Nescafé Gold instant coffee granules",
    "1/2 tsp (2 mL) ground cardamom",
    "1 cup (250 mL) chopped Quality Street Tin",
    "1/2 cup (125 mL) toasted sweetened shredded coconut",
    "8 (4 oz/120 mL) paper cups or kulfi molds",
    "Instructions",
    "In medium bowl, whisk together Maggi Coconut Milk Powder and 3 cups (750 mL) water until smooth. Transfer to high-sided skillet set over medium-low heat. Bring a simmer, stirring occasionally to prevent burning, for 18 to 20 minutes or until slightly thickened. Stir in sugar and cook, stirring occasionally, for 3 to 5 minutes or until mixture is smooth and sugar has dissolved.",
    "In another medium bowl, stir together evaporated milk and rice flour until blended. Add to skillet and stir to combine.",
    "Add Nescafé Gold to skillet and stir to combine. Add cardamom and bring to a simmer, stirring occasionally, for 5 minutes or until smooth and thickened. Let cool to room temperature",
    "Divide mixture evenly among paper cups. Sprinkle Quality Street assorted chocolates and coconut evenly over kulfi mixture. Insert an ice-pop stick into centre of each cup, cover with plastic wrap and freeze for 8 hours or until fully set and frozen.",
    "Let stand at room temperature for 5 minutes and remove from cups before serving.",
    "Tips",
    "Scaled up!",
    "Recipe can be easily scaled up to feed larger parties.",
    "Use nuts!",
    "This is a great way to use leftover nuts and seeds from the pantry — try sprinkling kulfi with chopped pistachios, cashews, sesame seeds or raw green pumpkin seeds (pepitas) if desired.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}