{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/tacos-al-pastor-made-maggi",
    "category": "Recipe",
    "title": "Tacos Al Pastor made with MAGGI",
    "n_tokens": 481,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/511e0ec8450cfb99a1bdf69c0fb56e34_tacos-al-pastor.png",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Tacos Al Pastor made with MAGGI",
    "Tacos al pastor is a Mexican street-food staple that was created by Lebanese immigrants in the 1930s. Cooked on a Middle Eastern shawarma–style spit called a trompo, this recipe — spiked with chiles, adobo sauce and orange juice, and topped with pineapple and cilantro — has been adapted to be easily created in your own kitchen – no trompo required.",
    "Prep time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "140\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "185\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2 ancho chiles, stemmed and seeded",
    "2 guajillo chiles, stemmed and seeded",
    "1 tsp (5 mL) cumin seeds",
    "1 tbsp (15 mL) Mexican dried oregano",
    "4 cloves garlic",
    "2 canned chipotle peppers with adobo sauce",
    "1 tbsp (15 mL) adobo sauce",
    "3/4 cup (175 mL) freshly squeezed orange juice",
    "1/4 cup (60 mL) MAGGI Liquid Seasoning",
    "1/4 cup (60 mL) white vinegar",
    "2 tbsp (30 mL) MAGGI Hot and Sweet Sauce",
    "1 tbsp + 1 tsp (20 mL) salt",
    "1 tbsp (15 mL) brown sugar",
    "2 tsp (10 mL) black pepper",
    "2 lbs (1 kg) sirloin pork roast, cut into 1/4-inch-thick (0.5 cm) slices",
    "2 slices peeled pineapple (each 1 inch/2.5 cm thick)",
    "5 white onions, halved and divided",
    "1 tsp (5 mL) salt",
    "1/2 cup (125 mL) packed chopped cilantro",
    "12 small corn tortillas, warmed",
    "Lime wedges",
    "Instructions",
    "In medium skillet set over medium heat, add ancho chiles, guajillo chiles and cumin. Toast, stirring frequently, for 3 to 5 minutes or until fragrant. Stir in Mexican oregano.",
    "Transfer spice mix to food processor or blender. Add garlic, chipotle peppers, adobo sauce, orange juice, MAGGI Liquid Seasoning, vinegar, MAGGI Hot and Sweet Sauce, salt, brown sugar and black pepper. Blend until smooth and combined.",
    "In large bowl, toss sliced pork and spice marinade. Cover and refrigerate for at least 12 hours.",
    "Preheat oven to 350°F (180°C).",
    "Place 1 pineapple slice in 13- by 9-inch roasting dish and insert 1 thick skewer into centre, pointing upward to create a spit. Thread marinated pork (discarding marinade) onto skewer and top with remaining pineapple slice. Add 4 halved onions to roasting dish.",
    "Roast, occasionally basting with drippings, for 2 to 2 1/2 hours or until pork is golden and lightly charred around the edges, and instant-read thermometer registers 160°F when inserted into thickest part of pork slice. Let pork rest for 10 to 15 minutes (reserve meat drippings). Dice roasted pineapple.",
    "In blender, add drippings and roasted onions. Pulse until smooth. Season with salt.",
    "Finely dice remaining onion. Transfer to small bowl and add cilantro; toss to combine.",
    "Thinly slice meat and divide evenly among tortillas. Top evenly with diced pineapple and onion-cilantro mixture. Serve with limes. Serve with roasted onion sauce on the side.",
    "Tips",
    "Tip 1",
    "For a vegetarian alternative, toss shredded jackfruit in marinade and roast until crispy, or use plant-based meat strips.",
    "What you need",
    "How to prepare"
  ]
}