{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/kitkat-almond-cookies",
    "category": "Recipe",
    "title": "Irresistible Chocolate KitKat Almond Cookies",
    "n_tokens": 427,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/c3228db66d502a4ea4f338efce210559_1080x1080.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Explore More Recipes",
    "KitKat Almond Cookies",
    "Almond cookies are acherished part of LunarNew Year as they areconsidered a symbol of goodfortune. We add a chocolateyKitKat crunch to our recipe,ensuring happiness allaround!This easy recipe bakes updelicious almond scentedcookies with a golden cracklyshell and soft, crumblyinterior, topped off with apiece of our irresistible KitKatMinis!",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "15\n\t\t\t\t\t\t\t\t\t\t\t15-16 cookies",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (120 g) All-purpose flour",
    "½ cup (60 g) Almond flour or finely ground  almonds",
    "½ teaspoon (2.5 g) Baking Soda",
    "1/8 teaspoon Salt",
    "1 stick (½ cup, 60 g), softened Unsalted butter",
    "1/3 cup (41.6 g) Sugar",
    "½ teaspoon (2.46 ml) Almond extract",
    "2 Large eggs, divided",
    "8, cut into half KitKat Minis",
    "Instructions",
    "Preheat oven to 350F. Line a baking tray with parchment paper.",
    "Combine all-purpose flour, almond flour, baking soda and salt in mixing bowl. Stir to mix.",
    "Combine butter and sugar in medium sized mixing bowl. Using a hand blender or a spatula, beat until it is fluffy and lighter in colour, about 1 min.",
    "Add the almond extract and 1 egg. Beat again for a few sec. until combined.",
    "Add the dry flour mixture, half at a time, beating well to combine after each addition.",
    "Scrape out the cookie dough from the blades of the hand mixer.",
    "Gently knead and combine the dough in the bowl until it comes together, about 30 sec.",
    "Divide the dough into 15 -16 equal pieces. With dampened or lightly greased hands, roll each piece into a smooth ball and place on parchment lined tray.",
    "Press down gently on each dough ball to flatten it lightly",
    "Beat remaining egg and brush lightly over the cookies.",
    "Bake for 15 mins until cookies are slightly puffed up and golden yellow in colour",
    "Remove from oven and gently press in a piece of KitKat Mini over top of each cookie. The warmth of the cookie will anchor the KitKat pieces into place.",
    "Cool cookies for 10 mins in baking tray, then transfer to serving platter",
    "Store extras in an airtight container for up to two weeks.",
    "Tips",
    "Serving Suggestion",
    "Enjoy these delicious KitKatAlmond Cookies with a cup ofjasmine tea!",
    "Substitution",
    "Substitute lard for the butterif desired",
    "Baking soda is customary inthis recipe to produce thedesired texture; however,you can substitute 1 tspbaking powder if desired",
    "Use any kind of KitKat WaferBar that you have on hand.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}