{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/maggi-juicy-jamaican-jerk-chicken",
    "category": "Recipe",
    "title": "MAGGI Juicy Jamaican Jerk Chicken",
    "n_tokens": 335,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/8a27c405b05eeafde286a2bc9c017fa7_juicy_jamaican_jerk_chicken-041-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "MAGGI Juicy Jamaican Jerk Chicken",
    "A classic throughout the Caribbean but famously known as a Jamaican staple, this beloved style of barbecue finds its roots from the Spanish term charqui, which means “dried strips of meat” and is reflective of the jerky-style texture and smoky flavour of meats cooked over burning coals.",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "35\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "172\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "4 lbs (2 kg) mix of chicken legs and thighs",
    "8 green onions, chopped",
    "4 cloves garlic",
    "2 Scotch bonnet peppers",
    "1 white onion, roughly chopped",
    "1/4 cup (60 mL) roughly chopped peeled fresh gingerroot",
    "2 tbsp (30 mL) ground allspice",
    "2 tbsp (30 mL) ground cumin",
    "2 tbsp (30 mL) chopped fresh thyme",
    "1 tbsp (15 mL) Chinese five-spice powder",
    "1 tbsp (15 mL) ground nutmeg",
    "1 tbsp (15 mL) black pepper",
    "2 tsp (10 mL) ground cinnamon",
    "1 pkg (34 g) MAGGI So Juicy – Mixed Herbs",
    "1/3 cup (75 mL) dark soy sauce",
    "2 tbsp (30 mL) vegetable oil",
    "3 tbsp (45 mL) packed chopped cilantro",
    "Instructions",
    "In large resealable container, arrange chicken.",
    "To blender, add green onions, garlic, Scotch bonnet peppers, white onion, ginger, allspice, cumin, thyme, Chinese five-spice powder, nutmeg, pepper and cinnamon. Add MAGGI So Juicy Mixed Herbs, soy sauce and oil. Blend until mixture is smooth and combined.",
    "Pour half the jerk mixture over chicken and turn to coat evenly. Cover and refrigerate for at least 2 hours or up to overnight. (Refrigerate remaining jerk mixture until ready to use.)",
    "Preheat grill to medium heat; grease grates well",
    "Grill chicken (discard marinade), turning occasionally and basting with reserved jerk mixture, for 35 to 45 minutes or until chicken is well-marked and cooked through, and an instant-read thermometer registers 170°F when inserted into thickest part of chicken thigh and leg",
    "Transfer to serving dish and garnish with cilantro",
    "Tips",
    "Tip 2",
    "Serve Jerk chicken with traditional Caribbean-style rice and peas, fried plantains, coleslaw or callaloo",
    "What you need",
    "How to prepare"
  ]
}