{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipes/smoothie",
    "category": "Recipe",
    "title": "Smoothie",
    "n_tokens": 303,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/1457dd99f8279568e796aeb29594b912_boost_original_tropical_smoothie_pops.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://img.youtube.com/vi/M2MVy6BfM5w/hqdefault.jpg",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/bd1c265beace2eb674142c36d6ef46c5_nesquik_gulabo-_website-_sept_29.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/7e58a2b1bb2b7ed1ddf0e12c550fee42_rachel’s_boost_high_protein_berry_smoothie.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/0c161b93aa20da44f70c0c48a107380f_BOOST_Original_Vanilla_Raspberry_Smoothie.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Smoothie",
    "Tropical fruits make these into exotic and refreshing pops, perfect for a hot summer day.",
    "Sesame gives this breakfast smoothie an exotic taste with tangy fresh strawberry flavour from the Boost.",
    "This Diwali, mix it up with the creamy texture and luscious flavour of Nesquik Strawberry Gulabo! Let this recipe be the highlight of your festivities, bringing a burst of flavour, vibrant colour and a touch of sweetness to your celebrations. Enjoy every sip of these aromatic flavours including strawberry, cardamom and rosewater and share the joy of with your loved ones.",
    "Skip the morning muffin, and take on the day like a Rachel Homan with this protein-packed smoothie.",
    "Share with a friend for a breakfast treat or a delicious anytime snack.",
    "Perfect as a high-protein breakfast treat or a delicious anytime snack.",
    "BOOST Vanilla Simply+ Mango Lassi is a refreshing and nourishing delight made with just five ingredients. Not only is this quick and easy to make but it is also packed with goodness that will leave you feeling satisfied. The combination of the smooth vanilla flavour and the natural sweetness of mangoes creates a harmonious blend. For added richness, sprinkle crushed pistachios, dried rose petals or saffron strands on top.",
    "Rich, creamy taste, long-lasting energy. That’s what Team Homan calls a win, win.",
    "Healthy smoothies don’t have to taste so… healthy. Fuel up for the big game with a mix of spinach, kale, mango and banana.",
    "Frozen bananas add texture, sweetness and a flavour BOOST to this protein-rich smoothie. Dates are a source of fibre and potassium.",
    "Brighten up your morning with this energy-boosting and protein-rich smoothie.",
    "Give your oatmeal an exotic feel with the warm flavours of chai.",
    "Start the day with a cool and creamy chocolate smoothie with protein and fibre, plus a little kick from cayenne pepper."
  ]
}