{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/aero-caramel-truffles-yule-log-cake",
    "category": "Recipe",
    "title": "AERO Caramel Truffles Yule Log Cake",
    "n_tokens": 540,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/a4dfd3d53f5f85010407250811ff5c08_yule-log-cake-(960x640).jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "AERO Caramel Truffles Yule Log Cake",
    "Prep time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "300\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "¾ cup white flour",
    "⅓ cup cocoa powder + 2 tbsp to sprinkle",
    "1 tsp baking powder",
    "¼ tsp salt",
    "4 large eggs, divided",
    "¾ cup sugar",
    "¼ cup and a tbsp sour cream",
    "¼ cup butter, melted",
    "1 tsp vanilla extract",
    "Oil spray for the pan",
    "1 pint raspberries, divided",
    "1 ¼ cup heavy cream, cold",
    "¼ cup sugar",
    "½ pack roughly chopped Aero Caramel Truffles",
    "¾ cup heavy cream",
    "6 oz dark chocolate, chopped",
    "½ pack Aero Caramel Truffles",
    "Instructions",
    "Preheat your oven to 350°F and line a 12x17 jelly roll sheet pan with parchment paper",
    "In a small bowl combine flour, cocoa powder, baking powder and salt. Set aside",
    "Separate yolk and white in different bowls. With a wooden spoon, mix yolks and sugar until creamy, then add sourcream, melted butter and vanilla extract and mix until combined. Add the flour mixture and stir until all themixture looks wet",
    "With a hand mixer, whip the whites on high speed until stiff peaks form, about 3 to 4 minutes",
    "Fold the eggs gently into the chocolate mixture without over mixing, until fully incorporated",
    "Spray the pan with oil and pour in the cake batter, making sure it spreads evenly. Use a spatula to level.",
    "Cook on the middle rack for 11 to 12 minutes, until the top of the cake springs back when gently pushed",
    "Let the cake cool slightly, for about 10 mins. Meanwhile, sprinkle a clean tea towel with cocoa powder. Quicklyand gently turn the pan with the cake on to the tea towel. Remove the pan and peel back the parchment paper.Gently roll the cake in the tea towel, starting by the short side. Set aside and let it cool for 1 hour",
    "For the filling, mash half of the raspberries until they form a pulp. Set aside.",
    "In a large bowl, whip heavy cream until soft peaks form. Add sugar and reserved raspberry pulp and whip for anextra minute, until stiff peak form. Gently fold in the ½ cup chopped Aero Caramel Truffles. Put in the fridge untilthe cake is ready to use",
    "For the ganache, heat heavy cream over medium heat until it is just about to boil, and steaming. Remove fromheat and add the chocolate chunks, mixing until melted and incorporated. Set the ganache aside to cool beforeusing",
    "When the cake is cool, unroll gently and remove towel. Using a spatula, spread the cream filling until about 1 inchfrom the side. Reroll the cake, the filling will spread. Place on a serving plate, seam down",
    "Pour the ganache mixture over the cake and spread evenly. Let the ganache set for approximately 10 minutes.Using a fork to draw, drag it through the ganache to create a bark-like effect and texture. Decorate the log withthe remaining Aero Caramel Truffles and raspberries. Place in the fridge until serving, at least 2 hours",
    "Just before serving, cut the end of the cake, so you can see the beautiful roll.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}