{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/nesquik-buche-de-noel",
    "category": "Recipe",
    "title": "Nesquik Bûche de Noël",
    "n_tokens": 621,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/216fd4bd1fed29894f12240d33f80dab_nesquick_buche_de_noel-008-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Nesquik Bûche de Noël",
    "A Yule log or bûche de Noël is a traditional Christmas cake.  This gluten-friendly dessert is flavoured with Nesquik and made up of a delicious cream cheese filling. Why not add to the celebration with some fun and festive SMARTIES! Get creative in the kitchen and decorate this classic holiday dessert to your liking. This dessert enjoyed by many French-Canadian families around the holidays will impress any dinner guests.",
    "Prep time:",
    "63\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "88\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (250 mL) Nesquik powder",
    "divided",
    "3/4 cup (175 mL) gluten-free all-purpose flour blend",
    "1/4 tsp (1 mL) salt",
    "4 eggs",
    "separated",
    "3/4 cup (175 mL) granulated sugar",
    "1/2 tsp (2 mL) vanilla extract",
    "6 oz (170 g) brick-style plain cream cheese",
    "at room temperature",
    "1/2 cup (125 mL) icing sugar",
    "sifted",
    "1 tsp (5 mL) vanilla extract",
    "1/2 cup (125 mL) 35% whipping cream",
    "1 cup (250 mL) Smarties",
    "3/4 cup (175 mL) chocolate chips",
    "2 tbsp (30 mL) butter",
    "1 tbsp (15 mL) maple syrup",
    "2 tbsp (30 mL) Nesquik powder",
    "Instructions",
    "Preheat oven to 375°F (190°C). Line bottom of 15- x 10-inch (25 x 38 cm) rimmed baking sheet with parchment paper. Sift together flour, 1/2 cup (125 mL) Nesquik powder, baking powder and salt twice; set aside.",
    "Using electric mixer, beat egg yolks and 1/3 cup (75 mL) sugar for 5 to 7 minutes or until very thick, pale and light yellow in colour. Beat in vanilla; set aside.",
    "In separate bowl, beat egg whites (with clean beaters) on low speed until foamy. Increase speed to high; beat until soft peaks start to form. Sprinkle remaining sugar, 1 tbsp (15 mL) at a time, over top, beating until stiff, glossy peaks form.",
    "Fold half of the egg whites into egg yolk mixture until blended. Fold in remaining egg whites just until incorporated. Sprinkle flour mixture over top; fold in flour mixture just until blended.",
    "Scrape batter into prepared pan; smooth top. Bake for 12 to 15 minutes or until tester comes out clean when inserted into centre.",
    "Sift remaining Nesquik powder generously onto clean kitchen towel. Run thin knife around edge of cake to loosen from side of pan; invert onto towel. Peel off parchment paper. Starting from one short side, roll up cake with tea towel to resemble log. Place rolled cake, seam side down, on rack; let cool completely.",
    "Beat cream cheese until light and fluffy; beat in icing sugar and vanilla. Set aside.",
    "In separate bowl, whip cream until stiff peaks start to form; fold into cream cheese mixture. Refrigerate until ready to use.",
    "Unroll cooled cake. Spread evenly with cream cheese filling, leaving 1-inch (2.5 cm) border around cake. Sprinkle Smarties over top. Roll up without tea towel. Transfer to parchment paper–lined tray. Refrigerate until ready to glaze.",
    "Transfer cake to serving platter. Pour glaze over rolled cake, spreading to coat well (leave ends exposed to reveal roll if desired). Dust with Nesquik powder. Refrigerate until ready to serve.",
    "In heatproof bowl set over saucepan of barely simmering water, melt together chocolate chips, butter and maple syrup until smooth. (Alternatively, microwave in microwave-safe bowl at medium heat, stirring every 30 seconds, for 1 to 2 minutes or until melted.) Let stand for about 5 minutes or until cooled.",
    "Tips",
    "Get Creative",
    "If desired, drag tines of fork through glaze to make textured lines resembling tree bark or scatter extra Smarties over top if desired.",
    "To add a tree branch",
    "Diagonally slice 3-inch (8 cm) from one end of cake, after filling and rolling cake and before glazing. Place angled side against side of cake to form branch.",
    "What you need",
    "How to prepare"
  ]
}