{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/caribbean-rice-and-peas-made-maggi",
    "category": "Recipe",
    "title": "Caribbean Rice and Peas made with MAGGI",
    "n_tokens": 313,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/2b1435546d1cfce5eaa2234cc9275561_caribbean_rice_and_peas-031-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Caribbean Rice and Peas made with MAGGI",
    "Originally descending from West African tribes, the rice and peas combination was adapted in the Caribbean and has become a delicious staple throughout the Caribbean, with recipes handed down from generation to generation. This versatile dish can be enjoyed throughout the day as a side for breakfast, lunch or dinner.",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "83\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "100\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (250 mL) dried red kidney beans, soaked overnight, strained and rinsed",
    "4 cloves garlic, minced",
    "2 bay leaves",
    "2 green onions, chopped",
    "2 sprigs fresh thyme",
    "1 can (14 oz/400 mL) coconut milk",
    "1 red onion, diced",
    "1 Scotch bonnet pepper",
    "1/2 cup (125 mL) vegetable broth",
    "1/4 cup (60 mL) MAGGI Hot and Sweet Sauce",
    "1 tbsp (15 mL) minced fresh gingerroot",
    "2 tsp (10 mL) Creole seasoning",
    "1 tsp (5 mL) salt",
    "1/2 tsp (2 mL) whole allspice berries",
    "1/2 tsp (2 mL) black pepper",
    "2 cups (500 mL) parboiled white rice",
    "Instructions",
    "To large saucepan set over medium-high heat, add kidney beans and 3 cups (750 mL) water; bring to a boil. Add garlic, bay leaves, green onions, thyme, coconut milk, red onion, Scotch bonnet pepper, broth, MAGGI Hot and Sweet Sauce, ginger, Creole seasoning, salt, allspice and pepper; stir to combine. Reduce heat to medium-low and bring to a simmer. Cover and cook, stirring occasionally, for 50 minutes to 1 hour or until beans are extremely tender.",
    "Stir in rice, cover and cook, stirring occasionally, for 25 to 30 minutes or until rice is tender and all liquid has been absorbed. Let stand for 10 minutes.",
    "Discard bay leaves, thyme, Scotch bonnet pepper and allspice berries. Fluff with fork and serve while hot.",
    "Tips",
    "Serve as a side dish for jerk chicken, Escovitch fish or brown stew fish.",
    "What you need",
    "How to prepare"
  ]
}