{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/coconut-meatball-curry-made-maggi",
    "category": "Recipe",
    "title": "Coconut Meatball Curry made with MAGGI",
    "n_tokens": 500,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/333ad62df5940dab69296477ba4ec6fa_coconut_meatball_curry-025-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Coconut Meatball Curry made with MAGGI",
    "Packed with hidden veggies, this curry-inspired one-pot dish is perfect for big-batch cooking to keep you fuelled for the week! Coconut milk powder provides creaminess that perfectly balances the warm spice of curry paste and the hot and sweet chili sauce.",
    "Prep time:",
    "40\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "85\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1/4 cup (60 mL) vegetable oil, divided",
    "1 onion, minced",
    "4 cloves garlic, minced",
    "1 cup (250 mL) shredded carrot",
    "1 cup (250 mL) shredded zucchini",
    "1 tsp (5 mL) minced fresh ginger root",
    "1 lb (500 g) ground beef",
    "1 egg",
    "1/2 cup (125 mL) seasoned breadcrumbs",
    "3 tbsp (45 mL) MAGGI Liquid Seasoning",
    "2 tbsp (30 mL) ground cumin",
    "1 tbsp (15 mL) MAGGI Hot and Sweet Sauce",
    "1/4 tsp (1 mL) black pepper",
    "2 tbsp (30 mL) vegetable oil",
    "1 onion, diced",
    "1 tbsp (15 mL) minced fresh ginger root",
    "3 tbsp (45 mL) red curry paste",
    "1 tbsp (15 mL) tomato paste",
    "1 can (28 oz/796 mL) diced tomatoes (with juice)",
    "1/2 cup (125 mL) MAGGI Coconut Milk Powder",
    "2 tbsp (30 mL) MAGGI Liquid Seasoning",
    "2 tsp (10 mL) salt",
    "1 tsp (5 mL) black pepper",
    "3 1/2 cups (875 mL) chopped potatoes",
    "3/4 cup (175 mL) packed chopped cilantro, divided",
    "6 green onions, thinly sliced, divided",
    "1 cup (250 mL) rice, rinsed",
    "Instructions",
    "In medium saucepan or Dutch oven set over medium heat, add 2 tbsp (30 mL) oil. Add onion, garlic, carrot, zucchini and ginger; cook, stirring occasionally, for 3 to 5 minutes or until fragrant and softened. Let cool and squeeze liquid out of vegetables; reserve liquid and vegetables separately.",
    "In medium bowl, stir together beef, carrot-zucchini mixture, egg, breadcrumbs, MAGGI Liquid Seasoning, cumin, MAGGI Hot and Sweet Sauce and pepper. Divide mixture into 1-inch (2.5 cm) meatballs. Transfer to large plate.",
    "In the same saucepan or Dutch oven set over medium heat, add remaining oil. In batches, add meatballs and cook, turning occasionally, for 3 to 5 minutes or until evenly browned all over. Transfer to another large plate.",
    "In the same saucepan or Dutch oven set over medium heat, add oil. Add onion and ginger; cook, stirring occasionally, for 3 to 5 minutes or until softened. Add curry paste and tomato paste and cook for 1 minute or until fragrant.",
    "Add diced tomatoes (with juice), reserved vegetable liquid, 4 cups (1 L) warm water, MAGGI Coconut Milk Powder, MAGGI Liquid Seasoning, salt and pepper; stir to combine and bring to a simmer. Add potatoes, 1/2 cup (125 mL) cilantro and half the green onions. Cook, stirring occasionally, for 18 to 20 minutes or until potatoes are slightly tender. Add rice and meatballs. Cook, stirring occasionally, for 8 to 10 minutes or until rice is cooked.",
    "Garnish with remaining cilantro and remaining green onions.",
    "Tips",
    "Tip 1",
    "For a vegetarian option, substitute ground beef with beans, lentils or a plant-based ground-meat alternative.",
    "What you need",
    "How to prepare"
  ]
}