{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/pistachio-and-cocoa-dusted-piccolinos",
    "category": "Recipe",
    "title": "Pistachio & Cocoa Dusted Piccolino Ice Cream Balls Recipe",
    "n_tokens": 277,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/share.png",
        "role": "secondary",
        "alt": "share icon"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/search.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/c07de3fb355ee2ad6a611983931d0d25_hdz-dark-choc-piccolinos.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "PISTACHIO AND COCOA DUSTED PICCOLINOS",
    "Total time:",
    "60\n\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "Share",
    "Print",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "1 pint Chocolate Chocolate Chunk Ice Cream",
    "12 oz 72% Dark Chocolate (or Your Favourite Dark Chocolate)",
    "2 oz canola oil",
    "2 cups Cocoa powder",
    "2 cups Pistachios, Finely Ground",
    "Directions",
    "INSTRUCTIONS",
    "Scoop 16 one-ounce balls of Häagen-Dazs® chocolate chocolate chunk onto a clean, lined (silpat, parchment or nonstick) baking pan. Dunk one-ounce scoop into warm water in between scoops for ease, if needed. Place in the freezer for 30 minutes to firm up.",
    "At 30 minutes, in a small bowl, heat chocolate and oil in a microwave 2-4 minutes or on a double boiler at medium low heat to melt, stirring intermittently until well combined.",
    "With one spoon, carry a frozen one-ounce scoop of gelato from the sheet pan and dunk it in the melted chocolate mixture until entirely coated. Quickly transfer the chocolate coated ice cream ball to a small bowl of coating (crushed pistachio, cocoa powder) using the second spoon to toss the ball entirely in the coating.",
    "With the second spoon, transfer the crumb coated ball to the second lined sheet pan.",
    "Repeat steps 1-4 with the remaining balls and transfer the filled and lined sheet pan to the freezer until ready to eat and/or serve. In an airtight container, piccolinos will keep fresh in the freezer for up to 2 weeks.",
    "Tips",
    "CUSTOMIZE YOUR PICCOLINOS",
    "The possibilities are endless with piccolino dustings! Try graham crumbs, espresso powder, or cookie crumbs as an alternative to cocoa powder and pistachios. A variety of textured and colourful coatings will create a show-stopping visual for your company."
  ]
}