{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/vegan-sensational-samosas",
    "category": "Recipe",
    "title": "Easy & Crispy Vegan Sensational Samosas Recipe",
    "n_tokens": 392,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/d3a7436e15d15deac6c55ef565282e23_210525_gg_travel_indian-samosa-with-mince.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "products",
    "Explore More Recipes",
    "Vegan Sensational Samosas",
    "These delicious vegan samosas are the perfect snack or  starters for your Indian-inspired dinner menu. These savoury goodies are sure to become your next party favourite - enjoy for Diwali or any day of the week!Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Total time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 pack samosa dough or phyllo dough",
    "200 g potatoes",
    "100 g small peas",
    "1 small onion",
    "1 garlic clove",
    "1 green pepper",
    "1 cm fresh ginger",
    "1 tbsp garam masala",
    "2 tsp turmeric",
    "chili pepper and salt",
    "oil for frying",
    "Instructions",
    "Prepare the samosa dough according to the recipe or use ready-made filo dough.",
    "Peel and cut the potatoes into small cubes. Boil the peas and potatoes briefly in boiling water till they’re just done and rinse them under cold water. Chop the onion, garlic and green pepper (seeded flesh) and grate the ginger.",
    "Fry the onion, garlic, pepper and ginger in some oil until translucent. Add garam masala and turmeric and fry for a while. Add the mince and fry with a fork. Stir in the potato cubes and peas and season with salt and chili pepper.",
    "Roll out the dough thinly with some flour and cut out squares of approx. 12 x 12 cm. Spread some filling in the top right corner. Brush the dough with some water.",
    "Fold from top left to right below the dough over the filling and seal the edges. Now fold from left bottom to right above the 'excess' dough over the filling and seal with some water.",
    "Deep-fry the samosas in 170°C frying oil for a few minutes until brown and crispy. * Bake the samosas for about 15 minutes at 180°C in the oven if you are using filo dough (greased with oil).  Serve with 'raita' (yogurt cucumber sauce) mango 'chutney' and or tomato 'relish' (Indian tomato salsa)",
    "(In case you want to make the dough yourself) Samosa dough: 225 g flour 125ml water 1 tbsp oil (groundnut or sunflower) salt",
    "What you need",
    "How to prepare"
  ]
}