{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipes/beverage-0",
    "category": "Recipe",
    "title": "Refresh with These Beverage Recipes",
    "n_tokens": 371,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Mocha-Sphere.jpg",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Mexican-hot-Choc.jpg",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Kitkat-Whipped-Choc.jpg",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Decorated-Carnation-Hot-Chocolate-Mocha.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/caramel_latte.jpg",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "beverage",
    "Unleash your inner chocolatier and have a blast preparing these indulgent treats. As you melt open the chocolate shell, be prepared to discover a hidden treasure of mini marshmallows, perfectly blended with the richness of Carnation Hot Chocolate and your favourite Nescafé. These mocha spheres offer a special moment to cozy up and treat yourself to a comforting and heavenly chocolatey experience.",
    "Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip.",
    "Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise.",
    "A rich, velvety caramel latte, with smooth, frothy milk and a hint of indulgent sweetness.",
    "This smooth iced classic sweetened with vanilla extract is the ultimate pick-me-up.",
    "The classic cappuccino, infused with the delicate, slightly sweet flavour of vanilla. Enjoy every sip with flair.",
    "Our maple pecan latte recipe combines sweet and nutty flavours for a delicious taste experience - not to mention it's super simple to make too!",
    "A chilled favourite of rich coffee sweetened with caramel. Oh so refreshing!",
    "Elevate your iced coffee with toasty notes of brown sugar and cinnamon.",
    "A robust Vietnamese style iced coffee with the bold taste you love, stirred with condensed milk and served with ice.",
    "Ah, the first of fall. Cozy sweaters, crunchy leaves and pumpkin spice! It’s easy to whip up a fancy pumpkin spice latte at home with Nescafé coffee, silky steamed froth and a hint of spice.",
    "Open up the possibilities of your day with this cozy recipe."
  ]
}