{
  "metadata": {
    "title": "Raspberry Brown Butter Crêpes Recipe Ice Cream",
    "n_tokens": 363,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/share.png",
        "role": "secondary",
        "alt": "share icon"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/search.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/b44e198b20060328fa4f52a800dcba7c_hdz_tfg_crepes.jpg",
        "role": "recipe",
        "alt": ""
      }
    ],
    "url": "https://www.madewithnestle.ca/recipe/raspberry-brown-butter-crepes-la-mode",
    "category": "Recipe"
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "RASPBERRY BROWN BUTTER CRÊPES À LA MODE",
    "Total time:",
    "20\n\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "8\n\t\t\t\t\t\t\t\t\t\tCrêpes à la mode",
    "Skill level:",
    "Intermediate",
    "Share",
    "Print",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "3 tablespoons Butter",
    "1 cup all-purpose flour",
    "3 Large Eggs",
    "2 tablespoons granulated sugar",
    "2 cups 2% Milk",
    "2 tablespoons Vegetable oil",
    "1/2 pint fresh raspberries",
    "1/2 Lemon",
    "zested and juiced",
    "2 tablespoons Sugar",
    "1/2 pint White Chocolate Raspberry Truffle",
    "Directions",
    "INSTRUCTIONS",
    "Heat a non stick 5.5” frying pan on medium high heat. Melt the butter, swirling the pan until the butter starts to brown and smells nutty. Set aside.",
    "In the meantime, combine flour and sugar in a large bowl. Make a well, add the eggs and mix well. Slowly whisk the milk in, mixing until incorporated before pouring more. Add the brown butter and mix well. Cover with a tea towel and set aside.",
    "Set up your crepe station. Heat the frying pan you used to melt the butter on medium high heat. Have your bowl with the crepe batter and a ladle ready, as well as a plate to place the cooked crepes and a piece of foil to keep them warm. In a little bowl, pour the oil, and place a piece of paper towel in.",
    "Once ready, use the soaked paper towel to dab the pan with oil. This will allow you to have enough oil on the pan to cook the crepes, without frying them, which will make them lighter and fluffier.",
    "With a ladle, pour about 1/4 of a cup of the crepe batter and swirl the pan, making sure that the batter covers all the surface. Cook for 1 minute and half to 2 minutes, flip and cook for an extra 30 seconds. Set aside on a plate, cover with foil. Repeat with the remaining oil and batter.",
    "To serve, place 3 crepes on a plate, scoop one scoop of HÄAGEN-DAZS® White Chocolate Raspberry Truffle Ice Cream, drizzle with the warm coulis and garnish with fresh raspberries.Enjoy immediately!",
    "Tips",
    "THE PERFECT CRÊPES",
    "Cook the crêpes on one side until they’re mostly done and then flip until done – the secret to keeping them soft and fluffy!"
  ]
}