{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/deconstructed-banana-boat-smores",
    "category": "Recipe",
    "title": "DECONSTRUCTED BANANA BOAT S’MORES",
    "n_tokens": 277,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/1f44aa73db6d4ec5e9bad594ceeb2996_s_mores-kit-(960x640-english).jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "DECONSTRUCTED BANANA BOAT S’MORES",
    "Prep time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "4 bananas",
    "1 Aero S’mores Kit",
    "Instructions",
    "Preheat your oven to 350°F with the rack in the middle position and line a baking sheet with aluminum foil.",
    "Cut 12 marshmallows in half and separate each Aero bar into individual squares, leaving 24 whole and crumblingor rough chopping the remaining squares",
    "Slice down the middle of each banana stem, about 1 inch from the top. Peel back the skin down to reveal thebanana and reserve each peel to create two boat halves per banana. Slice each banana into coins and dividebetween peels, alternating with marshmallows and Aero squares. Sprinkle with remaining the crumbles of Aerochocolate.",
    "Place into the oven and bake for 10 minutes until chocolate is melted and marshmallows have puffed and turnedlightly golden.",
    "Let cool for 2 minutes, then use graham crackers to dip, scoop and enjoy!",
    "Tips",
    "If cooking over a campfire",
    "Cut two sheets of foil for each banana boat pair, leaving about 3 inches of foil on either side.After the banana boats are built, gently fold the foil edges over each pair of banana boats, folding and sealing edges along the middle, pinching the ends in and creating a small foil tent. Repeat for the other banana.Place foil wrapped banana boats on top of hot coals, or on the edges of your fire. Let cook for about 6 minutes, or until chocolate is melted and marshmallows are cooked and golden.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}