{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipes/smarties-stop-signs",
    "category": "Recipe",
    "title": "SMARTIES Stop Signs",
    "n_tokens": 239,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/64e6988f860875f9fee9b87554c139ff_smarties_stop_signs.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "SMARTIES Stop Signs",
    "Candy-coat your fun with this special SMARTIES Stop Sign!",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "12\n\t\t\t\t\t\t\t\t\t\t\tCookies",
    "Skill level:",
    "Easy",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 box (45 g) SMARTIES",
    "12 fig cookies",
    "2 tablespoons vanilla frosting",
    "Instructions",
    "\"To make the 'light', take your choice of cookie and scoop three vertical dabs of vanilla frosting on the front of the biscuit. Place each of your three SMARTIES stop light colours on the dabs.",
    "Set cookie in fridge to allow SMARTIES to stick to frosting (approximately 30minutes).",
    "Once your SMARTIES lights are set into frosting, it's time to build the 'post section of the stop light. (Paper straws work best for this section, but a flat 'stir stick' can work, too) The straws will be inserted into the filling of your cookie. Before inserting the straw into the filling, flatten the top of the straw about 1-2 inches - this action makes it easier to insert the straw into the fill without breaking the cookie. Carefully push your straw into the fig or vanilla to your desire 'light post' length. Be gentle! Pushing the straw too hard will push the SMARTIES off of the frosting. Ta-da! You've just made a SMARTIES stop light.",
    "Tips",
    "Try it with marshmallow!",
    "For a quicker recipe, just cut jumbo marshmallows in half lengthwise and push SMARTIES onto the sticky side!",
    "What you need",
    "How to prepare"
  ]
}