{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/decorated-carnation-hot-chocolate-mocha",
    "category": "Recipe",
    "title": "Decorated Carnation Hot Chocolate Mocha",
    "n_tokens": 244,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-10/Decorated-Carnation-Hot-Chocolate-Mocha.png",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "Decorated Carnation Hot Chocolate Mocha",
    "Prep time:",
    "13\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "Servings:",
    "Skill level:",
    "Easy",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "125ml Milk",
    "25g Carnation Hot Chocolate",
    "Nescafé Rich",
    "Whip Cream",
    "NESQUIK",
    "Nestlé Professional Rolo",
    "Instructions",
    "Start by warming up your milk. You can do this on the stove or in the microwave until it is warm but not boiling.",
    "Add 25g of Carnation Hot Chocolate and 1 teaspoon of Nescafé Rich to the glass. Stir well until the hot chocolate and coffee are fully dissolved.",
    "Fill the glass with the remaining milk, leaving about ½ inch of space at the top for the whip cream.",
    "Now, it's time to add the whip cream. You can either spoon it on top or use a piping bag for a more decorative touch.",
    "To enhance the flavour and presentation, grate some dark chocolate on top of the whip cream. This will add a delightful chocolatey twist.",
    "Use NESQUIK as a chocolate drizzle.",
    "Finally, sprinkle some Carnation Hot Chocolate powder over the whip cream for an extra touch of sweetness.",
    "Tips",
    "Indulge in a heavenly delight: A beautifully decorated mocha crafted with the finest ingredients. Immerse yourself in the velvety richness of Carnation Hot Chocolate and the bold aroma of Nescafé coffee, perfectly blended with creamy milk. Topped with a fluffy cloud of whipped cream, this delightful creation is a cozy treat that will warm your soul and leave you craving for another sip.",
    "What you need",
    "How to prepare"
  ]
}