{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/quality-street-nankhatai",
    "category": "Recipe",
    "title": "Decadent QUALITY STREET Nankhatai Cookies",
    "n_tokens": 415,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/b9a817ad2638857e8be0299ae535587c_qs_final_mwn.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Facts",
    "Diwali",
    "Explore More Recipes",
    "QUALITY STREET Nankhatai",
    "Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season.",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "½ cup icing sugar",
    "½ cup softened ghee or butter at room temperature",
    "1 cup all-purpose flour",
    "½ cup ground almonds",
    "¼ cup plain thick Greek yogurt",
    "1 teaspoon each: ground cardamom seeds, baking powder",
    "15 assorted QUALITY STREET Sweets, chopped",
    "1 tbsp chopped or coarsely powdered pistachios for garnish",
    "Instructions",
    "Preheat oven to 325F. Line a baking tray with parchment.",
    "Combine icing sugar and ghee (or butter) in medium sized mixing bowl. Using a hand blender or a spatula, beat until it is fluffy and lighter in colour, about 1 minute.",
    "Add all-purpose flour, ground almonds, yogurt, cardamom, and baking powder. Mix again for a few seconds until just combined. Mixture will resemble coarse breadcrumbs.",
    "Add the chopped QUALITY STREET Sweets into dough and mix with your fingertips or a spatula until evenly distributed.",
    "Divide dough into about 25 small sized pieces, about an inch in diameter, squeezing gently with your hands to form a loose dough.",
    "With dampened or lightly greased hands, shape each piece into a smooth ball and flatten slightly.",
    "Place on prepared baking tray. Repeat similarly with remaining pieces of dough.",
    "Place baking tray in oven and bake for 20 mins. Nankhatai should be lightly golden brown and slightly cracked on top. Cookies will crisp up and harden slightly as they cool.",
    "Cool for 10 mins in baking tray, then transfer to serving platter.",
    "Dust top of Nankhatai lightly with powdered pistachios for a lovely colour contrast. Store extras in an airtight container.",
    "Tips",
    "Serving Suggestion",
    "Enjoy warm Nankhatai with a cup of tea or coffee!",
    "Substitution",
    "Use labneh instead of Greek yogurt.",
    "Chef’s Tip",
    "Use fresh ground cardamom seeds for best aroma and flavour.If ghee turns into a golden liquid during warmer weather, chill in the refrigerator for an hour or so until it is semi solid.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}