{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/masala-vegetable-fritter-eggs-benedict",
    "category": "Recipe",
    "title": "Masala Vegetable Fritter Eggs Benedict",
    "n_tokens": 567,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/9d054906d3401b6b04ddeb9898b291c1_masala_vegetable_fritter_eggs_benedict-044-16x9_(1)-4mb.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Masala Vegetable Fritter Eggs Benedict",
    "Using whole veggies, and Indian-style garam masala – a fragrant spice blend made with a blend of warm, fragrant spices – this delicious twist on a brunch-time favourite is sure to be a delicious and eco-friendly hit! Blender hollandaise makes preparation a breeze, so less time is spent fussing in the kitchen and more time can be spent eating and enjoying around the table!",
    "Prep time:",
    "26\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "42\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "73\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 large Yukon gold potato, shredded",
    "1 large carrot, shredded",
    "1 large zucchini, shredded",
    "1 tsp salt",
    "3/4 cup (175 mL) Original Carbonated Perrier Glass Bottle (330mL each)",
    "1/2 cup (125 mL) all-purpose flour",
    "1 tbsp + 2 tsp (25 mL) cornstarch",
    "2 tsp (10 mL) garam masala",
    "1 tsp (5 mL) baking powder",
    "1/2 (2 mL) tsp salt",
    "1/4 tsp (1 mL) black pepper",
    "1/4 cup (60 mL) vegetable oil, divided",
    "1/4 cup (60 mL) white vinegar",
    "8 eggs",
    "3 free range egg yolks",
    "1 1/2 tsp (7 mL) lemon juice",
    "1/2 cup (125 mL) melted unsalted butter",
    "1/4 tsp (1 mL) turmeric",
    "1/2 tsp (2 mL) salt",
    "1 tbsp (15 mL) thinly sliced green onion",
    "Instructions",
    "In a large bowl, combine potatoes, carrots, zucchini and salt. Let stand for 10 to 15 minutes for the salt to drain moisture out the vegetables. With hands, squeeze to release excess moisture; set aside.",
    "In a large bowl, combine Original Carbonated Perrier, flour, cornstarch, garam masala, baking powder, salt and black pepper until a batter forms. Fold in shredded vegetables until well coated. Carbonated water will help make the batter light and airy, and result in the perfect crispiness.",
    "In a large skillet set over medium heat, add 2 tbsp (30 mL) oil. In batches, transfer 1/3 cup (75 mL) vegetable batter into skillet. Cook for 2 to 3 minutes per side or until slightly golden and cooked through. Repeat with remaining oil and batter to make 8 fritters in total. Transfer to a paper towel-lined plate or baking sheet. Let stand for 10 to 15 minutes or until oil is absorb. Refry fritters for an additional 3 to 5 minutes or until crispy.",
    "Bring a large pot with 2L of water to a light simmer set over medium heat. Stir in vinegar and reduce heat to low.",
    "Stir water with a spoon to make a whirlpool in the centre.  Crack egg into whirlpool. Cook for 3 minutes for soft-poached eggs. Remove egg with slotted spoon and transfer to paper towel-lined plate to remove excess liquid. Repeat with remaining eggs.",
    "In a blender, add egg yolks and lemon juice. Pulse until smooth. With motor running on low, very slowly drizzle in melted butter until mixture is smooth and emulsified. Add in turmeric. Season with salt.",
    "Place poached eggs over vegetable fritters. Spoon hollandaise evenly over top. Sprinkle with green onions before serving.",
    "Tips",
    "Minimize Food Waste",
    "This recipe is perfect for using vegetables that are past their prime, or from the “imperfect” section to minimize food waste!",
    "Make it Gluten-Free!",
    "Also delicious with all-purpose gluten-free flour!",
    "Feeding a smaller crowd?",
    "Leftover fritters can be cooled and wrapped in tin foil or transferred to airtight container and refrigerated for up to two weeks, or frozen for up to 3 months.  Can be reheated in skillet, oven, or microwave.",
    "What you need",
    "How to prepare"
  ]
}