{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/rich-maple-bison-chili-nescafe",
    "category": "Recipe",
    "title": "Rich Maple Bison Chili with NESCAFE",
    "n_tokens": 534,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/707fff7e992e079556f214ff70674a4e_maple_coffee_bison_chili-035_16x9_(3).jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Rich Maple Bison Chili with NESCAFE",
    "Bison is a rich source of protein, while being low in fat. Consuming less grass than cattle, bison is a reliable and abundant food source – providing not only nutrition for Indigenous people, but hides to make clothing and blankets, bones to create tools, jewelry, and fats used for cooking. All parts of the animal were used – and this chili recipe is a nod to sustainable cooking inspired by the First Nations and Métis communities.",
    "Prep time:",
    "25\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "70\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2 tbsp (45 mL) vegetable oil",
    "1 onion, minced",
    "2 celery ribs, sliced",
    "6 cloves garlic, minced",
    "1 1/2 lb (750 g) ground bison",
    "2 tbsp (30 mL) ground cumin",
    "2 tbsp (30 mL) smoked paprika",
    "2 tsp (10 mL) salt",
    "1 tsp (5 mL) black pepper",
    "2 tbsp (30 mL) tomato paste",
    "1 red bell pepper, diced",
    "1 can (15 oz) kidney beans",
    "2 medium Roma tomatoes, diced",
    "1 can (15 oz) pinto beans",
    "2 cups (500 mL) beef broth",
    "1 tbsp (15 mL) Nescafe Rich Instant Coffee",
    "1 tbsp (15 mL) Carnation Hot Chocolate Powder",
    "1 tsp (5 mL) cayenne",
    "1/4 + 2 tbsp (75 mL) Maggi Liquid Seasoning",
    "1 tbsp cornstarch",
    "1 tbsp (15 mL) maple syrup",
    "Instructions",
    "In a large high-sided skillet or Dutch oven set over medium-high heat, add oil. Add onions and celery. Cook for 3 to 5 minutes or until softened. Add garlic and cook for 1 to 2 minutes or until fragrant.",
    "Add bison, cumin, paprika, salt and black pepper. Cook for 8 to 10 minutes or until meat is browned. Stir in tomato paste and cook for 1 to 2 minutes or until fragrant.",
    "Add bell peppers, tomatoes and beans. Cook for 3 to 5 minutes until softened and heated through.",
    "Stir in broth, Nescafe Rich Instant Coffee, Carnation Hot Chocolate Powder, cayenne and Maggi Liquid Seasoning.",
    "Bring to a boil, then reduce heat to medium-low. Simmer for 18 to 20 minutes, stirring occasionally, until chili is thickened and flavourful.",
    "Add ground bison and cook for 3 to 5 minutes, stirring occasionally, until starting to brown. Add onion, garlic, red pepper, and celery and cook for an additional 3 to 5 minutes, or until softened and fragrant. Add tomato paste, salt, and pepper and cook, stirring, for 1 to 2 minutes, or until combined.",
    "Stir in Nescafe Rich Instant Coffee, Carnation Hot Chocolate Powder, chili powder, and Maggi Liquid seasoning. Stir and cook for 1 minute.",
    "Stir in beans, tomatoes, beef broth, barbecue sauce, and maple syrup. Bring to a boil, then reduce heat to medium-low. Simmer for 15 to 18 minutes, stirring occasionally, until chili is flavourful.",
    "In a small bowl or cup, combine cornstarch and 3 tbsp warm water to make a slurry. Add to chili mixture until thickened. Finish with maple syrup.",
    "Serve chili with warm Bannock, fry bread, or cornbread, if desired.",
    "Tips",
    "Ground bison",
    "Ground bison can be found in specialty food stores or can be sourced through a local butcher.",
    "For vegetarian chili",
    "For vegetarian chili omit meats and use all beans and vegetable broth.",
    "What you need",
    "How to prepare"
  ]
}