{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/middle-eastern-cauliflower-bites-coffee-tahini-dip",
    "category": "Recipe",
    "title": "Middle Eastern Cauliflower Bites with Coffee Tahini Dip",
    "n_tokens": 372,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/fa19c49e40f551b11d05e5183e8e927f_middle_eastern_cauliflower_bites_with_tahini_dip-044_960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Middle Eastern Cauliflower Bites with Coffee Tahini Dip",
    "Tahini, or toasted ground sesame seeds, comes from Persia, where it was called “ardeh.” For hundreds of years, only the aristocracy and wealthy could obtain the ingredients to make tahini – in some cultures, tahini was used as currency! Enjoy this delicious healthy appetizer that gets extra depth of flavor from Nescafé Gold.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "25\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "45\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 1/2 large cauliflowers, separated into florets",
    "1/4 cup olive oil, divided",
    "3 tsp salt, divided",
    "1 1/2 tsp pepper, divided",
    "1 tbsp Nescafé Gold Dark Roast",
    "2/3 cup tahini paste",
    "1/3 cup + 2 tbsp lemon juice",
    "4 tbsp honey",
    "2 cloves garlic, minced",
    "1 tbsp chopped fresh parsley",
    "Lemon wedges, for serving",
    "Instructions",
    "In large bowl, toss together cauliflower florets, 2 tbsp oil, 2 tsp salt and 1 tsp pepper.",
    "Heat remaining oil in large skillet set over medium-high heat; cook cauliflower florets, without stirring, for 3 to 5 minutes or until deep golden brown. Turn florets; cook for 2 to 3 minutes or until tender and browned all over. Transfer to plate.",
    "Meanwhile, in small bowl, whisk 1/4 cup warm water with Nescafé Gold Dark Roast. Stir in tahini, lemon juice, honey, garlic, and remaining salt and pepper. Transfer to small bowl.",
    "Serve cauliflower with tahini and coffee sauce. Garnish with parsley. Serve with lemon wedges.",
    "Tips",
    "Tip 1",
    "Sprinkle with pomegranate seeds and/or toasted pine nuts if desired.",
    "Tip 4",
    "Serve your cauliflower in a kasria; a beautiful hand-painted vessel often used in the Middle East for serving crowds.",
    "Tip 3",
    "Use a mortar and pestle to mash garlic for an authentic Middle Eastern touch.",
    "Tip 2",
    "Alternatively, roast cauliflower tossed with olive oil on a rimmed baking sheet in 425F oven for 25 to 30 minutes or until golden brown.",
    "What you need",
    "How to prepare"
  ]
}