{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/s-pellegrino-chatpati-shikanji",
    "category": "Recipe",
    "title": "S. PELLEGRINO Chatpati Shikanji",
    "n_tokens": 361,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/2b57b6237e2215e5414c0598fb5646da_san_pell_horizontal_mwn_final.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "S. PELLEGRINO Chatpati Shikanji",
    "Add a special sparkle to your Diwali celebrations with S.PELLEGRINO Naturali Limonata Chatpati Shikanji! Treat yourself and your guests to this zesty mix of ginger, mint, spice and lemon that will linger on your palate sip after sip. S. Pellegrino Limonata enhances this drink with its refreshing and bright flavours made with carefully selected Sicilian lemons.",
    "Prep time:",
    "10\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "40\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1/4 cup Water, bottled, generic",
    "1 1/2 teaspoon Spices, ginger, ground",
    "¼ cup tightly packed fresh mint leaves, chopped",
    "2 Strips Lemon peel, raw",
    "1/6 tablespoon Peppermint, fresh",
    "¼ teaspoon chaat masala",
    "1 cup crushed ice cubes",
    "1 can (330ml) S. PELLEGRINO Naturali Limonata",
    "Instructions",
    "Combine water, ginger, mint and chaat masala in small bowl, stirring until mixed.",
    "Steep covered for 30 mins or for longer in the refrigerator.",
    "Rim serving glasses with lemon juice and chaat masala for a pretty effect, while the ginger mixture steeps. To do this, dip the rim of each glass in a bowl of lemon juice, roll lightly in chaat masala and allow to dry completely.",
    "Set a small fine mesh sieve or strainer over a small bowl and pour ginger mixture over, pressing against the solids to extract all the liquid. This will form a flavourful ginger mint extract.",
    "Divide extract equally between two serving glasses.",
    "Fill with ½ cup ice cubes each.",
    "Top up with S. PELLEGRINO Naturali Limonata to complete the drink, stirring lightly to mix. Serve right away to keep the drink nice and bubbly!",
    "Garnish with thinly sliced lemon rings and additional mint sprigs.",
    "Tips",
    "Extras!",
    "Double the recipe for the extract and store in the refrigerator for up to a week.",
    "Mix It Up!",
    "Use any favourite flavour of S. PELLEGRINO Italian Sparkling Drinks!",
    "Make It More Chatpata!",
    "Add ¼ teaspoon toasted ground cumin seeds and ¼ teaspoon powdered black salt for a stronger savoury flavour.",
    "Options",
    "Omit the chaat masala if desired.",
    "Chaat Masala is a blend of amchur (dried mango powder), toasted cumin seeds, black salt and ground ginger. It is easily available in any grocery store.",
    "What you need",
    "How to prepare"
  ]
}