{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/orange-scented-gulab-jamun",
    "category": "Recipe",
    "title": "Orange scented Gulab Jamun",
    "n_tokens": 348,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/14f6fa5c9f8cc85065f6c0ef7f02e10b_nestle_eid_recipe__web_orange_scented_gulab_jamun.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Orange scented Gulab Jamun",
    "Gulab jamun is an Indian dessert of fried dough balls that are soaked in a sweet, sticky sugar syrup. As per tradition, the syrup has a delicate rose flavour: Gulab means 'rose water' and jamun refers to a berry of a similar size and colour.Try making this delicious orange scented Gulab Jamun and elevate your next dinner party.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "375g Caster sugar",
    "250ml Water",
    "300g Plain flour",
    "1tsp Baking powder",
    "1 Pinch ground nutmeg",
    "Ghee or Ground nut oil to fry",
    "A sprinkling of toasted desiccated coconut",
    "1tsp baking soda",
    "Instructions",
    "Make The Syrup",
    "Make a thin syrup, by boiling the sugar and water together for a few minutes, allow to cool then stir in the orange essence.",
    "Make the dough",
    "Sift together the dry ingredients into a bowl and stir in enough of the condensed milk to form a soft dough.",
    "Prepare the Gulab Jamun",
    "Shape the dough into small sausages approximately 2cm (¾\") in length then fry gently in a pan of hot oil. You should aim to cook 3-4 jamuns at a time as they expand during cooking. Do not allow the oil to over heat as the jamuns will cook too quickly on the outside but not be cooked through in the middle.One of the top tips for perfect  Orange Scented Gulab Jamuns is to make sure you shape the jamuns properly before frying otherwise they could split open. Make sure you grease your hands before rolling them into shape and fry them immediately.",
    "Drain the gulab jamuns",
    "Drain the jamuns on kitchen paper then place into the orange syrup. Serve hot or cold with toasted coconut, to finish.",
    "What you need",
    "How to prepare"
  ]
}