{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/one-pot-hidden-veggie-bolognese",
    "category": "Recipe",
    "title": "One-Pot Hidden-Veggie Bolognese",
    "n_tokens": 395,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/9cc6ae1fc742c57c18f868309b15069e_one_pot_hidden_veggie_bolognese-024-960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "One-Pot Hidden-Veggie Bolognese",
    "A veggie-packed variation on the traditional Italian ragù, this Bolognese is a one-pot dish that’s great for making ahead and preparing in batches for busy weeknight dinners. Originally from the Emilia-Romagna region, “Bolognese” refers to a slow-cooked meat sauce that was first developed in Bologna, Italy. This recipe includes loads of hidden vegetables so you can enjoy comfort-food classics while still getting important nutrients!",
    "Prep time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "55\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "75\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1/4 cup (60 mL) olive oil, divided",
    "2 ribs celery, roughly chopped",
    "2 red bell peppers, roughly chopped",
    "1 carrot, thinly sliced",
    "1 onion, roughly chopped",
    "5 cloves garlic, peeled and smashed",
    "2 tbsp (30 mL) tomato paste",
    "1 can (28 oz/796 mL) diced tomatoes (with juice)",
    "4 tbsp (60 mL) dried Italian seasoning, divided",
    "1/4 cup (60 mL) MAGGI Liquid Seasoning, divided",
    "1 1/2 lbs (750 g) lean ground beef",
    "1/4 tsp (1 mL) salt",
    "1/2 cup (125 mL) grated Parmesan cheese, divided",
    "1 lb (500 g) spaghetti pasta",
    "1/4 cup (60 mL) packed torn fresh basil leaves",
    "1 tbsp (15 mL) chopped fresh parsley",
    "Instructions",
    "In medium saucepan or Dutch oven set over medium heat, add 2 tbsp (30 mL) oil. Add celery, red peppers, carrot, onion and garlic; cook, stirring occasionally, for 8 to 10 minutes or until softened and fragrant.",
    "Add tomato paste and cook, stirring frequently, for 1 to 2 minutes. Add diced tomatoes (with juice), 3 cups (750 mL) water, 3 tbsp (45 mL) Italian seasoning and 2 tbsp (30 mL) MAGGI Liquid Seasoning. Cook, stirring occasionally, for 15 to 20 minutes or until vegetables are tender. Transfer to blender and pulse until smooth.",
    "In extra-large skillet or large saucepan set over medium-high heat, add remaining oil. Add ground beef, remaining MAGGI Liquid Seasoning and remaining Italian seasoning. Cook, stirring occasionally and breaking up with wooden spoon, for 8 to 10 minutes or until browned. Season with salt.",
    "Pour in vegetable sauce and bring to a simmer. Reduce heat to medium, add 1/4 cup (60 mL) Parmesan cheese and stir to blend. Add spaghetti and cook, stirring occasionally, for 12 to 15 minutes or until spaghetti is cooked and sauce has thickened. Stir in basil.",
    "Transfer to serving platter, sprinkle with remaining Parmesan cheese and garnish with parsley before serving.",
    "What you need",
    "How to prepare"
  ]
}