{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/kitkat-bar-matka-kulfi",
    "category": "Recipe",
    "title": "KitKat Roasted Almond Wafer Bar Matka Kulfi",
    "n_tokens": 373,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/d3ec551eb0a39952cdd1015594cab714_kitkat_kulfi_1.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Explore More Recipes",
    "KitKat Bar Matka Kulfi",
    "A delicious way to celebrate Eid, our Matka Kulfi is going to bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka!",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 cup (250 ml) Whipping cream",
    "1 can (300 ml) Sweetened condensed milk",
    "1 can (370 ml) Evaporated milk",
    "1/2 teaspoon Ground cardamom",
    "1/4 teaspoon Saffron strands",
    "¼ cup Sliced almonds, crushed",
    "2 (120g) KitKat Wafer Bars, crushed",
    "Instructions",
    "Combine all the ingredients, except KitKat Wafer Bars in a mixing bowl. Mix well.",
    "Cover bowl tightly and freeze overnight.",
    "Remove from freezer, uncover and rest at room temperature for 1 hour or until kulfi is starting to thaw and soften. Break up kulfi into smaller pieces with a knife. Using a hand blender, blend kulfi until smooth or stir with a fork until smooth.",
    "Fold in crushed KitKat Wafer Bars, reserving ½ cup for garnish. Cover and freeze again for another 4 hours or longer.",
    "Scoop kulfi into a matka (earthen pot), sprinkle with crushed KitKat Wafer Bars and serve.",
    "Tips",
    "Ingredient disclaimer",
    "We prioritize transparency to meet the needs of our diverse consumers and provide ingredient details about Nestle products used in our recipes. We are happy to share that all of the following Kit Kat tablets are made in accordance with halal dietary restrictions, although are not halal certified:KIT KAT Classic Tablet 120gKIT KAT Hazelnut Crunch Tablet 120gKIT KAT Caramel Crisp Tablet 120gKIT KAT Cookie Crumble Tablet 120gKIT KAT Gooey Double Chocolate 112 gKIT KAT Gooey Salted Caramel 112 gKIT KAT Gooey Cookie Dough 111 g",
    "Mix it up!",
    "Use any of your favourite KitKat bars!",
    "Serving suggestion",
    "Serve in individual matkas if available.",
    "Garnish",
    "Sprinkle crushed pistachios and saffron along with the crushed KitKat Wafer Bars to garnish the kulfis.",
    "How to crush KitKat wafer bars",
    "Place KitKat bars in a large Ziploc bag. Crush with a rolling pin, hammer or with a heavy object until they are reduced to a coarse powder with some larger pieces.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}