{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/classic-butter-tarts-topped-turtles",
    "category": "Recipe",
    "title": "Classic Butter Tarts topped with TURTLES",
    "n_tokens": 308,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/def7522668c528c09c43fa56c6591ecf_turtles_butter_tarts-025.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Classic Butter Tarts topped with TURTLES",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a classic dessert.",
    "Prep time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "12\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "102\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1-1/2 cups all-purpose flour",
    "1/4 tsp salt",
    "1/4 cup cold butter, cubed",
    "1/4 cup lard or butter, cubed",
    "egg yolk",
    "1 tsp vinegar",
    "ice water as needed",
    "1/2 packed brown sugar",
    "1/2 corn syrup",
    "1 egg",
    "1 cup softened butter",
    "vanila",
    "1 cup chopped TURTLES",
    "Instructions",
    "Crust",
    "In large bowl, whisk flour and salt.",
    "With a pastry blender or two knives, cut in butter and lard until mixture resembles coarse crumbs with a few larger pieces",
    "In liquid measure, whisk egg yolk with vinegar; add enough ice water to make 1/3 cup.",
    "Sprinkle over flour mixture, stirring briskly with fork until pastry holds together. Press into disc; wrap in plastic wrap and refrigerate until chilled, about 1 hour.",
    "Make-ahead: Refrigerate for up to 3 days",
    "Filling",
    "In bowl, whisk together brown sugar, corn syrup, egg, butter, vanilla, vinegar, and salt until blended; set aside.",
    "On lightly floured surface, roll out pastry to 1/8-inch (3 mm) thickness. Using 4-inch (10 cm) round cookie cutter (or empty 28 oz/796 ml can) cut out 12 circles, re-rolling scraps once if necessary. Fit into 2-3/4- x 1-1/4-inch (7 x 3 cm) muffin cups then pour filling into each tart",
    "Bake in bottom third of 450 F oven until filling is puffed and bubbly and pastry are golden, about 12 minutes.",
    "Let stand on rack for one minute. Run metal spatula around tarts to loosen; carefully slide spatula under tarts and transfer to rack to let cool. Add chopped TURTLES on top",
    "Tips",
    "For dinner parties, serve with TURTLES frozen dessert",
    "What you need",
    "How to prepare"
  ]
}