{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/chocolate-hazelnut-and-pistachio-burfi",
    "category": "Recipe",
    "title": "Chocolate Hazelnut and Pistachio Burfi",
    "n_tokens": 401,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/be5225ccac29717236f19f2c2bbe55d9_chocolate_hazelnut_pistachio_burfi-029-960x6400-_low_res.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Chocolate Hazelnut and Pistachio Burfi",
    "Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "30\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 1/2 cups (375 mL) chopped Quality Street sweets, divided",
    "1 1/2 cups (375 mL) chopped toasted pistachios, divided",
    "1/3 cup (75 mL) butter",
    "1 pkg (1.7 oz/50 g) Maggi Coconut Milk Powder",
    "1 cup (250 mL) granulated sugar",
    "1 cup (250 mL) whole milk",
    "2 1/2 cups (375 mL) full-fat milk powder",
    "1 tsp (5 mL) cardamom powder",
    "1 tsp (5 mL) freshly squeezed lemon juice",
    "1 tsp (5 mL) vanilla extract",
    "1/2 tsp (2 mL) saffron threads",
    "Instructions",
    "Line 8-inch square baking dish with parchment paper, with overhanging sides.",
    "Sprinkle half the Quality Street Tin assorted chocolates and half the pistachios over top",
    "To large high-sided skillet set over medium-low heat, melt butter to coat skillet. Add Maggi Coconut Milk Powder, sugar and whole milk; stir to combine. Cook, stirring occasionally, for 3 to 5 minutes or until fully dissolved. Reduce heat to low.",
    "Add full-fat milk powder to skillet and cook, stirring constantly to avoid burning, for 5 minutes or until mixture starts to thicken. Stir in cardamom, lemon juice, vanilla and saffron. Cook, stirring occasionally, for 3 to 5 minutes or until mixture is pulling away from sides with no residue. Gently stir in remaining chopped chocolate and remaining pistachios. Spread mixture on top of chocolate and pistachios in prepared pan; smooth top.",
    "Cover with plastic wrap and refrigerate for 1 hour or until set with a soft fudge-like consistency. Cut burfi into 16 squares and arrange on serving platter.",
    "Tips",
    "Can be frozen",
    "Burfi can be frozen in an airtight container for up to 3 months. Defrost at room temperature before serving",
    "Top with gold",
    "For a festive, traditional garnish, top with gold or silver edible foil if desired.",
    "What you need",
    "How to prepare",
    "Recent Videos",
    "S.PELLEGRINO Limonta Chatpati Shikanji",
    "BOOST Simply+ Vanilla Mango Lassi",
    "QUALITY STREET Nankhatai",
    "QUALITY STREET Nankhatai Cookie Recipe"
  ]
}