{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/coffee-marinated-korean-short-ribs",
    "category": "Recipe",
    "title": "Coffee-Marinated Korean Short Ribs",
    "n_tokens": 382,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/7591885af73f3863064c7f92069d8213_coffee_crusted_korean_short_ribs-035_960x640.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Coffee-Marinated Korean Short Ribs",
    "Korean short ribs, otherwise known as “galbi,” refers to a strip of beef cut across the bone from the chuck end of the short ribs. Unlike American- and European-style short ribs, which include a thick slice of bone-in beef, Korean-style short ribs are cut lengthwise across the rib bone. The lengthwise cut helps to soak up the rich, Korean flavor–infused coffee marinade and serves to help grill it up quickly.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "25\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Total time:",
    "220\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "2 tbsp Nescafé Gold Dark Roast",
    "1 small onion, sliced",
    "1/3 cup + 2 tbsp brown sugar",
    "1/3 cup low-sodium soy sauce",
    "2 tbsp sesame oil",
    "1 tbsp minced fresh ginger",
    "2 tsp smoked paprika",
    "2 tsp hickory smoked sea salt",
    "2 tsp pepper",
    "3 lb flanken-style short ribs",
    "4 tbsp vegetable oil, divided",
    "2 green onions, sliced",
    "1 tbsp white sesame seeds",
    "Instructions",
    "In resealable plastic bag, combine 1/3 cup water, Nescafé Gold Dark Roast, onion, brown sugar, soy sauce, mirin, sesame oil, ginger, paprika, salt and pepper. Add short ribs; seal and refrigerate for at least 3 hours or up to overnight.",
    "Remove ribs from marinade, shaking off excess. Reserve marinade and onions; set aside.",
    "Heat 2 tbsp oil in large skillet set over medium-high heat; cook half of the ribs, turning once, for 4 to 5 minutes or until browned. Repeat with remaining oil and ribs. Transfer to plate.",
    "In same skillet, cook reserved marinade and onions for 3 to 5 minutes or until reduced. Drizzle over ribs. Garnish with green onions and sesame seeds.",
    "Tips",
    "Tip 3",
    "Use chopsticks (or even scissors!) to break apart and eat ribs for an authentic feel. Koreans have long seen the value in having scissors at-the-ready for cutting through meat, noodles and kimchi.",
    "Tip 2",
    "Serve with sweet potato fries or rice.",
    "Tip 1",
    "Alternatively, broil short ribs instead of grilling them.",
    "What you need",
    "How to prepare"
  ]
}