{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/pavlova-white-chocolate-and-berry-coulis",
    "category": "Recipe",
    "title": "PAVLOVA WITH WHITE CHOCOLATE AND BERRY COULIS",
    "n_tokens": 372,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/share.png",
        "role": "secondary",
        "alt": "share icon"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/search.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/abf46263257084b829cb87025afb76eb_white_chocolate_raspberry_truffle_tub_with_chocolate_garnish_(square_crop)_copy.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "PAVLOVA WITH WHITE CHOCOLATE AND BERRY COULIS",
    "Total time:",
    "110\n\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "Share",
    "Print",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "4 large fresh egg whites, room temperature",
    "1 cup granulated sugar",
    "1 tsp cornstarch",
    "1 tsp white vinegar",
    "1 tsp vanilla extract",
    "Häagen-Dazs White Chocolate Raspberry Truffle ice cream",
    "Melted white chocolate",
    "Mint",
    "Chocolate curls",
    "2 cups frozen berries",
    "Zest from 1 lemon, plus juice",
    "½ cup water",
    "¼ cup of sugar",
    "Directions",
    "INSTRUCTIONS",
    "Preheat the oven to 250°F. Line a baking sheet with parchment paper",
    "In a clean mixing bowl, beat the whites on medium high speed until soft peaks form. Slowly add the granulated sugar (1 tbsp at a time) beating the whites until the peaks are stiff and the mixture becomes glossy.",
    "In a small bowl mix the cornstarch and vinegar together until the cornstarch dissolves. Add to the egg whites along with the vanilla. Gently fold into the stiff peak mixture.",
    "Spoon the meringue mixture onto the prepared baking sheet, shaping them into small round disks that are approximately 5” diameter. Create a slight well in the center of the pavlova to hold the filling.",
    "Bake the pavlova in the preheated oven for about 1 hour or until the outside is crisp and dry. Turn off the oven and let the pavlova cool completely inside the oven with the door slightly ajar.",
    "While cooling, make the coulis by adding all the ingredients for the coulis into a pot, bring to a boil, then simmer for 30 minutes.",
    "Assembly",
    "Place the pavlova in the center of a plate. Add the coulis, some white chocolate drizzle and a small scoop of Häagen-Dazs White Chocolate Raspberry Truffle ice cream. Then top with a chocolate curl.",
    "Tips",
    "This is difficult to make on a high humidity day, so be sure to make these delicious deserts in an air conditioned space or on a day where the humidity is low. Store in an air tight container.",
    "You can trace a five inch bowl onto your parchment paper so the shapes will be uniform.",
    "Ensure there is no egg yolk in your whites. Any fat in the whites will prevent them from whipping.",
    "Before starting, wipe your mixing bowl and beaters with white vinegar to remove any residue"
  ]
}