{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/colorful-chana-chaat-chickpea-salad",
    "category": "Recipe",
    "title": "Colorful Chana Chaat Chickpea Salad",
    "n_tokens": 280,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/9f0e69304e1558c8fcc0ba0c6cd12806_maggi_20003_world_foods_website_recipes_chickpea_salad_webpage.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Colorful Chana Chaat Chickpea Salad",
    "This colourful Chana Chaat Chickpea Salad combines all the flavours, sweet, salty and uses our signature tangy Maggi Sweet and Hot Sauce. Give the recipe a try and enjoy it for your Holi celebrations or even just a nice side salad for your next dinner with the family!",
    "Total time:",
    "0\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "1 tin 400g chickpeas, rinsed",
    "1 tsp chaat masala / garam masala",
    "2 gem lettuce heads",
    "½ cucumber, diced",
    "400g new potatoes, cooked and cut into halves",
    "200g cherry tomatoes, varying colours, cut into halves",
    "100ml Greek yoghurt",
    "6 tsp Maggi Hot and Sweet Sauce",
    "½ red onion, finely diced",
    "sprig of mint, leaves finely chopped",
    "small handful coriander leaves",
    "2 tsp Bombay Mix",
    "Instructions",
    "Heat a frying pan over a medium heat. Add the chickpeas and toss in the chaat masala (or garam masala) until well coated. Fry for 3-4 minutes until the chickpeas are tender, watch that the spices do not burn. Transfer to a plate and leave to cool.",
    "Break off the outer leaves of the gem lettuce and arrange on the edges of a large serving plate. Shred the hearts of the lettuce and add them to the lettuce leaves on the plate along with the diced cucumber, halved new potatoes halved cherry tomatoes.",
    "Scatter over the cooled chickpeas on the salad. Dollop on the yoghurt and drizzle over the Maggi Hot and Sweet Sauce.",
    "Sprinkle on the red onion, mint, pomegranate, sev (or Bombay mix) and coriander leaves and serve immediately.",
    "Tips",
    "SERVING SUGGESTION",
    "Serve the salad in the outer leaves of baby gem lettuce for smaller bites.",
    "What you need",
    "How to prepare"
  ]
}