{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipes/world-flavours",
    "category": "Recipe",
    "title": "World of flavours",
    "n_tokens": 860,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/48e8c3d47ed2cf97a69fce47387d0ef6_silvanas.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/333ad62df5940dab69296477ba4ec6fa_coconut_meatball_curry-025-960x640.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/8d889e658517ed2403a098ba4bd57d48_210429_gg_ukfop_gif_pizza_opbouw_v2014_(1).jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/cd390e2788f2131039a104c7b1fe9c66_belizean_fry_jacks-037-960x640.jpg",
        "role": "recipe",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/bd1c265beace2eb674142c36d6ef46c5_nesquik_gulabo-_website-_sept_29.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "world of flavours",
    "Silvanas, originated from the Philippines. This absolute classic Filipino sweet treat is a frozen sandwich cookies that includes a cashew meringue, rich buttercream and cookie crumb coating.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Packed with hidden veggies, this curry-inspired one-pot dish is perfect for big-batch cooking to keep you fuelled for the week! Coconut milk powder provides creaminess that perfectly balances the warm spice of curry paste and the hot and sweet chili sauce.",
    "Celebrate Pride with this tasty vegan rainbow recipe! A simple, colorful and fun recipe that everyone will love.",
    "Similar to beignets from New Orleans, these delicious pieces of fried dough are a popular staple in Belize, as well as throughout the Caribbean and Latin America. Commonly enjoyed for breakfast as fuel for the day ahead, fry jacks can be eaten sweet or savoury depending on the accompanying toppings and condiments.",
    "260",
    "This Diwali, mix it up with the creamy texture and luscious flavour of Nesquik Strawberry Gulabo! Let this recipe be the highlight of your festivities, bringing a burst of flavour, vibrant colour and a touch of sweetness to your celebrations. Enjoy every sip of these aromatic flavours including strawberry, cardamom and rosewater and share the joy of with your loved ones.",
    "Alfajores are a traditional dulce de leche sandwich cookie found in many Latin American countries. These cookies typically made of flour, honey, and nuts can be found in Argentina, Bolivia, Chile, Colombia, Ecuador, Paraguay, Peru, the Philippines, Puerto Rico, Southern Brazil, Southern France, Spain, Uruguay, and Venezuela. These butter cookie sandwiches with a dulce de leche filling are divine! Caramelizing sweetened condensed milk gives the filling richness, and rolling the finished sandwich cookies in coconut and nuts makes them pretty.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Originally descending from West African tribes, the rice and peas combination was adapted in the Caribbean and has become a delicious staple throughout the Caribbean, with recipes handed down from generation to generation. This versatile dish can be enjoyed throughout the day as a side for breakfast, lunch or dinner.",
    "A veggie-packed variation on the traditional Italian ragù, this Bolognese is a one-pot dish that’s great for making ahead and preparing in batches for busy weeknight dinners. Originally from the Emilia-Romagna region, “Bolognese” refers to a slow-cooked meat sauce that was first developed in Bologna, Italy. This recipe includes loads of hidden vegetables so you can enjoy comfort-food classics while still getting important nutrients!",
    "These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour.",
    "Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence",
    "Tacos al pastor is a Mexican street-food staple that was created by Lebanese immigrants in the 1930s. Cooked on a Middle Eastern shawarma–style spit called a trompo, this recipe — spiked with chiles, adobo sauce and orange juice, and topped with pineapple and cilantro — has been adapted to be easily created in your own kitchen – no trompo required.",
    "140",
    "BOOST Vanilla Simply+ Mango Lassi is a refreshing and nourishing delight made with just five ingredients. Not only is this quick and easy to make but it is also packed with goodness that will leave you feeling satisfied. The combination of the smooth vanilla flavour and the natural sweetness of mangoes creates a harmonious blend. For added richness, sprinkle crushed pistachios, dried rose petals or saffron strands on top.",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a classic dessert.",
    "A classic throughout the Caribbean but famously known as a Jamaican staple, this beloved style of barbecue finds its roots from the Spanish term charqui, which means “dried strips of meat” and is reflective of the jerky-style texture and smoky flavour of meats cooked over burning coals.",
    "Refreshingly stylish, you'll love the PERRIER Passion Mojito.",
    "Biscotti, also known as cantucci originated in the Tuscan city of Prato. Bake these Italian biscuits twice to make them crunchy enough for dunking in your favorite hot drink. Try this variation made with the special touch of NESCAFÉ GOLD.",
    "Current page1",
    "Page2",
    "Next pageNext ›",
    "Last pageLast »"
  ]
}