{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/coffee-ice-cream-fudge-cake",
    "category": "Recipe",
    "title": "Coffee & Fudge Ice Cream Cake Recipe",
    "n_tokens": 355,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/share.png",
        "role": "secondary",
        "alt": "share icon"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/search.png",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://images.aws.nestle.recipes/original/45095be4c3c8e78ff56bb583e0177e59_haagen-dazs-fudge-cake.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Thät’s Dazs",
    "Layers",
    "Exträaz",
    "Recipes",
    "COFFEE ICE CREAM FUDGE CAKE",
    "Total time:",
    "128\n\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "Share",
    "Print",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "2 cups All Purpose Flour (or Gluten-Free Flour for Gluten-Free Cake)",
    "2 cups Sugar",
    "¾ cup Unsweetened Cocoa Powder",
    "2 tsp Baking Powder",
    "1 ½ tsp Baking Soda",
    "1 tsp Salt",
    "1 tbsp Espresso Powder",
    "1 cup Whole Milk (Substitute Almond Milk for Non-Dairy/Vegan Cake)",
    "½ cup Vegetable Oil",
    "2 Egg (Substitute ½ Cup Applesauce if Vegan)",
    "2 tsp Vanilla",
    "¾ cup Shaved Dark Chocolate",
    "8 oz Bittersweet Chocolate, Finely Chopped",
    "2 ½ tsp Coconut Oil",
    "1 pint Coffee Ice Cream",
    "or 1 pint Non-Dairy Chocolate Salted Fudge Truffle Ice Cream if Vegan",
    "Directions",
    "INSTRUCTIONS",
    "Preheat oven to 350 Degrees.",
    "Add flour, sugar, cocoa, baking powder, baking soda, salt and espresso powder to the bowl of a stand mixer. Combine ingredients.",
    "Add milk, vegetable oil, eggs, vanilla and mix on a low speed until well combined.",
    "Fill greased 2-9” cake pans evenly with batter and bake 30-35 minutes until a toothpick inserted in the center of the cake comes out clean.",
    "Remove from oven and allow to cool for 5 minutes. Run a knife around the edges of the cake to loosen and turn over onto a wire rack. Cool completely.",
    "Once cool, spread softened Häagen-Dazs coffee ice cream across the length of the cake and put the second layer of cake on top and place in freezer for 10 minutes.",
    "While cake is freezing, make hardening chocolate. Add chocolate and oil to a double boiler, over simmering water. Cool to room temperature.",
    "While cake is still on wire rack, remove from freezer and gently spread hardening chocolate over cake.",
    "Place in freezer for at least one hour or until serving.",
    "Tips",
    "FANCY A MINTY VARIATION?",
    "Omit the espresso powder and substitute mint chip ice cream for the coffee ice for a cool take on this cake. Add crushed cookie pieces on top for even more of a treat.",
    "FEELING EXTRA DECORATIVE?",
    "Add a border of chocolate coated coffee beans or dollops of whipping cream to the top of your cake for the perfect finishing touch."
  ]
}