{
  "metadata": {
    "url": "https://www.madewithnestle.ca/recipe/homemade-naan-mauritius",
    "category": "Recipe",
    "title": "Homemade Naan from Mauritius",
    "n_tokens": 325,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://images.aws.nestle.recipes/original/4aa20d9d60ddcfec5d0198f4fdb134e0_eid_nestle-recette-homemade-naan-final_1500x700px.jpg",
        "role": "recipe",
        "alt": ""
      }
    ]
  },
  "text": [
    "Homemade Naan from Mauritius",
    "This recipe yields soft and fluffy homemade naan bread that will have you coming back for more!Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Prep time:",
    "15\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Cook time:",
    "Total time:",
    "20\n\t\t\t\t\t\t\t\t\t\t\tmins.",
    "Servings:",
    "1\n\t\t\t\t\t\t\t\t\t\t\tPortions",
    "ShareTweetEmailPinYumPrint",
    "Ingredients",
    "Preparation",
    "½ tsp dry active Yeast",
    "½ tsp granulated Sugar",
    "3 ½ cups all-purpose Flour (plus additional for rolling)",
    "1 tsp Salt",
    "2 tbsp melted Ghee",
    "garlic powder, ground cumin, ground coriander, sea salt",
    "1 1/2 cups Nestle Carnation Evaporated Milk (from Mauritius)",
    "Instructions",
    "Preheat oven and heat the evaporated milk",
    "Heat ½ cup evaporated milk in microwave or on stovetop to 35 degree Celsius.",
    "Add flour to the evaporated milk",
    "Combine flour and salt in large mixer bowl. Add yeast mixture and remaining 1 cup of evaporated milk. Mix together on low speed using a dough hook for about 5 mins or until a soft, smooth dough is formed. (Alternatively, you can knead by hand for about 10 minutes).",
    "Divide the dough",
    "Divide dough into 12 pieces. Lightly flour work surface and rolling pin; roll out each piece into 7- to 8-inch ovals.",
    "Cook the naan",
    "Heat cast iron skillet over medium-high heat until smoking hot. Brush one side of one dough oval with melted ghee; sprinkle with any optional seasonings. Stretch dough out a little and place oiled-side-down on hot skillet. Cook for about 2 minutes or until large bubbles form on top. Flip with a spatula; cook for 1 to 2 mins or until toasted spots appear on bottom and naan puffs up a bit. Place on large plate. Repeat with remaining dough, ghee and seasonings.",
    "What you need",
    "How to prepare"
  ]
}