{
  "metadata": {
    "url": "https://www.madewithnestle.ca/smarties/smarties-mini-candy-coated-milk-chocolate",
    "category": "Product",
    "title": "SMARTIES Snack Size",
    "n_tokens": 408,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-09/Smarties-10.jpg",
        "role": "secondary",
        "alt": "NESTLÉ SMARTIES Snack Size discovery field trip pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/Smarties%20Birthday%20Cake.jpg?itok=c3B2ezcd",
        "role": "secondary",
        "alt": "Smarties Birthday Cake "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/smarties-hide-me-eggs.png?itok=xxo7X9HQ",
        "role": "secondary",
        "alt": "Smarties Hide Me Eggs 153 g pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/smarties_45g_-_no_background_resized.png?itok=ooPng2io",
        "role": "secondary",
        "alt": "SMARTIES candy-coated milk chocolate. 45 grams."
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-09/Smarties-25.jpg?itok=T5ETQbKb",
        "role": "secondary",
        "alt": "NESTLÉ SMARTIES Carton 25 discovery field trip pack"
      }
    ]
  },
  "text": [
    "SMARTIES Snack Size",
    "The crunch. The milk-chocolate smoothness. The vibrant colours. There's nothing quite like the irresistible taste of SMARTIES. Now you can share the delight 10 times with NESTLÉ SMARTIES Mini 10-Pack (10 x 10 g). Each mini-box has the same classic SMARTIES you love, with their colourful candy shell crunch covering a rich, milk-chocolate centre. Each box is perfectly portioned, making it easy to experience the joy of SMARTIES that are more vibrant than ever. Made with sustainably sourced cocoa, these colourful delights are made with natural colours and flavours. Plus, they're produced in a peanut-free facility. And now, all SMARTIES packaging is made with paper, as part of the SMARTIES initiative to create a more colourful world for our children. This will help remove up to 26 tonnes of plastic packaging in Canada!",
    "It's easy to share the joy of SMARTIES with family and friends, or bake them into creative, homemade treats - the possibilities are endless! The only question is, DO YOU EAT THE RED ONES LAST?",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "SMARTIES Snack SizeFeatures and Benefits",
    "10 miniature boxes of SMARTIES, colourful candy-coated pieces of milk chocolate",
    "Made with 100% natural colours and flavours in a peanut-free facility",
    "This SMARTIES packaging is recyclable and made with paper from responsible sources, certified by Sustainable Forestry Initiative, helping to remove up to 26 tonnes of plastic in Canada",
    "We purchase 100% Rainforest Alliance Certified cocoa, as part of the NESTLÉ COCOA PLAN. We work with the Rainforest Alliance and farmers to help improve the quality of their products and strengthen their communities",
    "Perfect for sharing with family and friends, or putting in your lunch box",
    "SMARTIES Snack SizeNutrition Information",
    "Per 4 boxes (40 g)Amount% DVCalories180gCarbohydrate31gFibre0g0%Sugars29g29%Carbohydrate31gFat6g8%Cholesterol5mgSaturated3.5gTrans Fat0g0%Protein1gSodium20mg1%Amount% DVCalcium40mg3%Iron0.5mg3%Potassium100mg2%*5% or less isa little, 15% or more isa lot",
    "SMARTIES Snack SizeIngredients",
    "Milk Chocolate (Sugar, Modified Milk Ingredients, Cocoa Butter*, Unsweetened Chocolate*, Soy Lecithin, Polyglycerol Polyricinoleate, Natural Flavour), Sugars (Sugar, Maltodextrin), Wheat Flour, Modified Corn Starch, Rice Starch, Carnauba Wax, Gum Arabic, Beet Red, Spirulina, Turmeric, Carotene, Anthocyanins. *Rainforest Alliance certified.",
    "RECIPES",
    "Canadian SMARTIES Cookies",
    "Did you know that SMARTIES are a Canadian-centered confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love.",
    "Chocolate Chip Banana Bread with Baking Bits",
    "Classic chocolate chip muffins with Baking Bits",
    "SMARTIES Street Racers",
    "SMARTIES fans, start your chocolate engines.",
    "SMARTIES Robots",
    "Hi! My name's Yum-o-tronic 3000.",
    "You might be interested in"
  ]
}