{
  "metadata": {
    "url": "https://www.madewithnestle.ca/smarties/easter-chocolate-assorted-hide-me-eggs-pouch",
    "category": "Product",
    "title": "Easter Chocolate Assorted Hide Me Eggs Pouch",
    "n_tokens": 572,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2025-04/hide-me-eggs-pouch_0.png",
        "role": "secondary",
        "alt": "hide-me-eggs-pouch"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/coffee-crisp-mega.png?itok=u-VkIz4k",
        "role": "secondary",
        "alt": "Coffee Crisp MEGA Cold Brew bar"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-salt-caramel-tablet.png?itok=2l6dOMcN",
        "role": "secondary",
        "alt": "KITKAT Salt caramel Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-hazelnut-tablet.png?itok=oXBjb1D4",
        "role": "secondary",
        "alt": "KITKAT Hazelnut Tablet"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/kit-kat-classic-tablet.png?itok=qjbDJjGD",
        "role": "secondary",
        "alt": "KITKAT Classic Tablet"
      }
    ]
  },
  "text": [
    "Easter Chocolate Assorted Hide Me Eggs Pouch",
    "Just in time for Easter comes NESTLÉ Assorted Hide Me Eggs! These miniature, egg-shaped versions of classic NESTLÉ treats are individually wrapped in foil and ready to be hidden for an egg hunt, slipped into an Easter basket, or shared with family and friends. All your favourites are here - KITKAT milk chocolate eggs filled with crispy wafer pieces, SMARTIES milk chocolate eggs with miniature pieces of SMARTIES, COFFEE CRISP milk chocolate eggs with delicious COFFEE CRISP flavour and crispy wafers, and AERO milk chocolatey eggs filled with AERO's classic bubbles. NESTLÉ Assorted Hide Me Eggs are made with natural flavours, no artificial colours, and sustainably sourced cocoa that is certified by the Rainforest Alliance, an organization that works to help farmers improve the quality of their products and strengthen their communities.",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "Easter Chocolate Assorted Hide Me Eggs PouchFeatures and Benefits",
    "Assortment of miniature milk chocolate eggs of your favourite NESTLÉ treats: SMARTIES, KITKAT, COFFEE CRISP, and AERO",
    "Natural flavours and colours",
    "Perfect for Easter egg hunts, gift baskets, or sharing chocolate treats with family and friends",
    "Proudly Supporting Kids Help Phone: For more than 34 years, NESTLÉ Canada has raised millions for Kids Help Phone, Canada's only 24/7, free, confidential, and multilingual e-mental health service",
    "Easter Chocolate Assorted Hide Me Eggs PouchNutrition Information",
    "SMARTIES eggsPer 4 eggs (36 g)Amount% DVCalories190Carbohydrate22gFibre0g0%Sugars21g21%Fat11g15%Cholesterol10mgSaturated Fat6gTrans Fat0.2gProtein2gSodium30mg1%Amount% DVCalcium50mg4%Iron0.75mg4%Potassium125mg4%*5% or less is a little, 15% or more is a lotCoffee Crisp eggsPer 6 eggs (42 g)Amount% DVCalories220Carbohydrate26gFibre1g4%Sugars24g24%Fat12g16%Cholesterol5mgSaturated Fat7gTrans Fat0.1gProtein3gSodium25mg1%Amount% DVCalcium50mg4%Iron2mg11%Potassium150mg4%*5% or less is a little, 15% or more is a lotaero eggs NFTPer 13 eggs (39 g)Amount% DVCalories210Carbohydrate24gDietary Fiber1g4%Sugars22g22%Fat12g16%Cholesterol10mgSaturated7gTrans Fat0.1gProtein3gSodium35mg2%Amount% DVCalcium75mg6%Iron1mg6%Potassium175mg5%KITKAT eggs NFTPer 4 eggs (36g)Amount% DVCalories190Carbohydrate21gDietary Fibre1g4%Sugars19g19%Fat11g15%Cholesterol5mgSaturated6gTrans Fat0.1gProtein2gSodium25mg1%Amount% DVCalcium50mg4%Iron1.5mg8%Potassium125mg4%",
    "Easter Chocolate Assorted Hide Me Eggs PouchIngredients",
    "SMARTIES eggsMilk Chocolate (Sugar, Milk Ingredients, Unsweetened Chocolate, Cocoa Butter, Soy Lecithin, Natural Flavour), Sugar, Modified Milk Ingredients, Cocoa Butter, Unsweetened Chocolate, Wheat Flour, Rice Starch, Sunflower Lecithin, Carnauba Wax, Citric Acid, Beeswax, Gum Arabic, Natural Flavour, Fruit and Vegetable Extracts (Safflower, Radish, Spirulina, Black Carrot, Lemon, Hibiscus).May contain tree nuts and egg.Coffee Crisp eggsMilk Chocolate (Sugar, Milk Ingredients, Unsweetened Chocolate, Cocoa Butter, Soy Lecithin, Natural Flavour), Wheat Flour, Sugar, Palm Oil, Soy Lecithin, Natural Flavour, Salt.May contain tree nuts and egg.",
    "RECIPES",
    "German Lebkuchen",
    "Lebkuchen, sometimes called Pfefferkuchen, is a German treat somewhat similar to gingerbread. These soft, moist and nutty cookies have become a part of Germany’s Christmas traditions. Try these honey-sweetened cookies made with NESTLÉ CLASSIC Semisweet Chocolate, almonds, cloves and nutmeg.Some of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "KIT KAT Spiked Hot Chocolate",
    "Hot chocolate on its own is great. But hot chocolate + KIT KAT and coffee liqueur, now that's just unfair.",
    "Canadian SMARTIES Cookies",
    "Did you know that SMARTIES are a Canadian-centered confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love.",
    "Chocolate Chip Banana Bread with Baking Bits",
    "COFFEE CRISP Canada Day Birthday Shot",
    "What better way to say cheers for Canada’s 150th than with your favourite Canadian wafer bar? Wow your guests with this quick and easy recipe!",
    "You might be interested in"
  ]
}