{
  "metadata": {
    "url": "https://www.madewithnestle.ca/smarties/smarties-candy-coated-milk-chocolate-45-g",
    "category": "Product",
    "title": "SMARTIES candy coated milk chocolate 45 g",
    "n_tokens": 359,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-05/smarties-candy-coated-45.png",
        "role": "secondary",
        "alt": "SMARTIES candy coated milk chocolate 45 g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-02/Smarties%20Birthday%20Cake.jpg?itok=c3B2ezcd",
        "role": "secondary",
        "alt": "Smarties Birthday Cake "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-09/Smarties-10.jpg?itok=J3391mwO",
        "role": "secondary",
        "alt": "NESTLÉ SMARTIES Snack Size discovery field trip pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2025-03/smarties-hide-me-eggs.png?itok=xxo7X9HQ",
        "role": "secondary",
        "alt": "Smarties Hide Me Eggs 153 g pack"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/smarties_45g_-_no_background_resized.png?itok=ooPng2io",
        "role": "secondary",
        "alt": "SMARTIES candy-coated milk chocolate. 45 grams."
      }
    ]
  },
  "text": [
    "SMARTIES candy coated milk chocolate 45 g",
    "Make your day more colourful with NESTLÉ SMARTIES (45 g), the Canadian favourite candy for over 80 years. Each box contains the classic, delicious combination of milk chocolate covered in vibrant candy shells. Made with sustainably sourced cocoa, these colourful delights are made with natural colours and flavours. Plus, they're produced in a peanut-free facility. And now, all SMARTIES packaging is made with paper, as part of the SMARTIES initiative to create a more colourful world for our children.",
    "It's easy to share the joy of SMARTIES with family and friends, or bake them into creative, homemade treats - the possibilities are endless! The only question is, DO YOU EAT THE RED ONES LAST?",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "SMARTIES candy coated milk chocolate 45 gFeatures and Benefits",
    "Classic SMARTIES, colourful candy-coated pieces of milk chocolate",
    "Made with 100% natural colours and flavours in a peanut-free facility",
    "This SMARTIES packaging is recyclable and made with paper from responsible sources, certified by Sustainable Forestry Initiative",
    "We purchase Rainforest Alliance Certified cocoa, as part of the NESTLÉ COCOA PLAN. We work with the Rainforest Alliance and farmers to help improve the quality of their products and strengthen their communities.",
    "Perfect for sharing with family and friends, or baking them into your own creative, homemade treats",
    "SMARTIES candy coated milk chocolate 45 gNutrition Information",
    "Per 1 box (45 g)Amount% DVCalories210Carbohydrate35gFibre1g4%Sugars33g33%Fat7g9%Cholesterol5mgSaturated4g20%Trans0gProtein2gSodium20mg1%Amount% DVCalcium40mg3%Iron0.75mg4%Potassium100mg2%5% or less is a little, 15% or more is a lot.",
    "SMARTIES candy coated milk chocolate 45 gIngredients",
    "Milk Chocolate (Sugar, Modified Milk Ingredients, Cocoa Butter*, Unsweetened Chocolate*, Soy Lecithin, Polyglycerol Polyricinoleate, Natural Flavour), Sugars (Sugar, Maltodextrin), Wheat Flour, Modified Corn Starch, Rice Starch, Carnauba Wax, Gum Arabic, Beet Red, Spirulina, Turmeric, Carotene, Anthocyanins. *Rainforest Alliance certified.",
    "RECIPES",
    "Canadian SMARTIES Cookies",
    "Did you know that SMARTIES are a Canadian-centered confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love.",
    "Chocolate Chip Banana Bread with Baking Bits",
    "Classic chocolate chip muffins with Baking Bits",
    "SMARTIES Street Racers",
    "SMARTIES fans, start your chocolate engines.",
    "SMARTIES Robots",
    "Hi! My name's Yum-o-tronic 3000.",
    "You might be interested in"
  ]
}