{
  "metadata": {
    "url": "https://www.madewithnestle.ca/terms-and-conditions",
    "category": "About",
    "title": "Terms and Conditions",
    "n_tokens": 4097,
    "n_tables": 0,
    "n_images": 0,
    "images": []
  },
  "text": [
    "Terms and Conditions",
    "Thank you for visiting this website. Please read the Terms and Conditions contained in this document carefully since any use of this website constitutes your acceptance of the Terms and Conditions set out herein.",
    "Throughout this site, the terms \"we\", \"us\", \"our\" \"Nestlé\" and \"Nestlé Group\" refer to Nestlé Canada Inc. and any of its affiliated companies as appropriate to the context. “You” refers to any person accessing and/or using this website.",
    "Website Privacy Notice",
    "Any personal information or material sent to this website or the myNestlé Program is subject to the terms and conditions set out in thePrivacy Noticeand theUser Generated Content Terms & Conditions, both of which are located on this website.",
    "Accuracy, completeness and timeliness of information",
    "While we use all reasonable attempts to ensure the accuracy and completeness of information on this website, we are not responsible if the information that we make available on this website is not accurate or complete. Any reliance upon the material on this website shall be at your own risk. You agree that it is your responsibility to monitor any changes to the material and the information contained on this website.",
    "Transmission",
    "Any non-personal communication or material you transmit to this website by electronic mail or otherwise, including any data, questions, comments, suggestions or the like is, and will be treated as, non-confidential and non-proprietary. Anything you transmit or post becomes the property of the Nestlé Group and may be used for any purpose, including but not limited to, reproduction, disclosure, transmission, publication, broadcast and posting. Furthermore, the Nestlé Group is free to use for any purposes whatsoever (including but not limited to the developing, manufacturing, advertising and marketing of products) any ideas, artwork, inventions, developments, suggestions or concepts contained in any communication you send to this website. Any such use is without compensation to the party submitting information. By submitting information, you are also warranting that you own the material/content submitted that it is not defamatory and that the Nestlé Group's use will not violate any third party's rights or otherwise place us in breach of any applicable laws. The Nestlé Group is under no obligation to use the information submitted.",
    "Intellectual property rights",
    "All copyright, trademarks and other intellectual property rights in all text, images and other materials on this website are the property of the Nestlé Group or are included with the permission of the relevant owner.",
    "You are permitted to browse this website, reproduce extracts by way of printing, downloading to a hard disk or for the purposes of distribution to other individuals. This is only to be done on the proviso that you keep intact all copyright and other proprietary notices and that the trademark notice below appears on such reproductions. No reproduction of any part of this website may be sold or distributed for commercial gain nor shall it be modified or incorporated in any other work, publication or website.",
    "® Reg. Trademark of Société des Produits Nestlé S.A. All rights reserved.",
    "The trademarks, logos, characters and service marks (collectively \"Trademarks\") displayed on this website belong to Société des Produits Nestlé S.A. part of the Nestlé Group. Nothing contained on this website should be construed as granting any license or right to use any Trademark displayed on this website. Your use/misuse of the Trademarks displayed on this website, or on any other content on this website, except as provided for in these Terms and Conditions, is strictly prohibited. You are also advised that the Nestlé Group will vigorously enforce its intellectual property rights to the fullest extent of the law.",
    "Links to other websites",
    "Links on the Nestlé Group websites may take you outside the Nestlé Group network and systems and the Nestlé Group accepts no responsibility for the content, accuracy or function of these other third party websites. The links are provided in good faith and the Nestlé Group cannot be held responsible for any subsequent change in other third party websites to which we provide a link. The inclusion of any link to other websites does not imply endorsement by the Nestlé Group. We highly recommend that you make yourself aware of and carefully read the legal and privacy notices of all other websites that you visit.",
    "Consumer Generated Content",
    "Nestlé owns, operates and/or manages various websites and social media sites and pages that permit consumers to submit, upload, post, display and/or otherwise publish content (the “Sites”). Such Sites may include, but are not limited to, websites, message boards, blogs, social network pages and comment boards.",
    "Please be aware that, while we encourage participation on our Sites from a wide variety of sources, consumer activities on our Sites have not been verified by us and do not necessarily reflect our opinions, values and beliefs. Nestlé cannot guarantee the timeliness, accuracy, efficacy or veracity of any information provided on the Sites, nor the efficiency or applicability of any advice, opinions or content as they may be interpreted and applied by you. Nestlé personnel are not and will not be responsible for any misleading, false, or otherwise injurious information and advice communicated on any of the Sites, or for any results obtained from the use of such information or advice.",
    "1. Appropriate Conduct and ContentThe Sites are made available for your personal, non-commercial use only. The Sites may not be used by you for any commercial or promotional purpose. The Sites are generally family-friendly spaces and we ask that you act accordingly when participating on the Sites.By submitting, uploading, posting, displaying or otherwise publishing any data, text, information, photos, videos, links or other content (collectively, “Content”) to any of the Sites, or by using our suggested branded hashtag or similar designator in association with your Content, you accept and agree to be bound by these Terms and Conditions, and you represent and warrant in respect of such Content that:(a) you are above the age of majority in your province or territory of residence, or you have the permission of a parent/legal guardian;(b) the Content is original to you and you have all necessary rights in the Content and all of its components to submit, upload, post, display or otherwise publish it to the Sites;(c) at the time that it is provided, any information contained within the Content is true, accurate, complete and not misleading and, for Sites where you are able to update such information, you will do so as appropriate to ensure that it remains true, accurate, complete and not misleading;(d) it does not contain information or links that offer medical advice, improper or off-label use of products, addresses, email addresses, contact information or phone numbers, or contain any person’s personally identifiable information;(e) it does not contain any viruses, bugs, worms, defects, Trojan horses, other items of a destructive nature or other elements that could impair, slow down or otherwise cause damage to any of the Sites, any other Nestlé property or the property of third parties;(f) it does not contain any reference to or likeness of any third parties unless consent has been obtained from all such individuals (if any third parties are under the age of majority in their province or territory of residence, consent must be obtained from such individual’s parent or legal guardian);(g) it is not hateful, obscene, indecent, threatening, harassing, abusive or otherwise inappropriate, including through the depiction of violent, humiliating, derogatory, racist, sexist, illegal, risky or vulgar scenes;(h) it does not contain any commercial messages or URLs or links to other websites;(i) it does not, and will not, in any way, give rise to any claims of infringement, libel or defamation, give rise to any claims for any payment whatsoever or breach the rights of any third parties, including any rights of privacy, personality, confidentiality, trademark, copyright or other intellectual property and does not encourage activity that is unlawful or that may create risks of legal liability or harm to others;(j) it does not, and will not, in any way, harm, defame or impair the public image and goodwill of Nestlé or any of its brands; and(k) it does not and will not, in any way, violate any applicable laws or regulations or any rules, terms or conditions applicable to the relevant Site.(l) For product reviews, specifically:i. The review must be focused solely on the product you are reviewing, and based on your actual experience and knowledge;ii. The review must be written by someone in Canada; andiii. The review must be in either English or French.(m) OTHERYOU MAY NOT USE ANY OF THE SITES FOR ANY ILLEGAL OR UNAUTHORIZED PURPOSE. YOU ARE SOLELY RESPONSIBLE FOR ANY CONTENT YOU SUBMIT, UPLOAD, POST, DISPLAY OR OTHERWISE PUBLISH TO ANY OF THE SITES AND YOU AGREE THAT NESTLÉ SHALL BEAR NO LEGAL LIABILITY, EXPRESS OR IMPLIED, IN RELATION TO ANY SUCH CONTENT, INCLUDING IN RELATION TO ANY USE MADE OF ANY SUCH CONTENT BY NESTLÉ.While Nestlé prohibits such conduct and content on its Sites, you understand and agree that you nonetheless may be exposed to such conduct and content through the Sites and that you use the Sites at your own risk. THE SITES ARE BEING MADE AVAILABLE TO YOU “AS IS,” WITHOUT REPRESENTATIONS OR WARRANTIES OF ANY KIND.Without notice to you, we may, but shall have no obligation to, refuse, edit, and/or remove Content for or from the Sites that we determine, in our sole and absolute discretion, to be unauthorized, unlawful or otherwise in violation of these Terms and Conditions.",
    "2. Right to Monitor or Remove ContentNestlé reserves the right to change, condense, remove or delete (or refuse to post) any Content at any time, including if Nestlé deems, in its discretion, that the content violates these terms. Nestlé does not guarantee that you will have any ability to edit or delete any content you have submitted. You acknowledge that Nestlé is not responsible for your Content posted by any third parties. Your Content is not subject to any obligation of confidence on the part of Nestlé, its agents, subsidiaries, affiliates, partners or third party service providers, or any of their respective directors, officers and employees.Examples of Illegal or Unauthorized Uses Include, but are Not Limited To:Modifying, adapting, translating, or reverse engineering any portion of the Sites; using any robot, spider, site search/retrieval application, or other device to retrieve or index any portion of the Sites; collecting any information about other consumers (including usernames and/or e-mail addresses) for unauthorized purposes; reformatting or framing any portion of the web pages or site images that are part of the Sites; creating user accounts by automated means or under false or fraudulent pretences; creating or transmitting unwanted electronic communications such as “spam,” or chain letters to other consumers or otherwise interfering with other consumers’ enjoyment of the Sites; submitting Content that falsely expresses or implies that such Content is sponsored or endorsed by the Sites; submitting Content that is unlawful or promotes or encourages illegal activity; displaying an advertisement as part of a profile; and any automated use of the system, including the use of scripts to send messages or post comments; or submitting false or misleading information.",
    "3. Licence to Use ContentBy submitting, uploading, posting, displaying or otherwise publishing any Content to any of the Sites, or by using our suggested branded hashtag or similar designator in association with your Content, you:(n) automatically grant to Nestlé and its agents and designees, in perpetuity, a worldwide, non-exclusive, royalty-free, irrevocable licence to publish, display, reproduce, modify, edit or otherwise use such Content, in whole or in part, in its original form or as edited or modified in any way at the direction of Nestlé, anywhere in the world and in any and all forms of media whatsoever, including on the Sites, for any advertising, promotional, commercial or other lawful purpose whatsoever, in the sole and absolute discretion of Nestlé;(o) waive any and all moral rights you may have in and to the Content in favour of Nestlé and its agents and designees; and(p) agree to release, defend and indemnify Nestlé and its agents and designees from any and all liability, claims, losses, actions or damages of any kind, whether actual, incidental or consequential, arising out of or relating in any way to the Content or the use of the Content in any way by Nestlé, its agents or its designees, including any and all liability, claims, losses, actions and damages based upon rights of privacy, personality, confidentiality, trademark, copyright or other intellectual property.",
    "4. Submissions to our SitesPlease do not submit, upload, post, display or otherwise publish any Content to any of the Sites that constitutes a trade secret or confidential or proprietary information. We are not in a position to accept such information, nor can we agree to obligations of non-disclosure or confidentiality with regard to submitted plans or ideas. You agree that any Content that you, or individuals acting on your behalf, submit, upload, post, display or otherwise publish to any of the Sites will not be considered confidential or proprietary.Moreover, Nestlé is free to use and reproduce such Content, and any ideas, artwork, inventions, developments, suggestions and concepts contained in any such Content, freely and for any purposes whatsoever (including, but not limited to, for the purposes of developing, manufacturing, advertising and marketing of products). Any such use or reproduction is without compensation to you. Nestlé is under no obligation to use any Content submitted. You understand that Nestlé employs both internal and external resources that may have developed or may in the future develop ideas identical or similar to the ideas in any Content submitted by you.",
    "5. CommunicationIn the event that you submit your email address in connection with a product review, you agree that Nestlé and its third party service providers may use your email address to contact you about the status of your review and for other administrative purposes connected to your review. Nestlé will not contact you for any other purpose, unless you have opted in to receiving electronic messages through other platforms. If you consent to receive electronic messages from us through various Nestlé platforms, such consent will be governed by the terms that you agreed to when you provided your consent.",
    "myNestlé Memberships & Accounts",
    "We have created the “myNestlé” Program (“myNestlé” or the “Program”) to reward Nestlé consumers with offers, promotions and unique experiences. In order to be eligible to receive these offers, promotions and unique experiences, you must register and become a member of myNestlé. By registering and becoming a member of myNestlé, you agree to be bound by these Terms and Conditions, and ourPrivacy Policy.",
    "1. EligibilityIn order to be eligible to register and become a member of myNestlé, and to participate in offers, promotions and unique experiences offered through myNestlé, you must be at least the age of majority in your province or territory at the time of registration. Only one membership in myNestlé is permitted per Canadian resident. This eligibility is subject to other conditions as applicable for individual promotions.",
    "2. RegistrationTo register and become a member of myNestlé, you must click on the icon “myNestlé” on this Site, complete the registration instructions and provide all required information (including, without limitation, your full name, a unique and valid email address and your postal code). As part of the registration process, a personalized, unique profile (including a username and password) will be created that will enable us to provide you with Rewards (defined below) and for you to see certain information regarding your relationship with us. Your membership in myNestlé has no cash value and is not transferrable.",
    "3. RewardsFrom time to time, we may provide you with offers, promotions or unique experiences (“Rewards”) via myNestlé. We may impose additional terms and conditions that are specific to any particular Reward at the time of providing you that Reward (i.e., coupons, online credits, digital rewards, etc.). Such additional terms and conditions will be binding on you. We may change any Rewards at any time without notice and Rewards may expire at the sole discretion of Nestlé. Rewards may not be exchanged for cash, any cash equivalent or any products other than those indicated on the Reward (if applicable), or combined with other discounts or coupons. Rewards may contain additional terms and conditions, which will be expressly indicated on the Rewards themselves and which may not be disclosed in advance of receiving the Reward. Rewards are personal to you, are not transferrable and may be redeemed only in Canada. The number, type and frequency with which we may provide you Rewards are dependent upon a number of factors, which we may change at any time in our sole discretion, including, without limitation, the number and types of activities you engage in within our online properties, the frequency of your usage of myNestlé, the type and extensiveness of your participation in other Nestlé programs or applications. Each time we provide you with a Reward, you will be able to view that Reward by logging into myNestlé on this site. Rewards may not be provided or redeemed if unexpected technical difficulties arise, and we have no responsibility or liability to retroactively provide or redeem Rewards.",
    "4. Disputes and UncertaintyIf there is any dispute or uncertainty regarding any aspect of myNestlé, including, without limitation, the identity of any myNestlé member, the provision or redemption of any Reward, the terms and conditions of any Reward, or the registration in myNestlé or online viawww.madewithnestle.ca, our determination of such dispute or uncertainty will be conclusive and final.",
    "5. CancellationThe Program may, from time to time, be restricted, suspended, cancelled, amended or otherwise altered without notice to you (except as may be required by applicable law). Such restriction, suspension, cancellation or amendments shall be all in our sole discretion.",
    "6. Suspension, Termination or Deactivation of Membership or RewardsWe may terminate your membership in, or access to, myNestlé, or any Rewards provided to you, at any time without notice to you or liability to us, and for any reason in our sole discretion, including, without limitation, any actual or suspected unauthorized or fraudulent use of myNestlé or your actual or suspected failure to comply with any of these Terms and Conditions and ourPrivacy Policy. We are under no obligation to continue the Program, compensate you for such suspension or termination, or provide you with any notice of its suspension or termination. We reserve the right to deactivate myNestlé accounts or purge account data, from time to time, should your account be inactive.",
    "7. Personal InformationIn order to register for, and participate in, myNestlé you must provide us certain required personal information about yourself. If you do not provide us the required personal information about yourself, you may not register for, or participate in, myNestlé. We collect, use and disclose your personal information in accordance with ourPrivacy Policy.",
    "8. Electronic MessagesAs part of registering for myNestlé, you may be asked whether you consent to receive commercial electronic messages from us, including, without limitation, email, push messaging or SMS messages. Such consent is not required to participate in the Program. If you consent to receive electronic messages from us through various Nestlé programs, such consent will be governed by the terms that you agreed to when you provided your consent. In addition, if you consent to receive such electronic messages, such electronic messages may be subject to text message and data rates from your telecom provider. If you consent to receive electronic messages from us and wish to no longer receive such electronic messages, you can click “unsubscribe” on any of those electronic messages, at any time, orContact Us.",
    "Warranties",
    "This website is provided to you on an \"As Is\" and \"As Available\" basis and, consequently, the Nestlé Group gives no warranties of any kind, whether express, implied, statutory or otherwise (including the implied warranties of merchantability or satisfactory quality and fitness for a particular purpose) including warranties or representations that material on this website will be complete, accurate, reliable, timely, non-infringing to third parties, that access to this website will be un-interrupted or error-free or free from viruses, that this website will be secure, that any advice or opinion obtained from the Nestlé Group through this website is accurate or to be relied upon and any representations or warranties thereto are accordingly expressly disclaimed.",
    "Please note that some jurisdictions may not allow exclusions of implied warranties, so some of these exclusions may not apply to you. Please check your local laws.",
    "We reserve the right to restrict, suspend or terminate without notice your access to this website or any feature of this website or any feature or part thereof at any time.",
    "Liability",
    "The Nestlé Group and/or any other party involved in the creating, producing or delivering this website (including myNestlé) on our behalf shall have no liability or any responsibility whatsoever for any direct, incidental, consequential, indirect, special or punitive damages, costs, losses or liabilities whatsoever and howsoever arising out of your access to, use, inability to use, change in content of this website or arising from any other website you access through a link from this website or to the extent permitted by applicable law, from any actions we take or fail to take as a result of any electronic mail messages you send us.",
    "The Nestlé Group and/or any other party involved in the creating, producing or delivering this website (including myNestlé) shall have no responsibility to maintain the material and services made available on this website or to supply any corrections, updates, or releases in connection therewith. Any material on this website is subject to change without notice.",
    "Further, the Nestlé Group shall have no liability or any responsibility whatsoever for any loss suffered caused by viruses that may infect your computer equipment or other property by reason of your use of, access to or downloading of any material from this website. If you choose to download material from this website you do so at your own risk.",
    "To the maximum extent permitted by applicable law, you expressly waive all claims against Nestlé Group, its officers, directors, employees, suppliers and programmers that may arise from your use or access of this website.",
    "Prohibited Activity",
    "You are prohibited from doing any act that the Nestlé Group in its absolute discretion may deem to be inappropriate and/or would be deemed to be an unlawful act or is prohibited by any laws applicable to this website including but not limited to:",
    "Any act that would constitute a breach of either the privacy (including uploading private information without the concerned individual's consent) or any other of the legal rights of individuals;",
    "Using this website to defame or libel the Nestlé Group, its employees or other individuals or acting in such a way that brings into disrepute the good name of the Nestlé Group;",
    "Uploading files that contain viruses that may cause damage to the property of the Nestlé Group or the property of other individuals; and",
    "Posting or transmitting to this website any non-authorized material including but not limited to material that is in our opinion likely to cause annoyance, detrimental to or in violation of Nestlé Group or third party´s systems or network security, defamatory, racist, obscene, threatening, pornographic or otherwise unlawful.",
    "Jurisdiction and Governing Law",
    "The Nestlé Group products, materials, offers and information appearing on this website are intended for Canadian users and/or customers only. The Nestlé Group makes no representation that the products and the content of this website are appropriate or available in locations other than Canada. The products appearing in this website are only visual representations and as such are not in their real size, packaging colour etc.",
    "You and the Nestlé Group agree that any controversy or claim arising from or pertaining to the use of this website shall be governed by the laws in force in the Province of Ontario and the federal laws of Canada applicable therein (excluding any conflict of laws, rule or principle that might refer such interpretation to the laws of another jurisdiction). You and the Nestlé Group irrevocably submit to the exclusive jurisdiction of the courts of Ontario with respect to any such controversies or claims.",
    "Legal notice update",
    "We reserve the right to make any changes and corrections to this notice. Please refer to this page from time to time to review these and new additional information.",
    "For More Information",
    "If you have any questions regarding these Terms and Conditions or myNestlé, please Contact Us online or write to us at:",
    "Nestlé Canada Consumer Care Centre",
    "25 Sheppard Ave W.",
    "Toronto, ON",
    "M2N 6S6",
    "Email:consumer.care@ca.nestle.com",
    "©2017 Nestlé. All rights reserved."
  ]
}