{
  "metadata": {
    "url": "https://www.madewithnestle.ca/turtles/turtles-classic-recipe-share-bag-100g",
    "category": "Product",
    "title": "TURTLES Classic Recipe Share Bag",
    "n_tokens": 451,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-09/Turtles_Classic_Bag_12x100g_.png",
        "role": "secondary",
        "alt": "Turtles Classic Bag 12x100g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2022-11/00059800850315_A1C1.png?itok=MZIGS0Nh",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/TURTLES-Classic-Holiday-Gift-Box.png?itok=TffHhr_E",
        "role": "secondary",
        "alt": "TURTLES Classic Holiday Gift Box"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/turtles-classic-recipe-160g.png?itok=C8RlNMc6",
        "role": "recipe",
        "alt": "TURTLES Classic Recipe Share Bag"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/turtles-classic-gift-box.png?itok=fLFgp141",
        "role": "recipe",
        "alt": "TURTLES Classic Recipe Holiday Gift Box "
      }
    ]
  },
  "text": [
    "TURTLES Classic Recipe Share Bag",
    "Take it slow with TURTLES and experience the silky smooth caramel and crunchy pecans draped in rich milk chocolate featured in this classic treat. This 100g bag of individually wrapped TURTLES chocolates is perfect for sharing with those who mean the most. Proudly prepared in Canada, these delicious treats are gluten-free, Kosher, and made with natural flavours. As part of their commitment to sustainability practices, NESTLÉ uses 100% sustainably sourced cocoa that is certified by the Rainforest Alliance, an organization that works to help farmers improve the quality of their products and strengthen their communities. A tradition since 1949, Canadians can't get enough of the slow pull of creamy caramel, crunchy pecans, and rich milk chocolate of TURTLES. So, take it slow and share some TURTLES today!",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "TURTLES Classic Recipe Share BagFeatures and Benefits",
    "Classic Flavours: Enjoy TURTLE's silky smooth caramel and crunchy pecans draped in rich milk chocolate",
    "Perfect For Sharing: This 100g bag is filled with individually wrapped classic TURTLES perfect for sharing with those who mean the most",
    "Prepared In Canada: Proudly prepared in Canada",
    "A Canadian Tradition Since 1949: Canadians can't get enough of the slow pull of creamy caramel, crunchy pecans, and rich milk chocolate of TURTLES",
    "Gluten-Free & Kosher: TURTLES are gluten-free, Kosher, and made with natural flavours",
    "Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, NESTLÉ purchases 100% Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities",
    "TURTLES Classic Recipe Share BagNutrition Information",
    "Per 2 pieces (34 g)Amount% DVCalories180Carbohydrate20gFibre1g4%Sugars18g18%Cholesterol5mgProtein2gSodium40mg2%Amount% DVCalcium40mg3%Iron0.5mg3%Potassium100mg3%",
    "TURTLES Classic Recipe Share BagIngredients",
    "Milk chocolate (sugar, cocoa butter*, milk ingredients, unsweetened chocolate*, soy lecithin, natural flavour, salt), Caramel (sugars [glucose, sugar], modified milk ingredients, modified palm oil, salt, natural flavour), Pecans. *Rainforest Alliance Certified",
    "RECIPES",
    "AERO and TURTLES Bite Size Chocolate Pecan Rugelach",
    "Deriving from the Yiddish word meaning “little twists,” these delicious bite-size cookies are traditionally served during Hanukkah, and can be made with dried fruit, nuts, jams or, as in this recipe, chocolate! Aero and chocolate add decadence and delight to this holiday favourite",
    "TURTLES Eggnog Fudge",
    "When you combine two holiday favourites, do you get a favourite, favourite?",
    "TURTLES Pumpkin Mug Cake",
    "What’s better than having a TURTLES-pumpkin cake all to yourself? This recipe is here to make your dream come true.",
    "Classic Butter Tarts topped with TURTLES",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a classic dessert.",
    "TURTLES Baked Apples",
    "Treat the family to delicious TURTLES baked apples, and everyone will be thankful for YOU!",
    "You might be interested in"
  ]
}