{
  "metadata": {
    "url": "https://www.madewithnestle.ca/turtles/turtles-classic-recipe-holiday-gift-box",
    "category": "Product",
    "title": "TURTLES Classic Recipe Holiday Gift Box",
    "n_tokens": 411,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-07/turtles-classic-gift-box.png",
        "role": "recipe",
        "alt": "TURTLES Classic Recipe Holiday Gift Box "
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-09/Turtles_Classic_Bag_12x100g_.png?itok=o58BDqgd",
        "role": "secondary",
        "alt": "Turtles Classic Bag 12x100g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/kit-kat-hockey-stick.png?itok=yNbOarHC",
        "role": "secondary",
        "alt": "hockey stick bars"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2022-11/00059800850315_A1C1.png?itok=MZIGS0Nh",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/TURTLES-Classic-Holiday-Gift-Box.png?itok=TffHhr_E",
        "role": "secondary",
        "alt": "TURTLES Classic Holiday Gift Box"
      }
    ]
  },
  "text": [
    "TURTLES Classic Recipe Holiday Gift Box",
    "Canadians can't get enough of the irresistible taste of NESTLÉ TURTLES. Continue the tradition of gifting the famous striped box with friends and family during the holiday season with NESTLÉ TURTLES Classic Chocolate Recipe Holiday Gift Box (150 g). This specially designed holiday chocolate gift is packed full of individually-wrapped TURTLES chocolates. There's no denying the classic recipe of smooth caramel and pecan pieces draped in rich milk chocolate. The slow pull of creamy caramel and crunch of pecans is nothing less than pure delight. Prepared in Canada, NESTLÉ TURTLES are a proud Canadian tradition, perfect for gifting and sharing with loved ones. Maybe if you're lucky, the recipient will share a piece back and have you saying, \"MMM…I love TURTLES!\".",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "TURTLES Classic Recipe Holiday Gift BoxFeatures and Benefits",
    "Smooth caramel and crunchy pecan pieces draped in rich milk chocolate",
    "Individually wrapped in a festively-decorated gift box, all ready to sign and share",
    "NESTLÉ TURTLES Classic Chocolate Recipe Holiday Gift Box (150 g) is gluten-free, made with real pecans and natural flavours",
    "Made with sustainably sourced cocoa, certified by Rainforest Alliance, as part of the NESTLÉ Cocoa Plan",
    "Made with real pecans and all-natural flavours",
    "Proudly Prepared in Canada",
    "TURTLES Classic Recipe Holiday Gift BoxNutrition Information",
    "Per 2 pieces (34 g)Amount% DVCalories180Carbohydrate20gDietary Fiber1g4%Sugars18g18%Fat10g13%Cholesterol5mgSaturated3.5gTrans Fat0.1gProtein2gSodium40mg2%Amount% DVCalcium40mg3%Iron0.5mg3%Potassium100mg3%",
    "TURTLES Classic Recipe Holiday Gift BoxIngredients",
    "Milk Chocolate (Sugar, Cocoa Butter*, Milk Ingredients, Unsweetened Chocolate*, Soy Lecithin, Natural Flavour, Salt), Caramel (Sugars [Glucose, Sugar], Modified Milk Ingredients, Modified Palm Oil, Salt, Natural Flavour), Pecans. *Rainforest Alliance Certified.",
    "RECIPES",
    "AERO and TURTLES Bite Size Chocolate Pecan Rugelach",
    "Deriving from the Yiddish word meaning “little twists,” these delicious bite-size cookies are traditionally served during Hanukkah, and can be made with dried fruit, nuts, jams or, as in this recipe, chocolate! Aero and chocolate add decadence and delight to this holiday favourite",
    "TURTLES Eggnog Fudge",
    "When you combine two holiday favourites, do you get a favourite, favourite?",
    "TURTLES Pumpkin Mug Cake",
    "What’s better than having a TURTLES-pumpkin cake all to yourself? This recipe is here to make your dream come true.",
    "Classic Butter Tarts topped with TURTLES",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a classic dessert.",
    "TURTLES Baked Apples",
    "Treat the family to delicious TURTLES baked apples, and everyone will be thankful for YOU!",
    "You might be interested in"
  ]
}