{
  "metadata": {
    "url": "https://www.madewithnestle.ca/turtles/turtles-classic-recipe-share-bag",
    "category": "Product",
    "title": "TURTLES Classic Recipe Share Bag",
    "n_tokens": 394,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2024-07/turtles-classic-recipe-160g.png",
        "role": "recipe",
        "alt": "TURTLES Classic Recipe Share Bag"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-09/Turtles_Classic_Bag_12x100g_.png?itok=o58BDqgd",
        "role": "secondary",
        "alt": "Turtles Classic Bag 12x100g"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2022-11/00059800850315_A1C1.png?itok=MZIGS0Nh",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2023-12/TURTLES-Classic-Holiday-Gift-Box.png?itok=TffHhr_E",
        "role": "secondary",
        "alt": "TURTLES Classic Holiday Gift Box"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/medium/public/2024-07/turtles-classic-gift-box.png?itok=fLFgp141",
        "role": "recipe",
        "alt": "TURTLES Classic Recipe Holiday Gift Box "
      }
    ]
  },
  "text": [
    "TURTLES Classic Recipe Share Bag",
    "Canadians just love the irresistible taste of NESTLÉ TURTLES. Continue the tradition by sharing indulgence with NESTLÉ TURTLES Classic Recipe Chocolates Share Bag (160 g). Full of individually-wrapped TURTLES pieces – perfect for sharing with those who mean the most. There’s no denying the classic recipe of smooth caramel and pecan pieces draped in rich milk chocolate. The slow pull of creamy caramel and the crunch of pecans is nothing less than pure delight. It’s no surprise this has been a beloved Canadian treat since 1949.; Make the moments last with the Canadian tradition that always has you saying, \"MMM...I LOVE TURTLES!\".",
    "Where to Buy",
    "Features and Benefits",
    "Nutrition Information",
    "Ingredients",
    "TURTLES Classic Recipe Share BagFeatures and Benefits",
    "Smooth caramel and crunchy pecan pieces draped in rich milk chocolate",
    "Individually-wrapped in a festively-decorated bag, all ready to pass around to share",
    "NESTLÉ TURTLES Classic Recipe Chocolates Share Bag (160 g) are made gluten-free with real pecans and natural flavours",
    "We purchase Sustainably Sourced Cocoa certified by UTZ, as part of the NESTLÉ COCOA PLAN. We work with UTZ and farmers to improve the quality of their products and strengthen their communities",
    "Proudly Prepared in Canada",
    "TURTLES Classic Recipe Share BagNutrition Information",
    "Per 2 piecesAmount% DVCalories180Carbohydrate20gDietary Fiber1g4%Dietary FibreSugars18g18%Fat10g13%Cholesterol5mgSaturated3.5gTrans Fat0.1gProtein2gSodium40mg2%Amount% DVCalcium40mg3%Iron0.5mg3%Potassium100mg3%",
    "TURTLES Classic Recipe Share BagIngredients",
    "Milk Chocolate (Sugar, Cocoa Butter, Modified Milk Ingredients, Unsweetened Chocolate, Soy Lecithin, Natural Vanilla Flavour, Salt), Caramel (Sugars [Glucose, Sugar], Modified Milk Ingredients, Modified Palm Oil, Salt, Natural Vanilla Flavour), Pecans.",
    "RECIPES",
    "AERO and TURTLES Bite Size Chocolate Pecan Rugelach",
    "Deriving from the Yiddish word meaning “little twists,” these delicious bite-size cookies are traditionally served during Hanukkah, and can be made with dried fruit, nuts, jams or, as in this recipe, chocolate! Aero and chocolate add decadence and delight to this holiday favourite",
    "TURTLES Eggnog Fudge",
    "When you combine two holiday favourites, do you get a favourite, favourite?",
    "TURTLES Pumpkin Mug Cake",
    "What’s better than having a TURTLES-pumpkin cake all to yourself? This recipe is here to make your dream come true.",
    "Classic Butter Tarts topped with TURTLES",
    "How do you turn butter tarts into better tarts? With TURTLES of course! Impress your friends with an elevated version of a classic dessert.",
    "TURTLES Baked Apples",
    "Treat the family to delicious TURTLES baked apples, and everyone will be thankful for YOU!",
    "You might be interested in"
  ]
}