{
  "metadata": {
    "url": "https://www.madewithnestle.ca/WOF-world-flavours",
    "category": "Recipe",
    "title": "World of Flavours",
    "n_tokens": 1866,
    "n_tables": 0,
    "n_images": 2,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-06/01_MWN_hero_banner_F_en.jpg",
        "role": "package",
        "alt": "A world of Flavours - Made with Nestle"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-06/02_MWN_map_Final_en.jpg",
        "role": "secondary",
        "alt": "World Map with Nestle Logos"
      }
    ]
  },
  "text": [
    "FOLLOW US",
    "Sharing food & Sharing culture",
    "While we’ve all grown up with different cuisines and a world of flavours, we can always find a way to connect with others by sharing a meal together. Whether you’re enjoying traditional dishes from your own family or entertaining friends with a new recipe from a city across the world - food has the power to nourish and enlighten us about different cultures.",
    "As a global company with over 2,000 brands, Nestlé products are used in a variety of ways around the world.",
    "Thanks to our massive collection of recipes spanning more than 80 countries, we have a unique perspective into local food cultures and trends. In the spirit of celebrating Canada’s multiculturalism, we wanted to share some of our favourite recipes from around the globe so you can experience new cultures and maybe even be reminded of some familiar flavours.",
    "View our global recipes",
    "MILO Pastillas",
    "Indulge in a family-friendly, Filipino inspired treat…that’s as easy to whip up as it is delicious. These no-bake, bite-sized delights are ideal for summer days when you want to avoid turning on the oven. Made with the rich and chocolatey flavour of MILO, each piece is a sweet, chewy and creamy treat.",
    "10 mins.",
    "Carnation Frozen Hot Chocolate",
    "Create the perfect summer indulgent treat, frozen hot…chocolate. Simply blend with ice and milk, then enjoy!",
    "3 mins.",
    "KitKat Bar Matka Kulfi",
    "A delicious way to celebrate Eid, our Matka Kulfi is…going to bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka!",
    "15 mins.",
    "BOOST High Protein Matcha Coconut Bars",
    "Matcha green tea powder provides a punch of…healthy antioxidants. Combined with coconut, these bars become a decadent guiltless treat.",
    "8 mins.",
    "25 mins.",
    "NESQUIK Dalgona",
    "Enjoy a whipped Strawberry or Chocolate Dalgona with…this simple recipe - only 2 ingredients required!",
    "BOOST Just Protein Banana Crunch Loaf",
    "Banana bread is studded with chunks of walnuts…and BOOSTed with protein powder for a great post-workout or midday snack.",
    "65 mins.",
    "Coffee Mexican Wedding Cookies",
    "Mexican wedding cookies, also known as Polvorones,…are like a butter cookie with ground pecans. This cookie, which is actually enjoyed regularly in Mexico and other Latin countries, is even more delicious with added coffee flavour.",
    "52 mins.",
    "Meringue ROLO Cookies",
    "The airy lightness of French meringue is beautifully…contrasted by the gooey, caramel-filled ROLO Mini pieces. This easy dessert recipe combines the classic French baking techniques of the meringue, with the comfort of a traditional chocolate chip cookie.",
    "18 mins.",
    "30 mins.",
    "KitKat Almond Cookies",
    "Almond cookies are a \ncherished part of…Lunar\nNew Year as they are \nconsidered a symbol of good \nfortune. We add a chocolatey \nKitKat crunch to our recipe, \nensuring happiness all \naround! \nThis easy recipe bakes up \ndelicious almond scented \ncookies with a golden crackly \nshell and soft, crumbly \ninterior, topped off with a \npiece of our irresistible KitKat \nMinis!",
    "KIT KAT Chunky Sweet ‘n’ Salty Cookies",
    "Who says sweet and salty can't live together? Pairing…pretzels, peanuts and KIT KAT chocolate, these cookies provide historic flavour harmony with every bite.",
    "13 mins.",
    "Coffee-Marinated Korean Short Ribs",
    "Korean short ribs, otherwise known as “galbi,” refers to…a strip of beef cut across the bone from the chuck end of the short ribs. Unlike American- and European-style short ribs, which include a thick slice of bone-in beef, Korean-style short ribs are cut lengthwise across the rib bone. The lengthwise cut helps to soak up the rich, Korean flavor–infused coffee marinade and serves to help grill it up quickly.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Spicy Thai Coconut Soup",
    "This soup, otherwise known in Thailand as Tom Kha,…gets its name from tom, meaning soup, and kha, meaning “galangal,” a type of aromatic root vegetable. Make this quick and easy Thai classic at home, fragrant with herbs and spices, for dinner tonight.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "20 mins.",
    "Middle Eastern Cauliflower Bites with Coffee Tahini Dip",
    "Tahini, or toasted ground sesame seeds, comes from…Persia, where it was called “ardeh.” For hundreds of years, only the aristocracy and wealthy could obtain the ingredients to make tahini – in some cultures, tahini was used as currency! Enjoy this delicious healthy appetizer that gets extra depth of flavor from Nescafé Gold.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Pad Thai arc-en-ciel sans noix | Découvrez Fait avec Nestlé",
    "Pad Thai was created in the 1930s in Thailand by Plaek…Phibunsongkhram, who was the prime minister at the time. Noodles are economical to produce and could be dried and kept for long periods of time. The amount of rice used to make noodles was 50 per cent of what would be consumed if it was eaten unprocessed, so noodles essentially doubled Thailand’s rice stores. Colorful vegetables stir-fried with rice noodles and a lip-smacking sauce make this a delicious and easy alternative to take-out.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "40 mins.",
    "Latin Burgers with Caramelized Onions",
    "Latin cuisine prides itself on the depth and diversity of…flavors that result from using local and readily available ingredients. Latin food is sometimes known for being spicy, it’s true – but it’s also hearty, sweet, savory, refined, comforting, healthy, smoky, salty, and over-the-top delicious – just like this dish. These zesty burgers combine chorizo, a spicy jalapeño relish and Maggi Liquid Seasoning for a super-craveable Latin flavor explosion!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "27 mins.",
    "MAGGI Egg Bhurji Noodles",
    "Looking for a quick and easy Maggi Egg Recipe? Look no…further than our Egg Bhurji recipe! This classic and simple dish takes scrambled eggs to a whole new level of deliciousness. With just 8 simple ingredients, you can whip up a delicious meal that combines the goodness of scrambled eggs with the convenience of Maggi 2 minute noodles. In just a few minutes, you'll have a hearty, satisfying and comforting dinner. Grab your favourite pack of MAGGI Masala Noodles and get cooking.",
    "Dafaduka from Central/West Africa",
    "Dafaduka is a delicious and traditional dish from Africa…that is earthy and full of flavour. Give it a try and let us know what you think!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Chicken Cacciatore from Italy",
    "Did you know that \"cacciatore\" means…\"hunter\" in Italian? Therefore, alla cacciatora usually means \"hunter style\". This particular dish incorporates a tomato-based sauce with onions and garlic; and is sure to be a family-favourite that everyone will love!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Tabbouleh Salad from the Middle East",
    "Tabbouleh is a classic Middle Eastern salad, punchy with…parsley and mint; and in this case, finished with sweet and sour MEZEAST pomegranate sauce.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Chingri Malai Curry from India",
    "A conversation about traditional Bengali cuisine…can never be complete without Chingri-Malai Curry! ‘Chingri’ means prawn and ‘Malai’ means cream, but it’s the coconut milk in this recipe that gives it the creaminess and smooth texture. So, if you love seafood and are in the mood to have something delicious, this is a recipe you need to try!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "45 mins.",
    "Grilled Kofta from the Middle East",
    "Bring the family together and enjoy the delicious taste of…grilled kofta prepared with Maggi BBQ Seasoning for a quick and simple recipe you can cook in no time!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Homemade Naan from Mauritius",
    "This recipe yields soft and fluffy homemade naan…bread that will have you coming back for more!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "MAGGI Biryani Noodles Recipe",
    "Biryani or your favourite MAGGI Masala Noodles?…Now you don't have to choose. This epic MAGGI Noodles Biryani Recipe combines your favourite 2-Minute Masala Noodles with a Biryani twist. Packed with lots of vegetables and aromatic spices, this easy and delicious meal will be a hit with the whole family. It can be served at home for everyday cooking or for special occasions like holidays and celebrations.",
    "COFFEE ICE CREAM FUDGE CAKE",
    "Coffee ice cream sandwiched between layers of rich…chocolate cake, coated in chocolate ganache.",
    "33 mins.",
    "35 mins."
  ]
}