{
  "metadata": {
    "url": "https://www.madewithnestle.ca/WOF-world-holidays",
    "category": "Product",
    "title": "A World of Flavours Holidays and Recipes",
    "n_tokens": 497,
    "n_tables": 0,
    "n_images": 1,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2021-06/01_MWN_hero_banner_F_en.jpg",
        "role": "package",
        "alt": "A world of Flavours"
      }
    ]
  },
  "text": [
    "A World of Flavours holidays and recipes",
    "Check out our holiday content below to bask in the aromas of various spices, savour the mouth-watering palates, and tickle your taste buds with something new!",
    "Diwali, the festival of Lights",
    "A time for vibrant colours, fireworks, lights and, of course, mouth-watering food",
    "Hanukkah",
    "With not one but eight nights of celebration, there’s plenty of opportunity to enjoy delicious food during Hanukkah while spending time with your closest family and friends.",
    "French Canadian Christmas",
    "Many French-Canadian desserts were crafted by the working class with kitchen staples on hand like; butter, flour, milk and sweeteners such as brown sugar, maple syrup or molasses. Try out some of these delicious economical desserts made with Nestle products!",
    "Happy Earth Day!",
    "Earth Day, also known as “International Mother Earth Day” around the world, takes place every year on April 22. This annual event demonstrates support for environmental protection.",
    "Happy Passover!",
    "Passover is a Jewish holiday that celebrates the Israelites being freed from slavery in Egypt. It is observed for seven or eight days and during the first two nights, Passover is celebrated with a home ritual known as the Passover Seder.",
    "Happy Holi!",
    "Holi, also known as the festival of colours, is a Hindu festival, which marks the end of the winter season and welcomes the spring. We've got some delicious colourful recipes for you to try. Learn more fun facts about Holi and discover some Nestlé recipes!",
    "Happy Asian Heritage Month!",
    "Celebrated across Canada every May, Asian Heritage month presents an opportunity to learn about, reflect on and celebrate the many contributions that Canadians of Asian descent have made and continue to make on Canadian society.",
    "Oh Canada!",
    "A gorgeous country, with a rich history, a vast amount of land and cuisine inspired by a variety of cultures. Every year on July 1, the nation celebrates Canada Day, a day for all those who call Canada their home to celebrate. What better way to bring Canadians together than through the love of food?",
    "Learn how Nestlé Supports the LGBTQI2S Community",
    "At Nestlé Canada, Diversity, Equity & Inclusion is our everyday reality. We respect and encourage uniqueness and potential, regardless of race, gender, culture, sexual orientation or disability.",
    "Celebrate Carnival with Nestlé",
    "This year’s Toronto Caribbean Carnival theme is “On De Road Again” to mark the first parade in Toronto, Canada since 2019! Caribana, is a festival held each summer dedicated to all the vibrant Caribbean cultures. Join Nestlé Canada and explore some of the mouth-watering foods inspired by Caribbean cuisine.",
    "Ramadan Mubarak!",
    "For many, Ramadan is a time to feel closer to God, pray, spend time with loved ones, support charities and remember those less fortunate while fasting. Learn more about Muslim cultural traditions, and check out our Nestlé recipes to be enjoyed after sundown!",
    "National Indigenous Peoples Day",
    "A day for all Canadians to recognize and celebrate the unique heritage, diverse cultures and outstanding contributions of First Nations, Métis, and Inuit peoples."
  ]
}