{
  "metadata": {
    "url": "https://www.madewithnestle.ca/WOF-world-pride",
    "category": "Promo",
    "title": "World Pride",
    "n_tokens": 919,
    "n_tables": 0,
    "n_images": 3,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-05/03-Banner.jpg",
        "role": "secondary",
        "alt": "People holding pride flags"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-05/08-Footer.jpg",
        "role": "secondary",
        "alt": "colourful food"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-05/07-Footer.jpg",
        "role": "secondary",
        "alt": "colourful foods"
      }
    ]
  },
  "text": [
    "Happy Pride!",
    "Pride Month is all about promoting love, acceptance, equality, inclusion, self-affirmation and creating a safe space for 2SLGBTQIA+  people to be who they are.",
    "Celebrate Pride with Nestlé Canada",
    "The month of June is a time to honour the important historical events in the 2SLGBTQIA+ community and raise awareness on what more can be done. This PRIDE month, be proud and be flavourful! To celebrate this colourful occasion, we’ve got bright, vibrant, and delicious rainbow recipes. Get inspired and add a little colour to your plate using naturally bright fruits and veggies that look great and taste even better. From our Rainbow Pad Thai to our pretty Pride smoothie bowls, we’ve got delicious and colourful ways to add a little extra love as you celebrate this meaningful month.",
    "A World of Flavours is all about Culture, Community & Cooking. We believe that we can always find a way to connect with others through the love of food and by sharing a meal together. There’s a seat for everyone at our multicultural table.",
    "KitKat and its partner Friends of Ruby wish you a very happy Pride month!",
    "Friends of Ruby’s mission is to support the progressive well-being of 2SLGBTQIA+ youth through mental health, counselling and housing support programs. Together, KitKat and Friends of Ruby want to continue to celebrate individuality and self-expression by encouraging the world to#CelebrateWhoYouAre.",
    "This month, the brand is releasing a limited-edition KitKat Bar available from June 1st to June 30th. All proceeds of every sale will be donated to Friends of Ruby to support their mental health programs.",
    "Brighten up your Breakfast",
    "Spicy Vegetarian Chinese-inspired Breakfast Crepes",
    "Inspired by popular Chinese street food, these…jianbing-style savoury crepes are packed with texture, colour, and flavour, and are balanced with the perfect amount of heat! Using carbonated water for the batter results in a fluffy, delicate consistency for these vegetarian breakfast crepes.",
    "7 mins.",
    "38 mins.",
    "Coconut Acai Smoothie Bowl",
    "Coconut? Yep. Acai? Uh-huh. Wholesome nutrition? Of…course. You’ll find them all in our new Coconut Acai Smoothie Bowl made with BOOST Original Powder. This delicious and nutritious recipe makes a great addition to a balanced breakfast.",
    "0 mins.",
    "5 mins.",
    "Masala Vegetable Fritter Eggs Benedict",
    "Using whole veggies, and Indian-style garam masala…– a fragrant spice blend made with a blend of warm, fragrant spices – this delicious twist on a brunch-time favourite is sure to be a delicious and eco-friendly hit! Blender hollandaise makes preparation a breeze, so less time is spent fussing in the kitchen and more time can be spent eating and enjoying around the table!",
    "26 mins.",
    "42 mins.",
    "Add colour to your main courses",
    "Spicy Thai Coconut Soup",
    "This soup, otherwise known in Thailand as Tom Kha,…gets its name from tom, meaning soup, and kha, meaning “galangal,” a type of aromatic root vegetable. Make this quick and easy Thai classic at home, fragrant with herbs and spices, for dinner tonight.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "20 mins.",
    "30 mins.",
    "Pad Thai arc-en-ciel sans noix | Découvrez Fait avec Nestlé",
    "Pad Thai was created in the 1930s in Thailand by Plaek…Phibunsongkhram, who was the prime minister at the time. Noodles are economical to produce and could be dried and kept for long periods of time. The amount of rice used to make noodles was 50 per cent of what would be consumed if it was eaten unprocessed, so noodles essentially doubled Thailand’s rice stores. Colorful vegetables stir-fried with rice noodles and a lip-smacking sauce make this a delicious and easy alternative to take-out.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "40 mins.",
    "Vegan Pride Rainbow Toppings Pizza",
    "Celebrate Pride with this tasty vegan rainbow…recipe! A simple, colorful and fun recipe that everyone will love.",
    "Vegan Sensational Samosas",
    "These delicious vegan samosas are the perfect…snack or  starters for your Indian-inspired dinner menu. These savoury goodies are sure to become your next party favourite - enjoy for Diwali or any day of the week!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Learn how Nestlé Supports the LGBTQI2S Community",
    "At Nestlé Canada, Diversity, Equity & Inclusion is our everyday reality. We respect and encourage uniqueness and potential, regardless of race, gender, culture, sexual orientation or disability.",
    "Make your next dessert vibrant",
    "Canadian SMARTIES Cookies",
    "Did you know that SMARTIES are a Canadian-centered…confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love.",
    "15 mins.",
    "9 mins.",
    "Strawberry SMARTIES Hearts",
    "Fall in love with a new Valentine’s Day treat!",
    "10 mins.",
    "SMARTIES Chocolate Cupcake Snake",
    "This sneaky SMARTIES snake is sure to please the crowd!",
    "SMARTIES Cake Pops",
    "A playful creation perfect for colourful celebrations!",
    "16 mins."
  ]
}