{
  "metadata": {
    "url": "https://www.madewithnestle.ca/world-indigenous",
    "category": "Promo",
    "title": "World National Indigenous Day",
    "n_tokens": 524,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-06/02_mid1.jpg",
        "role": "secondary",
        "alt": "wheatgrass"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-06/07_mid2_1.jpg",
        "role": "secondary",
        "alt": "mountains and valley"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-06/01_bison.png?itok=_RFGNgsj",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-06/02_blueberry.png?itok=3Pz8Nf6d",
        "role": "secondary",
        "alt": ""
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-06/03_plant.png?itok=EwG4Tpe5",
        "role": "secondary",
        "alt": ""
      }
    ]
  },
  "text": [
    "National Indigenous Peoples Day",
    "National Indigenous Peoples Day is a day for all Canadians to recognize and celebrate the unique heritage, diverse cultures and outstanding contributions of First Nations, Métis, and Inuit peoples. This day takes place every year on June 21, and we'd like to join in the celebration by sharing some Indigenous inspired recipes to celebrate.",
    "FOLLOW US",
    "Each Indigenous Nation has its own culture, customs, beliefs, traditions, cultural practices, symbols, and traditional foods. We’d like to join in on the celebration by sharing some delicious Canadian inspired Indigenous cuisine. Try some new flavours and explore a First Nations, Métis or Inuit inspired recipe.",
    "Keep Exploring our Indigenous Inspired Recipes",
    "MAGGI Bouillon Three Sisters Soup",
    "“Three Sisters” refers to the main ingredients used by the Mohawk, Oneida, Onodaga, Cayuga, Seneca and  Tuscarora…First Nations. This hearty, delicious meal is comprised primarily of – corn, beans, and squash – and the traditional methods used to cultivate these crops in a sustainable and productive way. This balanced soup is packed with healthy carbs, protein, and fibre, and is a culinary celebration of Indigenous cultures.",
    "20 mins.",
    "35 mins.",
    "Rich Maple Bison Chili with NESCAFE",
    "Bison is a rich source of protein, while being low in fat. Consuming less grass than cattle, bison is a reliable and…abundant food source – providing not only nutrition for Indigenous people, but hides to make clothing and blankets, bones to create tools, jewelry, and fats used for cooking. All parts of the animal were used – and this chili recipe is a nod to sustainable cooking inspired by the First Nations and Métis communities.",
    "25 mins.",
    "45 mins.",
    "MILO Malt & Chocolate Maple Taffy",
    "This delicious recipe is inspired by the Huron-Wendat’s (and other Indigenous communities) cultural use and…understanding of maple trees, its sap, and the traditional methods of processing used to create one of Canada’s most loved and well-known condiment – maple syrup. This sweet and interactive snack is now a popular attraction at sugar shacks (or cabane à sucre) across the country during harvest season.",
    "15 mins.",
    "Wild Rice & Smoked Salmon Salad",
    "For many Indigenous groups, salmon is a primary source of nourishment – and is a symbol of abundance, fertility,…prosperity, and renewal. Smoking is a sustainable, and traditional method used to preserve the meat. This is a technique that is passed down from one generation to the next.",
    "NESQUIK Vanilla Northern Doughnuts",
    "A classic, these doughnuts are a dining table staple in many Indigenous communities. Finished with cinnamon and…sugar, or paired with a tart Indigenous-inspired Wojapi Sauce, these doughnuts are perfect for a snack or dessert. For reducing food waste –donut holes can be fried separately to create delicious bite-size pieces!",
    "Chocolate Bannock Mixed Berry Shortcakes",
    "This lightly sweetened and fresh fruit dessert is a healthier and lightened-up version of shortcake that tastes as good as it…looks. Try this classic recipe with a hint of maple syrup and our added twist using BOOST Powdered Chocolate. Dusted with a bit of icing sugar or garnished with a fresh mint leaf, these 6 beautiful and delicious shortcakes will be great for sharing with your loved ones.",
    "FUN FACTS"
  ]
}