{
  "metadata": {
    "url": "https://www.madewithnestle.ca/world-earth-day",
    "category": "Promo",
    "title": "World Earth Day",
    "n_tokens": 857,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-04/02_empty_sustainability-facts.jpg",
        "role": "nutrition",
        "alt": "forest"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/01_co2.png?itok=cr2_YW9t",
        "role": "secondary",
        "alt": "CO2"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/02_recycle.png?itok=Uugh53EL",
        "role": "secondary",
        "alt": "recycling symbol"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/03_sustainable.png?itok=hEc5bTRq",
        "role": "secondary",
        "alt": "plant box"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/04_cocoa.png?itok=UEZqyK-5",
        "role": "secondary",
        "alt": "cocoa plant"
      }
    ]
  },
  "text": [
    "Happy Earth Day!",
    "Earth Day, also known as “International Mother Earth Day” around the world, takes place every year on April 22. This annual event demonstrates support for environmental protection.",
    "The History of Earth Day",
    "The first Earth Day celebration officially took place in 1970 and now includes a wide range of events celebrated by approximately 1 billion people in over 190 countries.",
    "The idea for Earth Day was proposed by Senator Gaylord Nelson from Wisconsin who was concerned about the deteriorating environment in the United States after witnessing a massive oil spill in Santa Barbara, California in 1969.  The first Earth Day was focused primarily on impacts in the United States. In 1990, the National Coordinator Denis Hayes, took it international and organized events across 141 nations.",
    "Nestlé Canada Sustainability Highlights",
    "Keep Exploring",
    "Smoky Thai Garden Vegan Burgers",
    "NESCAFÉ GOLD Medium Roast Instant Coffee adds rich, full-bodied flavour to these delicious plant-based burgers. This…recipe is perfect for veggie lovers.",
    "23 mins.",
    "10 mins.",
    "Pad Thai arc-en-ciel sans noix | Découvrez Fait avec Nestlé",
    "Pad Thai was created in the 1930s in Thailand by Plaek Phibunsongkhram, who was the prime minister at the time.…Noodles are economical to produce and could be dried and kept for long periods of time. The amount of rice used to make noodles was 50 per cent of what would be consumed if it was eaten unprocessed, so noodles essentially doubled Thailand’s rice stores. Colorful vegetables stir-fried with rice noodles and a lip-smacking sauce make this a delicious and easy alternative to take-out.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "40 mins.",
    "20 mins.",
    "Latin Burgers with Caramelized Onions",
    "Latin cuisine prides itself on the depth and diversity of flavors that result from using local and readily available ingredients.…Latin food is sometimes known for being spicy, it’s true – but it’s also hearty, sweet, savory, refined, comforting, healthy, smoky, salty, and over-the-top delicious – just like this dish. These zesty burgers combine chorizo, a spicy jalapeño relish and Maggi Liquid Seasoning for a super-craveable Latin flavor explosion!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "27 mins.",
    "Middle Eastern Cauliflower Bites with Coffee Tahini Dip",
    "Tahini, or toasted ground sesame seeds, comes from Persia, where it was called “ardeh.” For hundreds of years, only the…aristocracy and wealthy could obtain the ingredients to make tahini – in some cultures, tahini was used as currency! Enjoy this delicious healthy appetizer that gets extra depth of flavor from Nescafé Gold.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "25 mins.",
    "Tabbouleh Salad from the Middle East",
    "Tabbouleh is a classic Middle Eastern salad, punchy with parsley and mint; and in this case, finished with sweet and…sour MEZEAST pomegranate sauce.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "15 mins.",
    "Canadian SMARTIES Cookies",
    "Did you know that SMARTIES are a Canadian-centered confectionery product? Try these yummy, chocolatey…Canadian Cookies! A treat kids of all ages will love.",
    "9 mins.",
    "“As the world’s largest producer of food and beverage, our vision is a future where none of our products end up in nature, and where the products that Canadians know and love, contribute to a healthy future for the generations to come. With our global footprint and vast supply chains, we understand the severity of climate change and we have made significant commitments and investments in climate initiatives to reduce our carbon footprint.”   -John Carmichael, CEO",
    "NESCAFÉ CUP OF RESPECT",
    "This program illustrates how our coffee is grown, made and packaged in a way that respects the environment and the people who farm the coffee beans. Our hope is that when you learn what we are doing around the world, you will see how it will impact the future of coffee. NESCAFE is on a mission to have 100% sustainability sourced coffee by 2025.",
    "While we source our cocoa from Côte d’Ivoire and Ghana, many of our products are made right here in Canada. We put tremendous effort into ensuring they’re made using quality ingredients sourced in a responsible way."
  ]
}