{
  "metadata": {
    "url": "https://www.madewithnestle.ca/world-flavours-holi",
    "category": "Promo",
    "title": "World of Flavours - Holi",
    "n_tokens": 670,
    "n_tables": 0,
    "n_images": 5,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-03/02-Banner.jpg",
        "role": "secondary",
        "alt": "Holi Food Banner"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-03/hands.png?itok=mEIQBI8z",
        "role": "secondary",
        "alt": "Holi Hands"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-03/fireworks.png?itok=k0SkjrSk",
        "role": "secondary",
        "alt": "Fireworks Holi"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-03/calendar.png?itok=KHu-1WYY",
        "role": "secondary",
        "alt": "Holi Calendar"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-03/powder.png?itok=6_JPyrU8",
        "role": "secondary",
        "alt": "Holi Powder"
      }
    ]
  },
  "text": [
    "Holi, also known as the festival of colours, is a Hindu festival, which marks the end of the winter season and welcomes the spring.We've got some delicious colourful recipes for you to try. Learn more fun facts about Holi and discover someNestlé recipes!",
    "Holi, is a Hindu spring festival which is celebrated in many places including India, Nepal, Mauritius, Fiji, Guyana, Trinidad and Tobago, Pakistan, and the Philippines. The delightful festival of Holi signifies the victory of good over evil. It also marks the end of winter season and welcomes the spring. It is an opportunity for people to come together and a great occasion for people from different religious communities, castes, and creeds to come together and strengthen their bonds, and repair broken relationships.",
    "Sign up to Learn More about World of Favours!",
    "While we’ve all grown up with different cuisines and a world of flavours, we can always find a way to connect with others by sharing a meal together.",
    "Become a member today and get even closer to the brands, and foods, you love. Sign up to receive coupons, discover new content, participate in giveaways and more!",
    "Learn more about Holi",
    "Orange scented Gulab Jamun",
    "Gulab jamun is an Indian dessert of fried dough balls that are soaked in a sweet, sticky sugar syrup. As per tradition, the…syrup has a delicate rose flavour: Gulab means 'rose water' and jamun refers to a berry of a similar size and colour.\nTry making this delicious orange scented Gulab Jamun and elevate your next dinner party.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "30 mins.",
    "Vegan Sensational Samosas",
    "These delicious vegan samosas are the perfect snack or  starters for your Indian-inspired dinner menu. These savoury…goodies are sure to become your next party favourite - enjoy for Diwali or any day of the week!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Colorful Chana Chaat Chickpea Salad",
    "This colourful Chana Chaat Chickpea Salad combines all the flavours, sweet, salty and uses our signature tangy Maggi…Sweet and Hot Sauce. Give the recipe a try and enjoy it for your Holi celebrations or even just a nice side salad for your next dinner with the family!",
    "Pistachio and Chocolate Burfi",
    "Try this show-stopping Indian recipe that never fails to impress. This mouthwatering treat will become a request for every…special event. For a nut-free version check out our traditional chocolate Barfi. Perfect for Diwali and all holiday occasions.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "21 mins.",
    "20 mins.",
    "Mawa Kheer",
    "Similar to rice pudding and sprinkled with raisins, almonds, and cashews, this decadent treat, often made for special…occasions such as Ramadan, Holi or Diwali, makes a great special pudding any time. Try this Mawa Kheer recipe and discover an easy and quick dessert to impress your friends and family at home.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "10 mins.",
    "5 mins."
  ]
}