{
  "metadata": {
    "url": "https://www.madewithnestle.ca/world-flavours-ramadan",
    "category": "Promo",
    "title": "Ramadan",
    "n_tokens": 781,
    "n_tables": 0,
    "n_images": 4,
    "images": [
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/dates.png?itok=tERazyoe",
        "role": "secondary",
        "alt": "Dates"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/praying.png?itok=clfbHqlx",
        "role": "secondary",
        "alt": "Muslim Praying"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/styles/thumbnail/public/2022-04/iftar.png?itok=8tRlwvTl",
        "role": "secondary",
        "alt": "Iftar Ramadan"
      },
      {
        "url": "https://www.madewithnestle.ca/sites/default/files/2022-04/05-Footer.jpg",
        "role": "secondary",
        "alt": "Ramadan lights"
      }
    ]
  },
  "text": [
    "Ramadan Mubarak",
    "The month of Ramadan (or Ramzan) is all about self-reflection, sharing, community and, of course, food!",
    "Many families have their own traditions and rituals when it comes to Ramadan but some of  the fondest memories are made in the kitchen. The sweet, spiced aromas of fresh dates, crunchy nuts and savoury snacks are enough to bring all those recollections flooding back. We’ve got some tasty recipes that are perfect for Iftar during Ramadan or anytime!",
    "The smells and flavours of Ramadan are not only delicious, but they also bring back nostalgic memories of community and togetherness. The aroma of charred meats on the grill, the crackling sound of deep-fried pakoras and the irresistible smell and taste of traditional desserts all remind us of sharing meals, the importance of giving – making sure no one is left behind, and spending quality time with loved ones during the holy month.",
    "We hope you enjoy these tantalizing recipes using ingredients like ground cardamom, sweetened condensed milk, fresh herbs, sweet dates, and punchy ginger just to name a few!",
    "Celebrate Ramadan with energizing suhur recipes that will prepare you for the day and iftar dishes that will bring everyone together.",
    "MAGGI Masala Chilli Chatpata Chicken",
    "A delicious way to break your fast at Iftar, this easy recipe…comes together very quickly and tastes great with warm naan!",
    "10 mins.",
    "8 mins.",
    "KitKat Bar Matka Kulfi",
    "A delicious way to celebrate Eid, our Matka Kulfi is…going to bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka!",
    "15 mins.",
    "Quality Street Khajoor Cake",
    "Perfect for Iftar, this cake is rich with dates that restore…energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake!",
    "30 mins.",
    "Middle Eastern Cauliflower Bites with Coffee Tahini Dip",
    "Tahini, or toasted ground sesame seeds, comes from…Persia, where it was called “ardeh.” For hundreds of years, only the aristocracy and wealthy could obtain the ingredients to make tahini – in some cultures, tahini was used as currency! Enjoy this delicious healthy appetizer that gets extra depth of flavor from Nescafé Gold.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "25 mins.",
    "We’ve got some tasty recipes that are perfect for Iftar during Ramadan or anytime!",
    "Chicken Tagine with Dates and Green Olives",
    "Tagine is the name of the cooking vessel, used in…Middle Eastern cooking. Don’t worry if you don’t have a tagine as we have made this recipe easy to cook in a casserole dish.",
    "Tabbouleh Salad from the Middle East",
    "Tabbouleh is a classic Middle Eastern salad, punchy with…parsley and mint; and in this case, finished with sweet and sour MEZEAST pomegranate sauce.\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "MAGGI Pistachio and Dates Truffles",
    "Enjoy these tasty and nutritious Pistachio and…dates truffles as a snack or quick dessert. Perfect for on the go or for a light treat to devour at home!",
    "Grilled Kofta from the Middle East",
    "Bring the family together and enjoy the delicious taste of…grilled kofta prepared with Maggi BBQ Seasoning for a quick and simple recipe you can cook in no time!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "Stuffed Zucchini and Vine Leaves with Lamb Chops from the Middle East",
    "Prepare this classic and delicious dish from the…Middle East for your family and friends - it won't disappoint!\n\nSome of the products used in these recipes are not available for purchase Canada. Therefore we encourage you wherever possible to find local alternative products. Nestlé Canada Inc. does not recommend using Nestlé products not for sale in Canada and is not liable for any injuries related to the purchase and consumption of these products.",
    "BOOST Just Protein Banana Nut Smoothie",
    "Frozen bananas add texture, sweetness and a flavour…BOOST to this protein-rich smoothie. Dates are a source of fibre and potassium."
  ]
}